[{"_id": "k5E94C9arB8fx7xni", "title": "Making beliefs pay rent", "postedAt": "2015-06-16T23:00:00.000Z", "htmlBody": "<p>Thus begins the ancient parable:</p><p><i>If a tree falls in a forest and no one hears it, does it make a sound? One says, “Yes it does, for it makes vibrations in the air.” Another says, “No it does not, for there is no auditory processing in any brain.”</i></p><p>If there’s a foundational skill in the martial art of rationality, a mental stance on which all other technique rests, it might be this one: the ability to spot, inside your own head, psychological signs that you have a mental map of something, and signs that you don’t.</p><p>Suppose that, after a tree falls, the two arguers walk into the forest together. Will one expect to see the tree fallen to the right, and the other expect to see the tree fallen to the left? Suppose that before the tree falls, the two leave a sound recorder next to the tree. Would one, playing back the recorder, expect to hear something different from the other? Suppose they attach an electroencephalograph to any brain in the world; would one expect to see a different trace than the other?</p><p>Though the two argue, one saying “No,” and the other saying “Yes,” they do not anticipate any different experiences. The two think they have different models of the world, but they have no difference with respect to what they expect will <i>happen to</i> them; their maps of the world do not diverge in any sensory detail.</p><p>It’s tempting to try to eliminate this mistake class by insisting that the only legitimate kind of belief is an anticipation of sensory experience. But the world does, in fact, contain much that is not sensed directly. We don’t see the atoms underlying the brick, but the atoms are in fact there. There is a floor beneath your feet, but you don’t <i>experience</i> the floor directly; you see the light <i>reflected</i> from the floor, or rather, you see what your retina and visual cortex have processed of that light. To infer the floor from seeing the floor is to step back into the unseen causes of experience. It may seem like a very short and direct step, but it is still a step.</p><p>You stand on top of a tall building, next to a grandfather clock with an hour, minute, and ticking second hand. In your hand is a bowling ball, and you drop it off the roof. On which tick of the clock will you hear the crash of the bowling ball hitting the ground?</p><p>To answer precisely, you must use beliefs like <i>Earth’s gravity is 9.8 meters per second per second,</i> and <i>This building is around 120 meters tall.</i> These beliefs are not wordless anticipations of a sensory experience; they are verbal-ish, propositional. It probably does not exaggerate much to describe these two beliefs as sentences made out of words. But these two beliefs have an inferential <i>consequence</i> that is a direct sensory anticipation—if the clock’s second hand is on the 12 numeral when you drop the ball, you anticipate seeing it on the 1 numeral when you hear the crash five seconds later. To anticipate sensory experiences as precisely&nbsp;as possible, we must process beliefs that are not anticipations of sensory experience.</p><p>It is a great strength of <i>Homo sapiens</i> that we can, better than any other species in the world, learn to model the unseen. It is also one of our great weak points. Humans often believe in things that are not only unseen but unreal.</p><p>The same brain that builds a network of inferred causes behind sensory experience can also build a network of causes that is not connected to sensory experience, or poorly connected. Alchemists believed that phlogiston caused fire—we could simplistically model their minds by drawing a little node labeled “Phlogiston,” and an arrow from this node to their sensory experience of a crackling campfire—but this belief yielded no advance predictions; the link from phlogiston to experience was always configured after the experience, rather than constraining the experience in advance.</p><p>Or suppose your English professor teaches you that the famous writer Wulky Wilkinsen is actually a “retropositional author,” which you can tell because his books exhibit “alienated resublimation.” And perhaps your professor knows all this because their professor told them; but all they're able to say about resublimation is that it's characteristic of retropositional thought, and of retropositionality that it's marked by alienated resublimation. What does this mean you should expect from Wulky Wilkinsen’s books?</p><p>Nothing. The belief, if you can call it that, doesn’t connect to sensory experience at all. But you had better remember the propositional assertions that “Wulky Wilkinsen” has the “retropositionality” attribute and also the “alienated resublimation” attribute, so you can regurgitate them on the upcoming quiz. The two beliefs are connected to each other, though still not connected to any anticipated experience.</p><p>We can build up whole networks of beliefs that are connected only to each other—call these “floating” beliefs. It is a uniquely human flaw among animal species, a perversion of <i>Homo sapiens</i>’s ability to build more general and flexible belief networks.</p><p>The rationalist virtue of <i>empiricism</i> consists of constantly asking which experiences our beliefs predict—or better yet, prohibit. Do you believe that phlogiston is the cause of fire? Then what do you expect to see happen, because of that? Do you believe that Wulky Wilkinsen is a retropositional author? Then what do you expect to see because of that? No, not “alienated resublimation”; <i>what experience will happen to you?</i> Do you believe that if a tree falls in the forest, and no one hears it, it still makes a sound? Then what experience must therefore befall you?</p><p>It is even better to ask: what experience <i>must not</i> happen to you? Do you believe that <i>Élan vital</i> explains the mysterious aliveness of living beings? Then what does this belief <i>not</i> allow to happen—what would definitely falsify this belief? A null answer means that your belief does not <i>constrain</i> experience; it permits <i>anything</i> to happen to you. It floats.</p><p>When you argue a seemingly factual question, always keep in mind which difference of anticipation you are arguing about. If you can’t find the difference of&nbsp;anticipation, you’re probably arguing about labels in your belief network—or even worse, floating beliefs, barnacles on your network. If you don’t know what experiences are implied by Wulky Wilkinsens writing being retropositional, you can go on arguing forever.</p><p>Above all, don’t ask what to believe—ask what to anticipate. Every question of belief should flow from a question of anticipation, and that question of anticipation should be the center of the inquiry. Every guess of belief should begin by flowing to a specific guess of anticipation, and should continue to pay rent in future anticipations. If a belief turns deadbeat, evict it.</p><p>&nbsp;</p><p><i>This work is licensed under a&nbsp;</i><a href=\"https://creativecommons.org/licenses/by/4.0/\"><i>Creative Commons Attribution 4.0 International License</i></a><i>.</i></p>", "user": {"username": "EliezerYudkowsky"}}, {"_id": "tvzwsDReDx9zLGmkr", "title": "Key Questions about Philanthropy, Part 2: Choosing Focus Areas and Hiring Program Staff", "postedAt": "2015-07-09T13:31:54.933Z", "htmlBody": "<p><i>Note: The Open Philanthropy Project was </i><a href=\"https://www.openphilanthropy.org/blog/open-philanthropy-project-formerly-givewell-labs\"><i>formerly known as GiveWell Labs</i></a><i>. Before the launch of the Open Philanthropy Project Blog, this post appeared on the </i><a href=\"http://blog.givewell.org/\"><i>GiveWell Blog</i></a><i>. Uses of “we” and “our” in the below post may refer to the Open Philanthropy Project or to GiveWell as an organization. Additional comments may be available at the </i><a href=\"http://blog.givewell.org/2015/07/09/key-questions-about-philanthropy-part-2-choosing-focus-areas-and-hiring-program-staff/\"><i>original post</i></a><i>.</i></p><p>This post is second in a <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-1-what-role-funder\">series on fundamental questions about philanthropy </a>that we’ve grappled with in starting a grantmaking organization (see link for the series intro). In this post, we discuss the following questions:</p><ul><li><strong>Should a funder set explicit focus areas, and if so, how should they choose the focus areas?</strong> We believe it generally makes sense to declare focus areas (i.e., causes that one plans to focus on). While it’s common for philanthropists to choose focus areas based on preexisting personal passions, we are taking a different approach. This choice is arguably the most important a funder makes, and we are trying to be strategic about it. <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-2-choosing-focus-areas-and-hiring-program-staff#Sec1\">More</a></li><li><strong>How many focus areas should one work in?</strong> We’re highly undecided about this question. We see most funders working in relatively few focus areas, with a high level of depth and expertise. But we also see some appeal in the idea of pursuing more breadth at the cost of depth. <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-2-choosing-focus-areas-and-hiring-program-staff#Sec2\">More</a></li><li><strong>What does a program staffer do on a day-to-day basis?</strong> We use the term “program staff” to refer to the staff who have primary responsibility for finding and evaluating giving opportunities (though not necessarily making the final grant decision). One clear part of their role is checking in on existing grants. But it’s less obvious what the most effective activities are for finding new giving opportunities. Our sense is that the most valuable activities include articulating and refining one’s grantmaking priorities, as well as networking. It strikes us that these activities may often lead to higher returns than running an open-ended grant application process. <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-2-choosing-focus-areas-and-hiring-program-staff#Sec3\">More</a></li><li><strong>What sort of person makes a good program staffer?</strong> We are still forming our views on this question. Some qualities we think are generally important include strong alignment and communication with the people who will ultimately be responsible for grantmaking decisions (e.g., any executives and funders working with the program staffers); a strong sense of one’s strengths and weaknesses; and strong interpersonal skills. <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-2-choosing-focus-areas-and-hiring-program-staff#Sec4\">More</a></li></ul><h1>Should a funder set explicit focus areas, and if so, how?</h1><p>We believe it generally makes sense to declare focus areas (i.e., causes that one plans to focus on). We laid out our reasoning in two previous posts: <a href=\"https://www.openphilanthropy.org/blog/refining-goals-givewell-labs\">Refining the Goals of GiveWell Labs</a> and <a href=\"https://www.openphilanthropy.org/blog/importance-committing-causes\">The Importance of Committing to Causes</a>. In brief, setting focus areas allows one to be deliberate about building networks and expertise around particular topics, which in turn become useful for finding and evaluating many different giving opportunities. Having focus areas also can provide a rule of thumb for “quickly saying no” to many opportunities, proposals and events; this can be a major time-saver.</p><p>Many seem to believe that philanthropists should choose their focus areas based on their personal passions and interests rather than analysis. The Open Philanthropy Project is <a href=\"https://www.openphilanthropy.org/blog/strategic-cause-selection\">taking a different approach</a>. The choice of focus area is arguably the most important decision a philanthropist makes. We believe it’s possible for additional philanthropy to accomplish more in some areas than others, depending on factors such as how much impact an issue has on people’s lives, what can be done about it, and how many funders are already working on it. We also believe that it can be very costly to change one’s mind about focus areas, due to the importance of commitment as a funder (see link above).</p><p>Our process involves investigating many causes at relatively low depth, then some causes at higher depth, before finally choosing focus areas based on the criteria of importance, tractability and uncrowdedness.</p><h1>How many focus areas should one work in?</h1><p>We’ve thought a fair amount about the question of <a href=\"https://www.openphilanthropy.org/blog/expert-philanthropy-vs-broad-philanthropy\">whether we ought to prioritize deep expertise or breadth in our philanthropy</a>. That is, holding staff and budget constant, should we make deep commitments to a small number of focus areas, or keep tabs on a larger number of areas and make grants opportunistically, i.e. when outstanding opportunities arise? We’re quite undecided on this question, and we’re currently seeking to experiment with both approaches. As discussed in our recent updates on our work in <a href=\"https://www.openphilanthropy.org/blog/open-philanthropy-project-update-us-policy\">U.S. policy</a> and <a href=\"https://www.openphilanthropy.org/blog/open-philanthropy-project-update-global-catastrophic-risks\">global catastrophic risks</a>, we are seeking full-time staff to specialize in some causes, while taking a “broad” approach to covering others.</p><p>Of course, a funder’s budget and staff capacity are also major factors in how many focus areas are appropriate. The answer to “how much funding should we allocate to one focus area?” depends heavily on the area. There are causes we’ve encountered where small amounts of funding could make a big difference, and causes where much larger amounts would be needed to have any hope of much influence.</p><h1>What does a program staffer do on a day-to-day basis?</h1><p>We use the term “program staff” to refer to the staff who have primary responsibility for finding and evaluating giving opportunities (though not necessarily making the final grant decision). The most common titles for such staff seem to be “Program Officer” and “Program Director.” For simplicity, we use the term “program staffer” below. We use the term “manager” to refer to the person who evaluates the work of a program staffer.</p><p>Two clear roles of program staffers are evaluating new promising giving opportunities and following the progress of existing grants. These activities seem relatively straightforward to picture: they involve formulating and asking key questions, and working with grantees and other sources to get answers.</p><p>We’ve had more trouble picturing how a program staffer <i>finds</i> potential giving opportunities. Our impression is that:</p><ul><li>There’s a lot of value in meeting and keeping in touch with all of the people, organizations, and issues connected to a cause. In our experience, and based on our conversations with other funders, it seems that many giving opportunities come via referral. The better the key players in a field know a program staffer, the more likely they are to refer people and projects who seem like a good match with the staffer’s priorities. Our impression is that many foundations’ staff spend a significant part of their time in meetings and at conferences.</li><li>Related to this, it seems highly valuable to have a clear, up-to-date “strategy.” If others in a field have a clear picture of what sorts of giving opportunities we are (and aren’t) looking for, they are more likely to pass along high-potential opportunities that come up. That’s why refining our strategy - and thinking about how to best communicate it - may often be a good use of time.</li><li>As mentioned in a <a href=\"https://www.openphilanthropy.org/blog/funder-initiated-startups\">previous post</a>, it may sometimes be appropriate for a program staffer to pitch ideas to potential grantees, or even to recruit people to create a new organization, rather than simply considering ideas brought in by others.</li><li>Other proactive activities a program staffer can undertake to find giving opportunities include organizing a convening to generate ideas or issuing an open call for grant proposals. We have participated in both at various times, and we see value in these tools. But because they often require major investments of time, we only plan to use them when we have a very clear sense of the goals and deliverables, and significant staff capacity available to work on them.</li></ul><h1>What sort of person makes a good program staffer?</h1><p>At this time, we know very little about what makes a good program staffer.</p><p>One aspect of the subject was covered in a <a href=\"https://pj.news.chass.ncsu.edu/2008/06/20/talent-philanthropy-generalist-or-specialist/\">speech by Gara LaMarche</a> on the relative merits of hiring “someone with deep content knowledge in a particular field” versus “someone versatile enough to handle a number of issues [and] move over time from one field to another.” There is some obvious overlap between this topic and that of <a href=\"https://www.openphilanthropy.org/blog/expert-philanthropy-vs-broad-philanthropy\">expert vs. broad philanthropy</a>, but they are distinct questions. For instance, we could choose to have a deep focus on a small number of areas, while hiring generalists who will aim to get up to speed and will switch areas when necessary.</p><p>So far, as we’ve selected our <a href=\"http://www.openphilanthropy.org/leadership-team/\">current program staff</a> and done some early <a href=\"https://www.openphilanthropy.org/get-involved/jobs\">searching for cause-specific staff</a>, we’ve prioritized the following qualities:</p><ul><li><strong>Clear sense of strategy and alignment with managers.</strong> It seems important to us that managers and program staffers see eye-to-eye on what they’re trying to accomplish in a cause and why; on the basics of what sorts of giving opportunities they’re looking for; and, therefore, on how they expect to evaluate giving opportunities. This seems necessary in order for program staff to engage in self-directed exploration and evaluation, while having a high likelihood of making decisions that their manager is comfortable with.</li><li><strong>Ability to investigate grant opportunities, raise critical questions, and justify one’s choices in ways that are convincing to managers.</strong> In our case, we tend to place a lot of value on being able to understand why someone thinks what they think. We have a fairly well-defined style for public writeups that involves a significant amount of citation and explanation for our claims; our current program staff are comfortable writing in this style, and we hope that future program staff will be as well (even if they aren’t always responsible for personally completing writeups).</li><li><strong>Strong sense of one’s own strengths and weaknesses.</strong> As discussed above, we believe that a funder often must make judgment calls about when they should seek to help a grantee address potential weaknesses versus deferring to the grantee. We think there is room for debate on how much expertise program staffers ought to have, but it is important that they recognize when a question falls outside of it.</li><li><strong>Strong interpersonal and communication skills.</strong> We believe that program staff should be well-networked and well-respected in their fields; should give grantees clear guidance about their prospects for receiving funding; must be capable of being persuasive; should be able to pick up information - often “between the lines” of explicit communication - about how different players in the field relate to each other; and should be sensitive to the line between (a) sharing opinions and making suggestions, versus (b) nudging grantees to take actions that may be suboptimal in order to receive funding. For these reasons and more, we think it’s important for program staffers to have strong interpersonal and communication skills. The vast majority of program staffers from other foundations with whom we’ve interacted exhibit this quality.</li></ul><p>To be sure, the qualities listed above are very general. More detail on the specific qualities we look for in particular roles is available via our <a href=\"https://www.openphilanthropy.org/get-involved/jobs\">job listings for cause-specific staff</a>.</p>", "user": {"username": "HoldenKarnofsky"}}, {"_id": "fcTrN2uQKDeTx78zP", "title": "Key Questions about Philanthropy, Part 1: What Is the Role of a Funder?", "postedAt": "2015-06-23T13:30:00.225Z", "htmlBody": "<p><i>Note: Before the launch of the Open Philanthropy Project Blog, this post appeared on the </i><a href=\"http://blog.givewell.org/\"><i>GiveWell Blog</i></a><i>. Uses of “we” and “our” in the below post may refer to the Open Philanthropy Project or to GiveWell as an organization. Additional comments may be available at the </i><a href=\"http://blog.givewell.org/2015/06/23/fundamental-under-discussed-questions-about-philanthropy-part-1-the-role-of-the-funder/\"><i>original post</i></a><i>.</i> <i>This post was updated on July 6 with language edits but substantially unchanged content.</i></p><p>As a new funder, we’ve found it surprisingly difficult to “learn the ropes” of philanthropy. We’ve found relatively little reading material - public or private - on some of the key questions we’re grappling with in starting a grantmaking organization, such as “What sorts of people should staff a foundation?” and “What makes a good grant?” To be sure, there is some written advice on philanthropy, but it leaves many of these foundational questions unaddressed. As we’ve worked on the <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy Project</a>, we’ve accumulated a list of questions and opinions piecemeal. This blog post is the first in a series that aims to share what we’ve gathered so far. We’ll outline some of the most important questions we’ve grappled with, and we’ll give our working answer for each one, partly to help clarify what the question means, and partly to record our thoughts, which we hope will make it easier to get feedback and track our evolution over time. We’d love to see others - particularly experienced philanthropists - write more about how they’ve thought through these questions, and other key questions we’ve neglected to raise. We hope that some day new philanthropists will be able to easily get a sense for the range of opinions among experienced funders, so that they can make informed decisions about what kind of philanthropist they want to be, rather than starting largely from scratch. This post focuses on the question: “what is the role of a funder, relative to other organizations?” In brief:</p><ul><li>At first glance, it seems like a funder’s main comparative advantage is providing funding, and one might guess that a funder would do well to stick to this role as closely as possible. In other words, a funder might seek to play a <a href=\"https://www.openphilanthropy.org/blog/challenges-passive-funding\">“passive”</a> role, by considering others’ ideas and choosing which ones to fund, without trying to actively influence what partner organizations work on or how they work on it.</li><li>In practice, this doesn’t seem to be how the vast majority of major funders operate. It’s common for funders to develop their own strategies, provide funding restricted for specific purposes, develop ideas for new organizations and pitch them to potential founders, and more. Below, we lay out a spectrum from “highly passive” funders (focused on supporting others’ ideas) to “highly active” funders (focused on executing their own strategies, with strong oversight of grantees). <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-1-what-role-funder#Sec1\">More</a></li><li>In the final section of this post, we lay out our rough take on when we think it’s appropriate for us, as a funder, to do more than write a check. In addition to some roles that may be familiar from for-profit investing - such as providing connections, helping with fundraising and providing basic oversight - we believe it is also worth noting the role of funders play via <a href=\"https://www.openphilanthropy.org/blog/refining-goals-givewell-labs\">cause selection</a>, and the role a funder can play in <a href=\"https://www.openphilanthropy.org/blog/funder-initiated-startups\">filling gaps in a field by creating organizations</a>. <a href=\"https://www.openphilanthropy.org/blog/key-questions-about-philanthropy-part-1-what-role-funder#Sec2\">More</a></li></ul><h1>The spectrum from passive to active funding</h1><p>There is a good deal of variation in how “active” different funders seek to be. If I were to articulate two ends of the spectrum, I’d say that:</p><ul><li>One end is roughly represented by groups like <a href=\"https://www.ashoka.org/en-us\">Ashoka</a> and <a href=\"http://www.skollfoundation.org/approach/\">the Skoll Foundation</a>, both of which consider proposals from “social entrepreneurs” in a wide variety of areas and fund the ones they find strongest. Neither is a purely passive funder, but both appear focused on identifying and supporting others’ ideas.</li><li>The other end might be represented by groups that started as foundations but eventually made transitions, becoming public charities or operating nonprofits and choosing to focus on running their own programs rather than making grants. The <a href=\"http://www.kff.org/\">Kaiser Family Foundation</a> appears to be an example, as does the <a href=\"http://www.pewtrusts.org/\">Pew Charitable Trusts</a>.</li></ul><p>Most major funders seem to be somewhere in between. They provide a mix of unrestricted and restricted funding. They develop their own in-house expertise, create their own strategies, pitch ideas to potential grantees, assemble convenings, and often get involved in grantees’ work at a level beyond simply cutting a check. At the same time, their relationship to most grantees is that of a supporter who checks in periodically rather than a partner who is involved day-to-day.</p><h1>Our provisional take on the funder’s role</h1><p>As we’ve <a href=\"https://www.openphilanthropy.org/blog/challenges-passive-funding\">written before</a>, we initially envisioned taking a highly passive approach, but we have learned that there is a strong case for being active in certain ways. For us, the key question is what we, as the funder, are positioned to do better than others. We believe it makes sense to be active where we can offer something (besides money) that our grantees don’t have. But we want to avoid micro-managing grantees, who have more knowledge of their issues and their capabilities than we do. What a given funder has to offer will depend on what sorts of expertise and staff that funder has built up. But to generalize, it currently seems to us that:</p><ul><li>Funders have much of their impact via <i>cause selection</i>: choosing what problems and issues - for example, criminal justice reform vs. global health vs. biomedical innovation - to prioritize. This is a personal-values-laden decision, and not one that grantees are well positioned to help with, as they tend to have a focus on a particular problem or issue baked into their mission. Accordingly, it is often appropriate for a funder to support a grantee only on condition that they prioritize a given cause/problem/issue/goal. When a funder is interested in an issue that gets relatively little attention, it may be necessary for the funder to proactively build the field by holding convenings, speaking publicly about the issue’s importance, etc. I believe there is a significant difference with for-profit investing here: in the for-profit world, there generally is high alignment on the ultimate goal (making money) between prospective investors and investees, whereas in the nonprofit world, alignment on ultimate goals is the exception rather than the rule.</li><li>A funder may be well-positioned to identify a <i>gap</i> in a field - a type of organization, collaboration or project that ought to exist and doesn’t. This is by virtue of having a broad view of, and relationships with, all of the organizations working on a particular cause, and having the funds to support the creation of a new one. Funders are not the only actors who can create new organizations; they can also be created by entrepreneurial individuals pitching their own plans. However, we’ve observed that funders often are key players in the creation of new nonprofit organizations (see our <a href=\"https://www.openphilanthropy.org/blog/funder-initiated-startups\">previous post on the subject</a>). In order to be well positioned to identify gaps, we’ve tried to learn about what sorts of organizations can exist, particularly by looking at successful, well-funded causes. With this “inventory” in hand, we’re better able to look at a given field and see what’s “missing.” An example of such an “inventory” is <a href=\"https://www.openphilanthropy.org/blog/role-philanthropic-funding-politics\">our list of the different avenues by which nonprofits can influence policy</a>.</li><li>There may be times when a grantee has a basic, structural deficiency that a funder is able to spot and help to address. One example is <a href=\"https://www.openphilanthropy.org/blog/thoughts-sandler-foundation\">the Sandler Foundation’s support for improving the communications capacity of the Center on Budget and Policy Priorities</a>. Here again, it seems helpful to have a good sense for the basic “inventory” of different ways to accomplish philanthropic goals, as well as a strong network so that one can connect organizations with partners who are strong where they are weak. However, as a funder, we believe we should be careful to distinguish between (a) areas where the grantee has a weakness that we can help to address and (b) cases where the grantee and we simply disagree, and the grantee is well positioned to have an informed view, to which we ought to defer. We suspect that many organizations are eager enough for funding that they may act against their own best interests when pushed to do so by an opinionated funder. We also believe that if we try to help to address a weakness, we should focus on connecting the organization to qualified advisers, rather than on getting directly involved in the organization’s tactics and practices.</li><li>Relatedly, funders often have networks that can be useful for a grantee to tap into, especially for the purpose of fundraising. A common role of a funder, as in for-profit investing, is to provide fundraising leads and other connections.</li><li>Nonprofits often plan for their level of funding to stay roughly the same or grow modestly. When offered the chance to grow their budget substantially, some nonprofits have little idea at first of what they would do. But when continually encouraged to think about this question, they may come up with new ideas. We’ve seen examples of this as a funder, though they aren’t currently public. GiveWell also has experienced this dynamic as a grantee. We did not have the idea for the <a href=\"https://www.openphilanthropy.org/blog/announcing-givewell-labs\">Open Philanthropy Project (previously GiveWell Labs)</a> until Good Ventures expressed a high degree of interest in our work. Having a major funder encourage us to think about how we would allocate large amounts of money caused us to think more deeply about the matter than we would have otherwise. Now, as a funder, when we find strong people or organizations who aren’t actively seeking more funding, we often try to develop relationships with them and continually raise the possibility of providing funding, rather than simply expressing a basic level of interest and dropping out of touch.</li></ul><p>Outside of the above situations, we ideally seek to have only high-level involvement in our grantees’ work - more analogous to that of a board member than that of a manager or consultant. We aim to check in periodically, assess high-level progress, ask critical questions, and drill down when we don’t understand a grantee’s answers. We aim ultimately to defer to the grantee on most details. We don’t think this is necessarily how every funder should behave - funders with certain kinds of expertise or staff may seek more involvement, or even to operate their own programs - but it is what we are aiming for.</p>", "user": {"username": "HoldenKarnofsky"}}, {"_id": "rfrJ8kSvSHiv6ejHf", "title": "Responses to \"The Logic of Effective Altruism\"", "postedAt": "2015-07-01T07:00:00.000Z", "htmlBody": "<p><i>A series of responses to </i><a href=\"https://bostonreview.net/forum/peter-singer-logic-effective-altruism\"><i>this article from Peter Singer</i></a><i>.</i></p><h2>Daron Acemoglu</h2><p>What’s not to like about charitable giving based on quantitative evidence and aimed at maximum impact? Actually, I have a few misgivings.</p><p>First, on&nbsp;<i>individuals and institutions</i>: although greater altruistic feeling and behavior should be an unmitigated good, assigning to individuals and groups the roles typically reserved for societal institutions poses some dangers. We expect local and national law enforcement to fight crime, for instance. We may at first welcome vigilantes but soon discover their actions are fueled by bias, group psychology, and unchecked power. Even worse, they may start eroding society’s trust in public institutions. Why should we pay for police when others protect us?</p><p>In the case of philanthropy, the problem isn’t street justice but replacing the government’s role in, say, providing health care. “So what?” one might ask, given the track record of some states. But consider the long-term consequences. When key services we expect from states are taken over by other entities, building trust in the state and developing state capacity in other crucial areas may become harder. Correspondingly, convincing people to engage in politics and oversight of the state also becomes more difficult. In much of the developing world, from Pakistan to Nigeria or Haiti, where state-society relations are already frayed, they may become harder to mend.</p><p>Second, on&nbsp;<i>effective measurement</i>: we cannot measure accurately which organizations use resources most effectively. More evidence is always preferred, but precise measurement of the social value of a donated dollar may be impossible. What is the social value of a dollar given to Amnesty International as opposed to Oxfam or an NGO providing vaccines or textbooks? Every measurement involves value judgments. How much more valuable is to save the life of a one-year-old than to send a six-year-old to school?</p><p>But the problem is thornier still. A large body of research shows that economic development is the best way to lift millions out of poverty and improve their health, education, and access to public amenities. So one has to take into account how charities’ activities affect economic development, which is essentially impossible. If, as some economists and political scientists suggest, changes in political and economic institutions are critical for long-run economic growth, then watchdog organizations such as Amnesty may be essential for transforming dysfunctional regimes. Effective altruists don’t (yet?) see the importance of these more political organizations. If this narrow focus continues, it may divert public and media priorities from political factors underpinning economic development.</p><p>Finally, on&nbsp;<i>what we value as a society</i>: effective altruists’ imperative to maximize their earnings so they can give more might influence what society views as a meaningful life. Many of us would consider the life of a young person who foregoes the comforts of a well-paying job to work as a community activist or a doctor in a war zone not just meaningful but also highly valuable for society. But effective altruism may slowly chip away at this conception.</p><p>Perhaps Bill Gates, who has made billions and is now giving large sums to worthy causes, should be emulated. Or perhaps we should become Wall Street traders to maximize our earnings and donations. Peter Singer says there is no justification for breaking the law or engaging in blatantly unethical behavior to do so, but life’s choices seldom come in black and white. Imagine that the Department of Justice and the European Commission had not prevented Microsoft from forming a more effective software monopoly; Gates’s wealth could then be twice what it is today, and he could give twice as much. Would his have been a more meaningful and socially valuable life, even if his additional earnings came at the expense of monopoly distortions of the software market? Or suppose our Wall Street trader—now engaged in the sort of high-frequency, algorithmic arbitrage many economists view as socially useless at best—had become an innovator, earning less and giving less but creating tools that millions find valuable. Would hers be a less meaningful life? What about civic duty—being an informed citizen, an active political participant ready to speak out against injustice, and a member of society willing to help others directly? Is that not part of a meaningful life?</p><p>None of these objections will have much force if effective altruists remain a small, marginal tribe. But we may yet see the best and brightest in our colleges and high-prestige professions join them. If that happens, the unforeseen consequences of this powerful but flawed idea could be stark.</p><h2>Angus Deaton</h2><p>Helping others is good, not least because of the happiness it brings to the giver. And it is hard not to admire Matt Wage, or Peter Singer. But why do the world’s poor have such a passive role in all of this happiness creation? Why are they not asked if they wish to participate, if they too feel the warm glow? Singer does nothing to persuade us that they have volunteered to be the objects of the “effective” altruism he endorses; indeed, Gallup and Afrobarometer polls show that Africans’ own priorities lie elsewhere. Instead, the evidence for effectiveness, on which the recipients might have their own views, is outsourced to technical outfits, such as GiveWell, that evaluate projects and organizations. GiveWell is&nbsp;<i>Consumer Reports</i>&nbsp;for altruists, listing value for money and establishing the minimum cost of saving a child’s life.</p><p>It is an illusion that lives can be bought like cars. For a start, the evidence is nearly always in dispute. The alleged effectiveness of the Deworm the World Initiative—which, at the time of this writing, ranked fourth in GiveWell’s list of top charities—runs contrary to the latest extensive review of the evidence by the Cochrane Collaboration, an organization that compiles medical research data. Maybe Cochrane is wrong, but it is more likely that the effectiveness of deworming varies from place to place depending, among many other things, on climate and on local arrangements for disposing of human waste.</p><p>More broadly, the evidence for development effectiveness, for “what works,” mostly comes from the recent wave of randomized experiments, usually done by rich people from the rich world on poor people in the poor world, from which the price lists for children’s lives are constructed. How can those experiments be wrong? Because they consider only the immediate effects of the interventions, not the contexts in which they are set. Nor, most importantly, can they say anything about the wide-ranging unintended consequences.</p><p>However counterintuitive it may seem, children are not dying for the lack of a few thousand dollars to keep them alive. If it were so simple, the world would already be a much better place. Development is neither a financial nor a technical problem but a political problem, and the aid industry often makes the politics worse. The dedicated people who risked their lives to help in the recent Ebola epidemic discovered what had been long known: lack of money is not killing people. The true villains are the chronically disorganized and underfunded health care systems about which governments care little, along with well-founded distrust of those governments and foreigners, even when their advice is correct.</p><p>In today’s Rwanda, President Paul Kagame has discovered how to use Singer’s utilitarian calculus against his own people. By providing health care for Rwandan mothers and children, he has become one of the darlings of the industry and a favorite recipient of aid. Essentially, he is “farming” Rwandan children, allowing more of them to live in exchange for support for his undemocratic and oppressive rule. Large aid flows to Africa sometimes help the intended beneficiaries, but they also help create dictators and provide them with the means to insulate themselves from the needs and wishes of their people.</p><p>The industry does not ignore the evidence; indeed the World Bank, the U.S. Agency for International Development, and its European counterparts use the same evidence GiveWell does, and they help to create more. They are also infinitely better organized and funded than the NGOs, so if it were possible to use this sort of evidence to eliminate global poverty, they would be better placed to do so than a handful of wealthy individuals working through NGOs. Yet these official aid agencies cannot solve the political conundrum and must bear some of the burden of responsibility for the oppressive dictatorships that fester in Africa.</p><p>Like Singer, I am privileged to teach at Princeton. I too see students who want to relieve suffering in the world. Should they go to Dhaka or Dakar? Focus on bed nets or worms? I tell them to go to Washington or London and to work to stop the harm that rich countries do; to oppose the arms trade, the trade deals that benefit only the pharmaceutical companies, the protectionist tariffs that undermine the livelihoods of African farmers; and to support more funding to study tropical disease and health care. Or they could go to Africa, become citizens, and cast their lot with those they want to help. That is how they can save the lives of African kids.</p><h2>Jennifer Rubenstein</h2><p>The debate sparked by the “effective altruism” movement has the potential to significantly improve donating practices, but only if what results is starkly different from the movement Peter Singer describes.</p><p>A central strength of the effective altruism movement is that it urges donors to make empirically informed decisions that focus on effects rather than good intentions, “warm glow” feelings, or the intrinsic value of actions. In this respect, it is far superior to charity appeals based on identifiable victims, charismatic megafauna (e.g., polar bears), charismatic mega-stars (e.g. Bono), oversimplified villains (e.g., Joseph Kony), and dramatic images of disaster.</p><p>For Singer and in everyday speech, being altruistic means doing as much good as possible, typically by helping people who aren’t kin or friends. Paradigmatic effective altruists, therefore, are relatively well-off individuals who donate large amounts of money to organizations that aid impoverished strangers. In contrast, a poor person who devotes all her time and resources to effectively alleviating her family’s or community’s poverty is not an altruist and so cannot be a member of the movement.</p><p>Singer is right that rich individuals face epistemic, motivational, and logistical challenges to fighting poverty that poor people do not face. The problem is that he addresses these challenges via a social movement focused on alleviating poverty that excludes poor people from its ranks. This movement therefore violates the democratic principle of inclusion, summarized in a slogan used for decades by social movements from Poland to South Africa: “Nothing About Us Without Us.”</p><p>This exclusion is compounded by the effective altruism movement’s primary strategy for attracting new members: showing how easy it is to save lives cheaply. Singer describes his student’s realization that by donating to a cost-effective charity, he can do as much good as a person who runs through flames to kick open the door of a burning building, saving one hundred lives. This analogy may be stirring, but it encourages donors to think of themselves as heroes or saviors. This orientation overlooks poor people’s central role in alleviating their own poverty and rich people’s role in contributing to and benefiting from it.</p><p>The effective altruism movement retains members by directing their emotional energies and commitments toward&nbsp;<i>each other</i>, not the people they aim to assist. Singer thus profiles effective altruists for his readers to emulate; he does not depict poor people using assistance to exit poverty. Likewise, organizations such as Giving What We Can encourage their members to make commitments to, and engage in community-building with, each other—not poor people. These strategies rightly avoid using pity as a motivational tool, but they also preclude more promising forms of connection, such as political solidarity.</p><p>By excluding poor people and encouraging a savior complex and insularity among its members, the effective altruism movement fails to meet normative criteria of democracy and equality. A supporter of this movement might respond that democracy and equality are less important than improving individual welfare. Yet in the medium-to-long term, the movement will likely fall short in this regard as well. As the low-hanging fruit of basic health programs and cash transfers are exhausted, saving lives and alleviating suffering will require more complicated political action, such as reforming global institutions. Undertaking this action will require outsiders to work with, and follow the lead of, activists in poor countries. Yet the effective altruism movement as Singer describes it does not cultivate the expectations, attitudes, or relationships necessary for this kind of work.</p><p>While Singer does not address these difficulties in his book, other adherents of the effective altruism movement are trying to do so. I hope their debates, with each other and external critics, result in a more pluralistic approach that includes poor people as partners or follows their lead, even if this means less certainty about doing the&nbsp;<i>most</i>&nbsp;good. This pluralist approach would have to jettison “social movement of altruists” as an organizing frame, but it would retain the effective altruism movement’s crucial twin insights: some donations do vastly more good than others, and donors should focus on those that do more good.</p><p>This pluralist alternative might also inspire new initiatives, such as a database of effective social movements. This database would direct donors’ attention outward, toward&nbsp;<i>existing</i>&nbsp;social movements, especially those based in the global South, that want external support for their efforts to promote individual welfare, inclusion, equality, or rights. Whatever its flaws, such a database could help donors resist the siren song of international aid: the belief that technically savvy, well-meaning outsiders can kick down doors and save the day.</p><h2>Iason Gabriel</h2><p>Effective altruism encourages people to do “the most good they can,” typically by contributing a portion of their income to the best-performing aid organizations. This is a plausible account of what morality requires in a world riven by extreme poverty, but before we heed the call to action, we need to know more about what it means to do good. We also need to know more about the kind of outcome effective altruists believe should be promoted.</p><p>In practice, effective altruists tend to answer these questions by drawing on their giving philosophy's utilitarian roots. The core message is that suffering and premature death should be avoided to the greatest extent possible. In this calculation, other values such as social justice tend to lose out. As Holden Karnofsky, cofounder of GiveWell, puts it, “Justice as an end in itself, liberty as an end in itself—those aren’t things we’re interested in.” Of course, effective altruists know there is good instrumental reason to promote equality, focus on the worst off, and respect human rights. Yet when the cards are on the table, their failure to value these things as ends in themselves induces forms of moral blindness.</p><p>For example, effective altruists do not care about who benefits from an intervention or in what way, only that the greatest total gain in well-being is achieved. This means they often overlook the weakest and most vulnerable members of a population, who are frequently illiterate, victims of discrimination, and consigned to geographically remote places. Many of them also suffer from disabilities that place out of reach the welfare gains able-bodied people can achieve. Therefore effective altruists tend to focus their efforts elsewhere. This approach leads to systematic neglect of those most in need, something that strikes many people as unjust.</p><h2>Peter Singer's response</h2><p>The most striking passage in these responses is Larissa MacFarquhar’s description of effective altruists being moved by the suffering of anonymous people, or by suffering in itself. This should dispel the myth that effective altruists are coldly calculating, lacking emotion.</p><p>At the same time, MacFarquhar worries that by encouraging people to donate not to the charity that researches a disease from which someone close to them has suffered but to the charity that will do the most good with their donation, effective altruism will “suppress emotional connection” and “crush their moral roots.” But effective altruists are concerned about consequences, so if this does happen, they will have to change tactics. Giving doesn’t have to be an all-or-nothing decision. Someone whose child has died of leukemia might be encouraged to make a modest donation to leukemia research and a larger donation to a charity that is more effective because it helps children in developing countries.</p><p>Paul Brest’s support for effective altruism is also tempered by worries about its emotional toll. Yet the portrayal of effective altruism he takes from MacFarquhar’s Stanford lecture—“a young couple who live in total self-denial according to Singer’s mandate”—is at odds with the way the couple (who now have a child) see their lives. I asked Julia Wise, one half of the couple, to comment, and she wrote: “We don’t feel deprived—though we give half our income, the remaining half is still a princely sum by world standards. There’s plenty of room in that budget for the things that matter most to us, including raising our daughter.”</p><p>Most respondents, however, worry that effective altruism overestimates its ability to identify the most effective interventions and achieve positive, long-term outcomes.</p><p>In his book&nbsp;<i>The Great Escape</i>&nbsp;(2013), Angus Deaton writes some positive things about aid, including: “I think the case for aid to fight disease such as HIV/AIDS or smallpox is strong.” Here, however, he claims that evidence about the amount of good done by specific aid programs is “nearly always” in dispute. The science of assessing the impact of such programs is relatively new, and more and better studies should help. Deaton criticizes GiveWell’s recommendation of treating intestinal parasites in children, claiming that it is contrary to “the latest extensive review of the evidence by the Cochrane Collaboration,” but he fails to mention that GiveWell&nbsp;<a href=\"http://blog.givewell.org/2012/07/13/new-cochrane-review-of-the-effectiveness-of-deworming/\"><strong><u>responded</u></strong></a>&nbsp;to the Cochrane Collaboration report and indicated why they believe it does not directly challenge their recommendations. Readers may judge for themselves who is right.</p><p>I am also puzzled by Deaton’s claim that in aid programs the poor are not asked to participate. As Saunders-Hastings notes, most of the charities recommended by effective altruists work in the health area, where they “do not pose significant tradeoffs between welfare promotion and respect for beneficiary choice.” Other programs, such as GiveDirectly’s cash grants to extremely poor families, are surely immune to accusations of denying beneficiary choice; no one is forced to accept the money or told how to spend it. The available data suggest that GiveDirectly’s grants are also effective in increasing welfare, thus rendering moot Saunders-Hastings’s difficult question about how we trade off beneficiary choice against welfare. Where that tradeoff cannot be avoided, I believe our answer should depend on the terms of each case.</p><p>Deaton, Daron Acemoglu, Iason Gabriel, and Jennifer Rubenstein all suggest that effective altruists are likely to neglect the large-scale political and economic reform that would treat the causes, rather than the symptoms, of poverty. It is true that we can’t assess such action by randomized trials, but if large-scale reform offers some prospect of reducing poverty, then effective altruists will try to assess its chance of doing good, and if the expected value of such action is higher than the expected value of more limited interventions, they will advocate working for the large-scale reforms.</p><p>The same point holds for Leila Janah’s suggestion that the most effective way of helping the poor is to support fair trade programs or start social businesses that are environmentally sustainable and pay a living wage. It holds as well for Rubenstein’s claim that once the “low-hanging fruit” has been picked, efforts to reduce poverty will succeed only if they work with and follow the lead of activists in poor countries. Effective altruism cannot be refuted by evidence that some other strategy will be more effective than the one effective altruists are using, because effective altruists will then adopt that strategy. In&nbsp;<i>The Most Good You Can Do</i>, I describe and recommend examples of advocacy work for the poor, some of it in conjunction with political activists in developing countries. It is not easy to assess the efficacy of such work. But as long as we can rank some interventions as having an expected value that is several times greater than other interventions that are currently being funded—and this is beyond dispute—effective altruists have an important role to play in helping people to do more good than they otherwise would.</p><p>In any case, if the objection to effective altruism is that it often takes a Band-Aid approach to poverty, treating its symptoms rather than its root causes, then we should not forget that sometimes we don’t know what the root causes of poverty are, and even should we come to know what some of them are, we may still be unable to change them. In those circumstances, treating the symptoms of poverty will be the best we can do—and we should not forget that this will mean saving lives, alleviating hunger or chronic malnutrition, eliminating parasites, providing education, helping women to control their fertility, and preserving sight. Not bad for Band-Aids.</p><p>Finally, several respondents raise suspicions about the politics of effective altruism.</p><p>András Miklós asks interesting questions about why effective altruism focuses only on the responsibilities of individuals. I agree that corporations have an important role to play in effective altruism.</p><p>Rob Reich asks whether effective altruists prefer technocracy to democracy, but it is no accident that Bentham and his utilitarian followers were leaders of the movement for democratic reform in Britain. Democracy helps to align the interests of the government with those of the governed. I don’t know how many effective altruists believe that democracy has intrinsic, rather than just instrumental, value; most likely some do and others do not. Iason Gabriel makes a similar point about justice, but again, there is no party line on these matters, and not all effective altruists will agree with Holden Karnofsky in allowing justice only instrumental value.</p><p>Catherine Tumber asserts that Matt Wage’s work “furthers the suffering of global have-nots.” Wage himself doesn’t think this is the case, so if Tumber knows better, she should tell us how she knows it. She also says that he is being “deskilled and degraded,” again without indicating why we should accept that view. Effective altruists require evidence for their views, which may be why Tumber finds them uncongenial. She makes it clear that she objects to effective altruists’ insistence on quantifying the amount of good done by the various options available to them. That implies that she would be willing to support a charity that, say, will prevent blindness in a small number of people even when the same resources donated to a different charity would prevent blindness in many more people. It is hard to know what to say about such a preference.</p>", "user": {"username": "EA Fellowship"}}, {"_id": "5XeCA5gKbMakAskLy", "title": "Effective altruists love systemic change", "postedAt": "2015-07-08T07:00:00.000Z", "htmlBody": "<p>Yesterday we <a href=\"https://80000hours.org/2015/07/80000-hours-thinks-that-only-a-small-proportion-of-people-should-earn-to-give-long-term/\">put to rest</a> the idea that 80,000 Hours, and effective altruists more generally, are only enthusiastic about ‘earning to give’. While some people should earn to give, we expect the right share is under 20%, and think that ‘earning to give’ is now more popular among the people who follow our advice than it ideally would be.</p><p>Today I want to put to rest another common misunderstanding about effective altruism and 80,000 Hours: that we are against working on systemic change.<a href=\"https://80000hours.org/2015/07/effective-altruists-love-systemic-change/#fn-1\"><sup>1</sup></a></p><p>Despite being the most <a href=\"http://leiterreports.typepad.com/blog/2015/06/effective-altruist-philosophers.html\">widespread</a> <a href=\"http://qz.com/110616/what-peter-buffett-doesnt-understand-about-the-world/\">critique</a> of <a href=\"https://bostonreview.net/forum/logic-effective-altruism/angus-deaton-response-effective-altruism\">effective</a> altruism, the idea is bizarre on its face. We are pragmatists at heart, and always looking for any ways to more effectively make the world a better place.</p><p>Why couldn’t pursuing broad-scale legal, cultural or political changes be the most effective approach to making the world a better place? The answer is simply that it could!</p><p>So there is nothing <i>in principle</i> about the idea of maximising the social impact of your work that rules out, or even discourages, seeking systemic change.</p><p>What about in practice, though? Here are some people who identify as effective altruists working on systemic change:</p><ul><li>Most recent <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy</a> research and grants, on immigration reform, criminal justice reform, macroeconomics, and international development, are clearly focussed on huge structural changes of various kinds.</li><li>The <a href=\"http://openborders.info/\">OpenBorders.info</a> website collates research on and promotes the option of dramatic increases in migration from poor to rich countries.</li><li>A new startup called EA Policy, recommended for financial support by my colleagues at <a href=\"http://www.eaventures.org/\">EA Ventures</a>, is testing the impact of making submissions to open policy forums held by the US Government during this summer.</li><li>Our colleagues at the <a href=\"http://www.globalprioritiesproject.org/\">Global Priorities Project</a> research what should be the most important reform priorities for governments, and how they can improve cost-benefit and decision-making processes.</li><li>One of <a href=\"http://www.givewell.org/\">GiveWell’s</a> main goals from the beginning, perhaps it’s primary goal, has been to change the cultural norms within the non-profit sector, and the standards by which they are judged by donors. They wanted to make it necessary for charities to be transparent with donors about their successes and failures, and run projects that actually helped recipients. They have already significantly changed the conversation around charitable giving.</li><li>Giving What We Can representatives have met with people in the UK government about options for improving aid effectiveness. One of its <a href=\"https://www.givingwhatwecan.org/get-involved/myths-about-aid\">first and most popular content page</a> debunks myths people cite when opposing development aid. One of the first things I wrote when employed by Giving What We Can was on the <a href=\"https://www.givingwhatwecan.org/blog/2013-04-04/was-tutankhamun-a-billion-times-more-important-than-you\">appropriate use of discounts rates</a> by governments delivering health services. Until recently one Giving What We Can member, who we know well, was working at the UK’s aid agency DfID.</li><li>Some 80,000 Hours alumni, most of whom unfortunately would rather remain anonymous, are going into politics, think-tanks, setting up a labour mobility organisations or businesses that facilitate remittance flows to the developing world.</li><li>Several organisations focussed on existential risk (FHI, CSER and FLI jump to mind) take a big interest in government policies, especially those around the regulation of new technologies, or institutions that can improve inter-state cooperation and prevent conflict.</li><li>80,000 Hours alumni and effective altruist <a href=\"http://www.animalcharityevaluators.org/recommendations/top-charities/\">charities</a> work on or donate to lobbying efforts to improve animal welfare regulation, such as Humane Society US-FARM. Other activists are working for dramatic society-wide changes in how society views the moral importance of non-human animals.</li></ul><p>It looks to me like it’s more accurate to say that effective altruists &lt;3 systemic change.</p><p>We’re not done though. I’m working on 80,000 Hours’ research. Here are some other systemic changes that I and some of my colleagues think would have real potential if they could be easily achieved:</p><ul><li>Significantly more spending on development aid, assuming it is being spent in ways that work, such as delivering primary health care.</li><li>Improved regulation to crack down on <a href=\"http://academicsstand.org/projects/institutional-reform-goals/the-goals/illicit-financial-flows-project/\">illicit financial flows</a> from the poor to rich world.</li><li>Changes to financial regulations to prevent banks from <a href=\"http://bankersnewclothes.com/\">deliberately externalising</a> the cost of systemic risks to governments by being ‘too big to fail’.</li><li>Putting a price on all greenhouse gas emissions emissions, ideally coordinated internationally to have a consistent price across the developed world.</li><li>More international funding for contagious disease control, and better coordination between countries to stop emerging diseases from spreading, likely through the WHO.</li></ul><p>This is a hot-take rather than an official research conclusion, but I wouldn’t be surprised if in the future we recommended pursuing changes of this kind as one of the best career paths for someone with the necessary opportunities and skills. Our career profiles on politics and policy careers are already positive; we just haven’t done enough research to confidently recommend them over all the alternatives. The Centre for Effective Altruism, of which 80,000 Hours is a part, has published blog posts or reports on three of these issues and also raised them <a href=\"https://80000hours.org/2014/04/80-000-hours-visits-number-10/\">in meetings</a> with members of the UK government.</p><p>Discussions with my colleagues and other effective altruists, both in person and online, constantly turn to the question of what institutions, social norms or government policies might be most valuable to work for. I’ve had half a dozen discussions this year with fellow effective altruists about the merits of a ‘guaranteed minimum income’. These conversations are not just intellectual play: one of the people was considering dedicating the next few years to working on a start-up in that cause area.</p><p>Now, you may disagree with the proposals I or others are working on above. Any of them might actually be lousy ideas. Some are very challenging to sell to politicians or the electorate. Maybe none of them allow us to do the most good with our careers.</p><p>But the overall picture is completely inconsistent with 80,000 Hours or our effective altruist collaborators being hostile to working for systemic change.</p><p>What might people be getting at when they say we are skeptical of systemic change? I have some ideas about how this false perception may have formed:</p><ul><li>As discussed elsewhere, ‘earning to give’ was one of our most media friendly and viral ideas, and has dominated coverage of 80,000 Hours and effective altruism among the general public, to our growing consternation. Earning to give is usually perceived as anti-systemic change.<br>In fact, someone who ‘earned to give’ in order to pay the salary of someone else working for systemic change is working for systemic change themselves. In that sense ‘earning to give’ is simply neutral on the systemic vs non-systemic change issue. Communist revolutionary Friedrich Engels is a <a href=\"https://en.wikipedia.org/wiki/Friedrich_Engels#Back_in_Britain\">classic example of this approach</a>, though my guess is he personally did more harm than good.<br>I would also argue though that creating a social expectation that to be decent people, the rich should give away a large fraction of their wealth to others, is itself a form of systemic change.</li><li>Effective altruists are usually not radicals or revolutionaries, as is apparent from my list above. My attitude, looking at history, is that sudden dramatic changes in society usually lead to worse outcomes than gradual evolutionary improvements. I am keen to tinker with government or economic systems to make them work better, but would only rarely want to throw them out and rebuild from scratch. I personally favour maintaining and improving mostly market-driven economies, though some of my friends and colleagues hope we can one day do much better. Regardless, this temperament for ‘crossing the river by feeling the stones’ is widespread among effective altruists, and in my view that’s a great thing that can help us avoid the mistakes of extremists through history. The system could be a lot better, but one only need look at history to see that it could also be much worse.<br>However, even this remains only an empirically founded belief – if I find evidence that revolutionary change has been better than I thought, I will reconsider working for revolutionary changes.</li><li>Effective altruists prefer to pursue systemic changes that are more likely to be achieved, all else equal. Sometimes we view existing attempts at systemic change as more symbolic or idealistic than realistic, and so push back against them. For example I wrote a post years ago about why it’s <a href=\"https://80000hours.org/2013/04/is-us-gun-control-an-important-issue/\">not a good use of time to work on US gun control</a>. Of course this is nothing to do with systemic change specifically: we frequently also push back against non-systemic approaches that we don’t expect to help others very much. And I try to apply my pragmatism to the systemic changes that in my heart I would love to love: enthusiastic as I am about opening borders, it may be an impossible ask in the current political climate.</li><li>We have been taking on the enormous problem of ‘how to help others do the most good’ and had to start somewhere. The natural place for us, GiveWell and other research groups to ‘cut our teeth’ was by looking at the cause areas and approaches where the empirical evidence was strongest, such as the health improvement from anti-malarial bednets, or determining in which careers people could best ‘earn to give’.<br>Having learned from that research experience we are in a better position to evaluate approaches to systemic change, which are usually less transparent or experimental, and compare them to non-systemic options. This is very clear from the case of the <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy</a>, which is branching out from GiveWell and is more open to high-risk and ‘unproven’ approaches like political advocacy than GiveWell itself.</li></ul><p>So, in case you missed the message above:</p><p><i>Are effective altruists, or effective altruism, in favour of pursuing systemic change?</i></p><p><strong>Yes, yes, yes</strong>.<strong> A thousand times, yes!</strong></p><p>We don’t want to burn the existing system to the ground, but almost all of us want to make enduring improvements to national and international systems to ensure the future is better than the past. The only question, which we and others are investigating right now, is how best to do that.</p>", "user": {"username": "Robert_Wiblin"}}, {"_id": "wNjiafaWqaxuzEaWy", "title": "Shifting guilt", "postedAt": "2015-07-05T05:00:00.000Z", "htmlBody": "<p>The posts so far have been less about confronting guilt, and more about different tools for shifting it. This is a valuable skill to generalize.</p><p>The posts in this series have developed three such tools for shifting guilt. In this post, I'll recast those three tools as members of the same family, so that you can start to see the pattern, and develop similar tools from the same family as you need them.</p><p>The tools that I have described so far shift guilt to one particular place: guilt about being unable to act as you desire. This is intentional — that is the one place that I know how to confront guilt head-on.</p><p>The first tool for shifting guilt is the tool of <i>refinement</i>. This tool is used on listless guilts in need of pointing.</p><p>Imagine finding yourself feeling vaguely guilty the morning after a party, having slept in longer than you intended, your head aching from a slight hangover. Imagine a vague guilt making your body feel heavier. Perhaps it whispers that the night was senseless. Perhaps it murmurs that you're wasting your life away. This is the sort of guilt that's amenable to refinement: ask the guilt what, precisely, it would have had you do instead of what you did. (It is important, when refining, to also possess the virtue of concreteness: do not settle for \"I should have been studying.\" Demand a specific action: Which book? Which chapter?)</p><p>Sometimes, when asking the guilt what you could have done instead, you will remember that none of the alternatives were compelling. Maybe the party was for an old friend who you only see once every few years, and fulfilling the social obligation was better than the alternative. Maybe you were exhausted from a day of studying, low on human contact, and needed the party to reinvigorate you. When using the tool of refinement, the guilt sometimes simply disappears.</p><p>But often, the guilt gets more pointed. Perhaps you conclude you should have been working overtime so you could donate the money to a worthy cause. Perhaps you conclude that you had the opportunity and the stamina, but simply not the willpower. This is good! This is a success! The refinement has succeeded, and the guilt has come into more focus.</p><p>But more often than not, when you succeed at refining guilt, you find yourself left with an obligation (\"I should have drank less\" or \"I should have studied\" or \"I should have worked overtime.\") This has not yet shifted enough to be confronted. For obligations, you need the second tool.</p><p>The second tool for shifting guilt is the tool of <i>internalization</i>. This tool is used on guilts that stem from neglected obligations.</p><p>I strongly recommend that you <a href=\"http://mindingourway.com/not-because-you-should/\">staunchly refuse to bow to any guilt forced on you from the outside</a>. You say you \"should have\" studied more, instead of going to the party? Says who? Cash out the should. Again, it is critically important have virtue of concreteness when cashing out a should: do not say \"it would have been better for me to study more;\" for this has not removed the should, it has simply hidden it inside the word \"better.\" The way to cash out a should (and, thus, the way to use the tool of internalization) is to ask yourself whether or not it would be OK to drop the obligation entirely.</p><p>What would happen if you decide to never study that textbook again? Is it a relief? If so, then drop the obligation, and relinquish the guilt. You probably just accidentally <a href=\"http://mindingourway.com/half-assing-it-with-everything-youve-got/\">confused someone's quality line with your preference curve</a>. Sometimes, when attempting internalization, the guilt simply disappears. (Other times, part of the guilt disappears, and your find yourself again facing a vague, unfocused guilt. This is fine, and indeed quite normal — just apply the tool of refinement again, and repeat.)</p><p>But more often than not, when you threaten to drop an obligation entirely, some part of you protests. Imagine you're feeling terrible for failing to work overtime and donate money. If you ask yourself \"what if I just never donate money to those worse off ever again?,\" then most likely, some part of you will protest \"but that would be bad!\"</p><p>This is good. It means you have your <i>own</i> reasons for wanting to donate, which means you can drop the external obligation and do it because <i>you</i> want to.</p><p>Why would it be bad to stop donating? Don't settle for answers like \"because then I would be a bad person\" — that's replacing one obligation with another. If you get an answer like that, ask yourself, \"why would it be bad for me to be a bad person?\" Remember that concreteness is a virtue. Don't settle for an externalized answer (such as \"because then people wouldn't like me\"); push on until you get an internalized answer (\"because I prefer worlds where ______\").</p><p>Keep in mind that there may be many different parts to the answer: if you use the tool of internalization and get an answer that feels uncompelling, such as \"because I prefer worlds where my friends think that I am generous,\" then ask yourself something like \"OK, let's say that my friends were guaranteed to think that I am generous regardless of how much I donate to people worse off than me, <i>then</i> is it OK for me to never donate to people worse off than me ever again?\" — You can keep doing this until you uncover all the reasons behind your desires.</p><p>This is how the tool of internalization shifts guilt: it forces the guilt to either resolve itself, or reveal itself to you in terms of your own desires. It shifts the guilt to a place where the thing the guilt demands are things you want for yourself, rather than things you want because you think you should.</p><p>So perhaps now you feel guilty for not working overtime to earn money to give to those less well-off than yourself (which is something you desire due to a deep dissatisfaction with the unfairnesses of the modern world). This, again, is progress: the guilt is now focused and internalized. This is exactly the sort of guilt that the third tool addresses.</p><p>The third tool for shifting guilt is the filter of <i>realism.</i> Look at your guilt, and ask it whether its demands are realistic.</p><p>Ask whether you really could have worked harder and done something else, while remembering that you are in fact mortal. You are no more able to work 20 hour days at peak capacity than you are able to cure Alzheimer's disease with a snap of your fingers. <a href=\"http://mindingourway.com/stop-before-you-drop/\">Look not to whether you were moving as fast as you physically could</a>. Instead, <a href=\"http://mindingourway.com/rest-in-motion/\">look to the streams you need to move through in order to achieve your goals</a> while remembering that two of the most important streams are maintaining health and motivation.</p><p>Do not ask, \"could I have skipped the party and worked more?\" Ask, instead, \"am I traversing the work streams at the fastest sustainable pace?\" Check whether the task the guilt demands is realistic. Remember that working yourself ragged is not a virtue. When keeping the filter of realism in mind, many guilt simply fail to materialize in the first place.</p><p>But some guilts do pass the filter of realism, and leave you lamenting a flaw in your process, an inability to do what you think is best. Perhaps you will notice that you attend parties far more often than you prefer, due to peer pressure. Perhaps you will notice that you actually find parties draining, and that you were only attending this one in hopes of finding a date, which you could have done in a less costly manner if you were really trying. Perhaps you will realize that you've been adrift, that you've lost focus, and you'll feel guilty for failing to maintain your drive.</p><p>And this is right where we want the guilt. If you must feel guilty, I recommend feeling guilty not about what you did or didn't do, but about the <i>pattern of behavior</i> that corresponds to acting against your will. Don't feel guilty for going to <i>this</i> party, feel guilty for the general pattern of giving into peer pressure, or misjudging how much fun you'll have, or overindulging. Because <i>this</i> is the sort of guilt that I know how to address head-on.</p><p>The three tools of refinement, internalization, and realism, are, in my case, effectively universal: I can use them to shift any hint of guilt up to specific, internalized guilt about a realistic concern at the process level. I am sure, though, that for many of you, there will be other forms of guilt that these three tools do not cover.</p><p>This is why I make the tools explicit here: so that you can see how they work and see what they share, and then construct your own variants that work on whatever other guilts you tend to encounter.</p><p>As you hone those tools, I recommend you seek a similar endpoint: shift the guilt away from the misstep and onto the systemic flaw in your footwork. Shift guilt from the instance to the pattern. Bring your guilt to this battleground, and I will show you how to defeat it.</p>", "user": {"username": "So8res"}}, {"_id": "RMhH4uCgka9gtDPn7", "title": "Rest in motion", "postedAt": "2015-06-28T05:00:00.000Z", "htmlBody": "<p>Many people seem to think the 'good' state of being, the 'ground' state, is a relaxed state, a state with lots of rest and very little action. Because they think the ground state is the relaxed state, they act like maintaining any other state requires effort, requires suffering.</p><p>This is a failure mode that I used to fall into pretty regularly. I would model my work as a finite stream of tasks that needed doing. I'd think \"once I've done the laundry and bought new shoes and finished the grocery shopping and fixed the bugs in my code and finished the big refactor, everything will be in order, and I'll be able to rest.\" And in that state of mind, every new email that hit my inbox, every new bug discovered in my code, every tool of mine that wore down and needed repair, would deal me damage.</p><p>I was modeling my work as finite, with the rest state being the state where all tasks were completed, and so every new task would push me further from that precious rest state and wear me down.</p><p>But the work that needs to be done is not a finite list of tasks, it is a neverending stream. Clothes are always getting worn down, food is always getting eaten, code is always in motion. The goal is not to finish all the work before you; for that is impossible. The goal is simply to move <i>through</i> the work. Instead of struggling to reach the end of the stream, simply focus on moving along it.</p><hr><p>Advertisements and media often push the narrative that the purpose of all our toil is to win a chance at relaxation. We're supposed to work hard at boring jobs in order to earn our vacations. We're supposed to work hard for decades so that we can retire. (We're supposed to conceive of heaven as a place where nobody does anything except lounge on clouds.)</p><p>I call bullshit. For almost everybody, inaction is <i>boring.</i> That's why we pick up books, go exploring, and take up hobbies. The ground state is an active state, not a passive one.</p><p>The <i>actual</i> reward state is not one where you're lazing around doing nothing. It's one where you're keeping busy, where you're doing things that stimulate you, and where you're resting only a fraction of the time. The preferred ground state is not one where you have no activity to partake in, it's one where you're managing the streams of activity precisely, and moving through them at the right pace: not too fast, but also not too slow. For that would be boring.</p><p>And yet, most people have this model of the world where whenever they're not resting, they're taking damage. When the homework isn't done, they're taking damage. When they're reading a textbook, they're taking damage. When they go to sleep with work unfinished, they're taking damage. When they're at a large social event, they're taking damage. Some part of them yearns to be in the rest state, where they don't need to do all these <i>things</i>, and insofar as they aren't, they're suffering a little.</p><p>This is a grave error, in a world where the work is never finished, where the tasks are neverending.</p><p><i>Rest is not a reward for getting through all your obligations.</i> <a href=\"http://mindingourway.com/not-because-you-should/\">You already dropped your obligations, remember?</a> Rather, rest (and personal health, and personal time) are part of the goal. Both because most people care about their personal comfort, and because taking care of yourself is very important in order to do all the other things you want to do.</p><p>Rest isn't something you do when everything else is finished. Everything else doesn't <i>get</i> finished. Rather, there are lots of activities that you do, some which are more fun than others, and rest is an important one to do in appropriate proportions. Disconnect your impulse to rest from whether or not the world is in a stable state, because, spoiler alert, <a href=\"http://mindingourway.com/the-value-of-a-life/\">the world isn't going to be in a stable state for a long time</a>.</p><p>Rest isn't a reward for good behavior! It's not something you get to do when all the work is finished! That's finite task thinking. Rather, rest and health are just two of the unending streams that you move through.</p><hr><p>Imagine the person who is tight on money and needs to buy groceries once a month. Imagine that they agonize over every purchase, even though they know that they're buying as little as they can in order to secure the health of their family. You might suggest to them that they stop fretting over individual purchases and come to terms once and for all with the fact that food is a necessary purchase, and suggest that they fret over their <i>budget</i> instead. That way, they won't need to suffer every time they enter a grocery store.</p><p>The same technique applies to effort. You don't need to suffer every time it's time to do the laundry. Stop looking at the individual tasks, and start looking at the streams of work, some of which you can widen and some of which you can narrow.</p><p>Look at <i>all</i> the streams you want to move through, assess how much bandwidth you have available, and then simply move through the streams at the appropriate clip. Some streams will be unpleasant (chores, etc.), some will be basically mandatory (making money, etc.), some will be quite fun (learning, exploring, relaxing, etc.), and some of the most important streams are the meta streams (improving your capacity, finding better ways to fulfill your needs, etc.). But in all cases, simply see the streams and then move along them.</p><p>Many people I meet seem to think that they need to take damage whenever they're working, and then only heal it when they rest. While they're studying, they're taking damage. While they're at a large social event, they're taking damage. While they're doing their job, they're taking damage. They seem to think they \"should\" be able to be at home doing nothing, and so when they're not, they're taking damage. They think that the ground state is a resting state, a state of inaction, and so whenever they're acting, this is a deviation from the default, and it requires effort to maintain.</p><p>I say, <i>the ground state is in motion.</i> The privileged state is not a frozen state. Most of us wouldn't want to just lie in bed doing nothing forever, anyway. The easiest state to maintain isn't a motionless state, it's the state where you're out there <i>doing what needs doing</i> at a sustainable pace. <i>That's</i> the ground state, that's the state that requires no effort to maintain. Anything less leads to boredom, and it's <i>boredom</i> that's taxing.</p><p>I think one of the reasons people think high productivity is hard is that they think of lying in bed doing nothing as the default state, and anything else as taking damage. But it's not. It's really not. We were built to <i>move</i>, and <a href=\"http://mindingourway.com/caring-about-some/\">we have things to do</a>.</p><p>Make sure you're not taking damage just for moving. If any state of being is going to wear you down, then I suggest that you feel pressure whenever you start to move too fast <i>or</i> too slow. Take damage when your life is too boring and nothing's getting done, and take damage when your life is moving at an unsustainable pace: but don't take damage when you're moving through the streams at a steady clip.</p><p>The default state, the effortless state, is the one where you're moving along many streams. It is up to you to make sure that you're prioritizing the right streams and that you're steadily increasing your throughput, but the end goal is not to cease moving. Total inaction is dreadfully boring.</p><p>The ground state, the state to aspire to, the healthy state, the state that occurs naturally when you aren't forcing yourself to do anything, is the state where you're getting done what you want done as fast as is sustainable, and no faster.</p><p>The ground state is in motion.</p>", "user": {"username": "So8res"}}, {"_id": "hh7juwFBMftSRZKu4", "title": "Working yourself ragged is not a virtue", "postedAt": "2015-06-21T05:00:00.000Z", "htmlBody": "<p>Let's get back to the \"replacing guilt\" series. Here's a quick recap of what we've covered so far:</p><p>Part 1 was about replacing the listless guilt: if someone feels vaguely guilty for not really doing anything with their life, then the best advice I can give is to start doing something. <a href=\"http://mindingourway.com/youre-allowed-to-fight-for-something/\">Find something to fight for.</a> Find a way that the world is not right, and <a href=\"http://mindingourway.com/caring-about-some/\">decide to change it</a>. Once the guilt is about failing at a <i>specific</i> task, then we can start addressing it.</p><p>Part 2 was about refusing to treat your moral impulses as obligations. <a href=\"http://mindingourway.com/should-considered-harmful/\">Be wary of the word should</a>, which tries to force an obligation upon you. I recommend <a href=\"http://mindingourway.com/not-because-you-should/\">refusing to do anything just because you \"should\"</a>: Insofar as that sets you free, the obligations were false ones. Insofar as that sparks fear that something important won't get completed, seek out the cause of the worry, and complete the task because you want to see it done, rather than because you \"should.\"</p><p>However, having something to change in the world and being free of false obligations is not anywhere near enough to replace guilt motivation. In fact, I think that most guilt in most people comes from a different source: it comes from people honestly deciding that X is what they want to do and then finding themselves <i>not doing X anyway.</i></p><p>Maybe they <i>know</i> that watching another episode of a TV show will cause them to stay up too late and be tired at class tomorrow, and they <i>know</i> that their classes are very expensive and that their parents would be very disappointed, and they decide that the best thing to do would be to stop binge-watching the TV show and get some sleep — and then they find themselves watching the next episode anyway.</p><p>This sort of guilt is one of the most demoralizing, and therefore it's perhaps one of the most damaging types of guilt. Addressing it is going to require quite a few different tools. Today, I'll describe one of them.</p><p>(If you haven't read <a href=\"http://mindingourway.com/half-assing-it-with-everything-youve-got/\">half-assing it with everything you've got</a>, recommend doing so now: I wrote it as a direct predecessor to this idea, before realizing that I actually needed the previous seven or so posts first.)</p><hr><p>Here's a failure mode that I used to see all the time, back when I was a professional programmer: A co-worker of mine would be working on a project that was <i>almost</i> under control. It would be a Friday afternoon, with an important deadline coming up in a few weeks, and everything would be almost passable but slightly behind schedule. Some dire bugs demanded fixes, some poor decisions required refactoring. Inevitably, my co-worker would conclude that if they just worked really hard <i>this</i> Friday, then they could finish the big refactor, and once that was done, <i>next</i> week they could get all the bugs under control, and then by the beginning of the week after that, everything would be back on track again.</p><p>(We all know how this story goes.)</p><p>Inevitably, co-workers of this type were constantly stressed, and reliably worked late into the night.</p><p>I suspect that most people who act like this are guilt-motivated. They're often the sort of person who feels guilty if they stop working before they're completely exhausted. Sometimes, they feel guilty for stopping even when they <i>are</i> exhausted, if there is still more work to be done. It's as if part of them believes that if they stop before they're physically forced to drop, and there's still work to be done, then they're being Bad.</p><p>This sort of behavior can stem from a number of mistakes. First and foremost, it seems to me that this sort of programmer is usually pursuing a lost purpose. They have <a href=\"http://mindingourway.com/half-assing-it-with-everything-youve-got/\">succumbed to tryer propaganda</a>; they have confused the quality line for the preference curve. I sometimes want to grab them by the shoulders late on a weekend, look them in the eyes, and ask them what they're fighting for — surely not this? <a href=\"http://mindingourway.com/youre-allowed-to-fight-for-something/\">You're allowed to fight for something</a>!</p><p>But I also see this failure mode in people who love their work, who believe in its importance. And yet, they still work themselves to exhaustion in a binge/recovery cycle, as if this were the best way to cause their project to succeed.</p><p>These people seem to be following an impulse to work as hard as possible whenever they can, perhaps due to a belief that it is unvirtuous for one to stop working when they could continue.</p><p>This is an error. <strong>The goal is not to maximize how much work you get done today. The goal is to maximize your productivity over time.</strong></p><p>People who feel guilty for stopping work when they could continue seem to be trying to maximize their local velocity: they feel a need to produce as much as they can, right now, on pain of guilt if they fail. But the actual goal is to maximize the total distance traveled, to maximize how much important work you can get done over time.</p><hr><p>(When all is said and done, and Nature passes her final judgement, you will not be measured by the number of moments in which you worked as hard as you could. You will be measured by what actually happened, as will we all.)</p><hr><p>People driven by guilt and shame often feel bad for <i>slowing down.</i> This is about as effective as starting a marathon with a dead sprint, and then feeling bad for slowing down when you can't sustain it.</p><p><i>Working yourself ragged is not a virtue.</i> You don't get extra points for effort. In fact, you <i>lose</i> points for effort: effort is costly; spend it only to purchase better outcomes. The goal is not to appear to be working hard, the goal is to improve the world. Sometimes you do need to push yourself to the limit, but before you do, acknowledge the costs and weigh the tradeoffs, while keeping your long-term goals in view.</p><p>We're not yet gods. We're still apes. Remember to pay attention to the distance you need to cover, and remember to pay attention to yourself.</p><p>Being a human can be frustrating. Human-bodies aren't as productive as we might like them to be, and running a human-body at maximum capacity for too long causes stress, chronic exhaustion, burnout, and psychological damage. With this in mind, doesn't it seem a bit confused for a person to berate themselves for stopping before they've spent all their available reserves?</p><p>Let me be clear: I'm <i>not</i> saying to restrict yourself to only 40 hour per week of work because it's important to pace yourself. I'm just saying that it's important to pace yourself. Do as much as you can, but don't be constantly taking damage. We aren't yet gods. We're still fragile. If you <a href=\"http://mindingourway.com/caring-about-some/\">have something urgent to do</a>, then work as hard as you can — but work as hard as you can <i>over a long period of time,</i> not <i>in the moment</i>.</p><p>I'm also not saying \"stop as soon as working feels hard.\" When exercising, it's important to understand the difference between soreness and strain, between pushing yourself and hurting yourself, and the same is true psychologically. Maintaining focus and productivity for long periods of time is a skill that can be trained, like any other. (More on that later, but spoiler alert, \"feeling really guilty when you didn't work as hard as you wanted to\" is not the best way to train this skill.)</p><p>Push your limits! Some things are worth fighting for! But while you're doing that, recognize that the way to complete a marathon isn't to sprint 42+ kilometers.</p><p>There is no shame in doing less than you could do in any given moment. Most guilt-motivated people I meet would do well to worry less about whether they're going fast enough <i>now</i>, and worry more about whether the amount of work they're doing day-to-day is ideal in the long term, taking psychological constraints into account. You don't get points for pushing your body and mind as hard as you can, you get <i>good outcomes</i> from using your resources as <i>wisely</i> as you can. That usually entails stopping well before you drop each day, while steadily improving your capabilities.</p><p>Please treat yourself well today; doing so is an important component of long-term productivity.</p>", "user": {"username": "So8res"}}, {"_id": "Syz3Fiqn5rBqhePiz", "title": "Your \"shoulds\" are not a duty", "postedAt": "2015-06-07T05:00:00.000Z", "htmlBody": "<p>I have a friend who, after reading my last two posts, still struggled to give up her shoulds. She protested that, if she stopped doing things because she should, then she might do the wrong thing. I see this frequently, even among people who claim to be moral relativists: they protest that if they weigh their wants and their shoulds on the same scales, then they might make the wrong choice.</p><p>But this notion of \"right\" vs \"wrong\" cannot come from outside. There is no stone tablet among the stars that mandates what is right. Moral relativists usually have no trouble remembering that their narrow, short-term desires (for comfort, pleasure, etc.) are internal, but many seem to forget that their wide, long-term desires (flourishing, less suffering, etc.) are also part of them.</p><p>Why did my friend worry that, if she stopped forcing herself to follow her shoulds, that she might do the wrong thing? There are no outside authorities punishing people who don't follow their best interests. There are no heavenly gatekeepers rewarding you for doing something other than what's best. The only reason to care about doing what's right is because you want what's right to be done. Why was she afraid that she would fail to follow her own interests, if she stopped using internal force? It's <i>you</i> who wants the right thing done, so if you fear you're not going to do the right things, then bargain with yourself.</p><p>Part of the problem, I think, is that she realized that she wants to both (a) do the right thing and (b) avoid all the effort that entails, and she feared that without the tool of internal force, she would be unable to do as much good as she wants to do. This is a valid concern, and following posts will discuss different tools for doing what you want (without resorting to internal force, which I think is unsustainable — remember, expending willpower is a stopgap, not a solution).</p><p>But another part of the problem, I think, was a lingering sense of resentment towards the shoulds, for trying to suck fun and enjoyment out of her life.</p><p>I see this often. Picture someone who needs to choose between playing video games all day (and losing their job) or getting abused by customers all day (for not all that much money). They conclude that they \"should\" do the job, and they feel compelled by the should. And then, over and over, I find my friends resenting their shoulds, as if the shoulds came from outside, from Beyond, from the Intergalactic Oughthorities. They treat their should like shackles that bind them to the \"right path\", the one where have to go to work when they could be playing video games.</p><p>But the shoulds aren't the shackles. There aren't any oughthorities. You always get to do as you please, within the bounds allowed by the universe. It's the <i>situation</i> which forces you to choose between bad and worse. Don't resent the bad option for being better than the worse option — if you must resent something, resent the situation.</p><p>(Or, better yet, turn your resentment into a cold resolve to <i>change</i> the situation.)</p><hr><p>If you ever start to feel that your shoulds are obligations, then remember this:</p><p><i>The shoulds were made for us, not us for them.</i></p><p>There are no facts about the stars that say what you ought to do. Your shoulds are not written in the heavens, nor in the void.</p><p>But your shoulds are written in <i>you.</i></p><p>What you \"should do\" in any given situation is a fact about your brain and the situation (which takes into account your current state of knowledge, and the amount of time you have available, and so on).</p><p>In other words, someone with a ton of computing power and intimate knowledge of your brain could <i>tell</i> you what you should do in any given situation.</p><p>Imagine being told some of those facts about what you \"should do, as computed by someone with ridiculous amounts of computing power. They print them out on a sheet of paper, and hand it to you. What would this sheet of paper look like?</p><p>I think that most people expect it would look like a long list of obligations, full of uncomfortable task they're actively trying to not remember. Most people seem to expect a highly aversive list that reads something like this:</p><ul><li>Clean your room.</li><li>Send a message to that one friend you fell out of touch with who sent you a message on your birthday.</li><li>Reconcile with your father.</li><li>Donate more to charity.</li><li>...</li></ul><p>This is exactly the notion of \"should\" that I'm trying to discharge.</p><p>Your true shoulds, if I could show them to you, would not look like a list of obligations. Your true shoulds would look like a <i>recipe for building a utopia.</i></p><p>They would look like a series of steps that make the world the best place you can make it.</p><p>And they wouldn't tell you to do anything psychologically unrealistic, either. Just as the list wouldn't say \"snap your fingers in just such a way that alzheimers is cured,\" the list wouldn't say \"work yourself to the bone for 16 hours a day while still remaining in high spirits.\" No, the true shoulds (as computed by someone with deep knowledge of your brain and ridiculous amounts of computing power) would appear to you as a psychologically possible list of things that happened to have surprisingly awesome impacts on the world.</p><hr><p>The things that you feel resentment towards are false shoulds, or at least twisted shoulds. Encountering one of your <i>actual</i> moral bonds feels very different indeed. A true opportunity to execute a moral commitment feels not like an obligation, but like a <i>priviledge</i>. It feels like executing a <a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ScrewTheRulesImDoingWhatsRight\">Screw The Rules I'm Doing What's Right</a> trope.</p><p>In fiction, picture the moment when the villain reveals that doing the Right Thing will start a war, and the hero sets their jaw, looks them in the eyes, and says \"so be it,\" and then does the right thing anyway.</p><p>In real life, think of <a href=\"http://en.wikipedia.org/wiki/Irena_Sendler\">Irena Sendler</a>, who smuggled thousands of Jewish children to safety during the holocaust, who was captured by the Nazis and tortured and had her legs broken and was sentenced to death, and who escaped anyway,</p><p>and then <i>went back.</i></p><p>Imagine what was going through her mind, when she decided to go back and save more people. Now, of course, I have no idea what she was actually feeling, but when I imagine what it would take for <i>me</i> to go back under those circumstances, I imagine feeling fear, and a hint of despair at finding myself still capable, but also a burning resolve to do the right thing anyway.</p><p>I imagine her feeling that having the opportunity to go back was a <i>privilege.</i> Not an external obligation whispered down from the heavens, but an internal fire, a defiance of the natural order, a need to make the world <i>different</i> from the way it would be otherwise.</p><p>Irena didn't have an <i>obligation</i> to keep fighting. She had more than discharged her moral duty. And while I'm willing to bet that at least part of her was scared, and at least part of her wished she had been crippled and unable to return, there was also a part of her that didn't look at the opportunity to return to save more children as a misfortune, but as an honor.</p><p>Can you begin to see the difference between a false should, and a true moral commitment? Think of a false should, one that gives you a strong sense of obligation and a hint of resentment (such as \"finish this paper\" or \"go to work tomorrow\"). Now imagine of Irena Sendler, offered the opportunity to return to Warsaw. Imagine what went on in her head, in that moment.</p><p>I imagine a mind afraid, but unified, because for her, it wasn't really a choice. Innocent children were still dying, and there was only one thing to do.</p><p><i>That's</i> what a true moral impulse feels like, when you find one. Not like an obligation, but like a piece of cold iron found deep in your core, the thing that you touch — or that touches you — in the moment that you really see the best option available to you, the moment that you realize you already know which way this choice is going to go.</p><p>Your shoulds are not shackles, and I caution you to be wary of anyone who tries to force a should upon you. For if you are not careful, you may start to feel like your shoulds are obligations, and you may start to resent them.</p><p>Human moral bonds aren't compulsions. They are what let Irena Sendler see the opportunity to risk life and limb to save just one more child, and treat it not as a duty, but as an honor. If you told <i>her</i> that she didn't have to go back, that she'd done enough, that she'd earned the right to turn away, and you asked her why the hell she was still going back to Warsaw,</p><p>then she's allowed to reach inside, touch that something of iron, look you in the eyes, and say \"because I should.\"</p><hr><p><i>That's</i> how you use a should. Not with obligation and resentment, but with steel in your heart and no other choice that compares.</p><p>I strongly encourage you to unpack your shoulds into their component wants and desires — I would rather not be responsible for inspiring a bunch of people to run around shoulding themselves and saying \"no, it's OK, these are the true moral bonds.\" Rather, the point I'm trying to make is this:</p><p>Many treat their moral impulses as a burden. But I say, find all the parts that feel like a burden, and drop them. Keep only the things that fill you with resolve, the things you would risk life and limb to defend.</p><p>Those moral impulses are not a reminder of your grudging duty. They are a reminder that you value things larger than yourself. They are a description of everything you're fighting for. They are the birthright of humanity, they are your love for fellow sentient creatures, they are everything we struggle so hard to send upwards to the stars.</p><p>They aren't a duty. They're an honor.</p>", "user": {"username": "So8res"}}, {"_id": "CsRyvwwop66dgo5gu", "title": "The Bittersweetness of Replaceability ", "postedAt": "2015-07-11T23:44:20.366Z", "htmlBody": "<html><body><h2>Everybody&apos;s replaceable</h2>\n<p>When I first became interested in effective altruist ideas, I was inspired by the power of one person to make a difference: &quot;the life you can save&quot;, as Peter Singer puts it. I planned to save lives by becoming an infectious disease researcher. So the first time I read about <a href=\"https://80000hours.org/2012/02/the-road-less-travelled-replaceability-and-neglected-causes/\">replaceability</a>&#xA0;was a gut punch, when I realized that it would be futile for me to pursue a highly competitive biomedical research position, especially given that I was mediocre at wet lab research. In the best case, I would obtain a research position but would merely be replacing other applicants who were roughly as good as me. I became deeply depressed for a time, as I finished a degree that was no longer useful to me. After I graduated, I embarked on the frustrating, counterintuitive challenge of making a difference in a world in which <a href=\"http://www.houseoflists.com/wp-content/uploads/2015/03/replaceable.gif\">everybody&apos;s replaceable</a>.</p>\n<p>Replaceability evokes ambivalence: on the one hand, it makes one&apos;s efforts to improve the world feel Sisyphean. On the other hand, replaceability is based on a fairly positive perception of the world, in which lots of people are pursuing worthwhile goals fairly well. Lately I&apos;ve become more optimistic about the world, which makes me more inclined to believe in replaceability. This makes certain EA options appear less promising, but an understanding of incentives can lead to the identification of areas in which one can make an irreplaceable difference.</p>\n<h2>Donation saturation</h2>\n<p><a href=\"https://80000hours.org/articles/earning-to-give/\">Earning to give</a> avoids some of the problems of replaceability, but a major challenge is finding an effective charity that needs donations. As GiveWell <a href=\"http://blog.givewell.org/2013/05/02/broad-market-efficiency/\">discusses</a>, there are few promising charitable causes that are underfunded. GiveWell often mentions lack of room for more funding when it fails to recommend a charity. It&apos;s somewhat easier to find funding gaps when considering more esoteric causes, such as existential risks, but as the GiveWell post mentions, even these areas receive considerable funding. A <a href=\"http://lesswrong.com/lw/k81/organisations_working_on_multiple_global/\">number of organizations</a>&#xA0;work on global catastrophic risks. I&apos;ve sometimes donated to EA organizations such as the Centre for Effective Altruism, only to feel a twinge of regret when their funding goals are quickly met or even exceeded. &#xA0;</p>\n<h2>&quot;Do your job&quot;<br></h2>\n<p>Because of the limitations of earning to give, I&apos;ve considered pursuing a career that would give me control over large amounts of money, particularly scientific funding. But lately I&apos;ve been having a mental conversation like this:&#xA0;</p>\n<p>me: If I take a job funding scientific research, I can do a lot of good. &#xA0;I could potentially move tens of millions of dollars to effective research that helps people.&#xA0;</p>\n<p>me: But isn&apos;t &quot;funding effective research that helps people&quot; already the goal of NSF and other major funders?&#xA0;</p>\n<p>me: Well I would do it better, because I&apos;m awesome.</p>\n<p>me: That&apos;s awfully cocky of you. What&apos;s something specific you&apos;d change?</p>\n<p>me: I would fund more pandemic prevention, for example.&#xA0;</p>\n<p>me: The U.S. government already spends $1 billion a year on biosecurity, as the GiveWell blog post mentioned. For comparison, the budget of NSF is less than $8 billion. The government is also <a href=\"https://www.medicalcountermeasures.gov/media/35695/cioce_current_vaccine_and_adjuvant_stockpiles.pdf\">stockpiling vaccines</a>&#xA0;to prevent pandemics. There might be more work to be done, but you&apos;re running out of low-hanging fruit. &#xA0;</p>\n<p>Many EA career ideas reduce to <a href=\"https://www.youtube.com/watch?v=LTaZkf4dih8\">&quot;Do your job. Do the shit out of it.&quot;</a>&#xA0;This is sound advice, but it&apos;s not as radical or inspiring as one might hope.&#xA0;</p>\n<h2>Is everyone else an idiot?</h2>\n<p>If everyone else were completely incompetent, being good at one&apos;s job could allow one to make a large difference in the world. The narrative that &quot;everyone but me is an idiot&quot; is popular among open mic comedians, and there are hints of this feeling in much of the rationalist literature. Proponents of this viewpoint often point to problems in scientific research, particularly the lack of reproducibility. While I agree that there are issues to be addressed in the research process, there are some people who are beginning to address them, as the GiveWell blog post discussed. Additionally, <a href=\"http://slatestarcodex.com/2014/12/12/beware-the-man-of-one-study/\">a single study</a> doesn&apos;t make or break a discipline. My experience in academia (I&apos;m a bioinformatics PhD student) has been quite positive. Most published research in my field seems fairly good, and I think there are several factors that contribute:</p>\n<p>&#xA0;</p>\n<ul>\n<li>Saturation: There are <a href=\"http://www.the-scientist.com/?articles.view/articleNo/27918/title/Is-America-competing-/\">1.47 million</a> researchers in the U.S., and they occupy almost every niche imaginable. I recently began a project in which I was trying to develop an expectation-maximization algorithm to filter binding events from background noise in Hi-C data. It was as arcane as it sounds, but as I was in the middle of it, another group published a paper doing exactly what I was trying to do, with an approach far better than mine. Even if you believe that most people aren&apos;t very clever, the sheer numbers mean that nearly every good idea is already taken.</li>\n<li>Feedback: While an individual researcher has incentive to make her own research look good, there&apos;s a pleasure to be had in destroying someone else&apos;s research. This can be witnessed at the weekly lab meetings I attend, in which adults are nearly brought to tears. Though the system is brutal, it results in thoughtful criticism that greatly improves the quality of research.&#xA0;</li>\n<li>System 2 thinking: Daniel Kahneman describes system 2 thinking as <a href=\"http://www.scientificamerican.com/article/kahneman-excerpt-thinking-fast-and-slow/\">slow, analytical thinking</a>. Many cognitive errors and biases result from the snap judgments of&#xA0;system 1 thinking. I&apos;d expect scientists to use system 2 thinking, because they think about problems over long periods of time and have a lot of domain-specific knowledge.&#xA0;</li>\n</ul>\n<div>These factors imply that being good at one&apos;s job won&apos;t have a large marginal benefit in many fields.</div>\n<div><br></div>\n<h2>How to be irreplaceable</h2>\n<p>Finding irreplaceable EA work requires identifying areas of society that have systematic implementation problems. Focusing on cognitive biases may not be the best strategy, given that certain areas of society, such as scientific research and the stock market, seem to have avoided the worst of these biases, even without explicit training. Instead, the Austrian school of economics can offer insight here. Austrian economists define rationality as actions that people take to pursue goals. Goals are not explicit but are revealed through behavior. For example, a commonly cited example of irrationality is that if people are made organ donors by default, most people will be organ donors, but if organ donation is not the default, most people will not be organ donors. An Austrian economist would say that this behavior reflects the fact that most people don&apos;t want to research the pros and cons of the boxes they check on forms. Perhaps they value their time too much and have found that the default is usually decent enough. Even if they express different preferences in surveys, their &quot;true&quot; preferences are revealed by their behavior. Thus, most human behavior is rational. Even though this is a tautology, it&apos;s useful in understanding human behavior by focusing on incentives and preferences rather than nebulous attempts to pin down the platonic ideal of rationality.&#xA0;</p>\n<p>The following figure is often used by libertarian economists to explain problems with economic incentives. The incentives of the state are represented by the red box. Though governments do some good, they also commit some of the largest and most blatant misappropriations of resources, including policies such as the drug war that are downright harmful. The charitable donations of the average person would be in the top right corner. This characterization seems accurate given that charitable donation is relatively stingy (<a href=\"http://www.charitynavigator.org/index.cfm/bay/content.view/cpid/42#.VaGhGvlViko\">2% of GDP</a>) but largely ineffective: the most popular charitable causes are education (much of this is wealthy universities catering to wealthy students) and religion, which together account for <a href=\"http://www.aefonline.org/ranking-top-charitable-causes\">45% of charitable giving</a>.&#xA0;</p>\n<p>&#xA0;</p>\n<p><img src=\"http://www.slobodaiprosperitet.tv/sites/default/files/images/4%20ways%20to%20spend%20money.jpg\" alt=\"\"></p>\n<p>However, in the strictest sense, scientific research and high-impact charities like the Gates Foundation would fall into the red box as well, and I&apos;ve been arguing that there&apos;s more efficiency in these areas than one might expect. Thus, I&apos;d characterize the matrix as a spectrum, rather than being binary. My lab is not exactly spending our money and we&apos;re not exactly spending it on ourselves. But we spend a lot of time thinking about how to spend the limited money we receive, and we have deep domain-specific knowledge of what we&apos;re spending it on. Because we associate the money and our research so much with ourselves, we&apos;re much closer to the top left corner than the U.S. president is when he creates a budget.&#xA0;</p>\n<p>As I mentioned above, saturation, feedback, and system 2 thinking promote high-quality scientific research. How do charities and governments compare on these dimensions? The market for charities is fairly saturated, and there are several organizations that do high-quality research, engage in system 2 thinking, and provide feedback. On the other hand, charitable donations from ordinary people are not subject to system 2 thinking and appropriate feedback. An analogous situation exists in government policy: a saturated field of think tanks and wonks engages in high-quality analytical thinking and provides feedback on policy proposals. However, the world of governments is not saturated, and individual governments face little competition. The feedback that governments receive is often perverse: citizens want lower taxes and higher government spending. System 2 thinking is notoriously lacking in public policy.&#xA0;</p>\n<h2>Conclusions</h2>\n<p>Replaceability is a problem in almost every aspect of EA (though some EAs may see it as a weight off their shoulders). I feel slightly more favorably toward earning to give than I did previously, but I&apos;m concerned about the lack of good giving opportunities. Direct EA work seems to be a good option, but there should be much more advocacy than research. EA organizations are probably reinventing the wheel through their research. Nitpickers will point out that advocacy itself is saturated and replaceable - this is probably true to an extent. Instead of advocating for specific policies, it may be better to focus on creating systems with favorable values and incentives. Compared to academic discussion of fallacies, an understanding of incentives can provide more insight into why systems fail. EA could benefit from the perspectives of libertarian economists.&#xA0;</p></body></html>", "user": {"username": "Lila"}}, {"_id": "BJ3sSyqX5XDTNX46s", "title": "Meetup : Seattle Monthly Meetup - Lightning Talks!", "postedAt": "2015-07-09T23:48:14.405Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/2z\">Seattle Monthly Meetup - Lightning Talks!</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>16 July 2015 06:30:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>312 2nd Ave W, Apt 518, Seattle, WA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Want to hear some new ideas really quickly? Want to present an idea really quickly? Come to Seattle EA&apos;s July Meetup, Lighting Talks! Held in the prestigious venue of my apartment, there will also be snacks and a puppy. After we&apos;ll probably play board games and/or Smash Bros.</p>\n\n<p>What&apos;s a Lightning Talk? A really fast presentation about the topic of your choice. The only rule is that it has to be at least tangentially EA related and/or teach a useful skill with widespread applications.\n<a href=\"https://en.wikipedia.org/wiki/Lightning_talk\">https://en.wikipedia.org/wiki/Lightning_talk</a>\nWant to use slides? Send them to me as a PDF and plan for each slide to display for 30 seconds.</p>\n\n<p>Planned Talks (so far):\nElizabeth - Interpretive Labor\nJai - When Can You Vote With Your Wallet?\nBrian/Sydney - MiniMeditation (10 minutes)\nJohn - TBD (maybe rationality stuff)</p>\n\n<p>We are actively looking for more talks (up to 8)! If you&apos;re willing to talk to us for a few minutes about a new idea or project or perspective, you will be The Coolest.\nTo get in - Dial *4264 on the keypad. Go left and take the elevator to the fifth floor - 518 will be right in front of you.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/2z\">Seattle Monthly Meetup - Lightning Talks!</a></h2></body></html>", "user": {"username": "SydMartin"}}, {"_id": "eKaZBTPifpGntK5M7", "title": "Have we underestimated the risk of a NATO-Russia nuclear war? Can we do anything about it?", "postedAt": "2015-07-09T16:09:50.490Z", "htmlBody": "<html><body><p>Until recently, I thought that the risk of a nuclear war in the 21st century, while not zero, was nevertheless very low and the marginal bit of effort spent reducing it further was probably not a good use of resources. But in the past two weeks, a series of articles on Vox.com have led me to rethink that view. <a href=\"http://www.vox.com/2015/6/29/8845913/russia-war\">The most detailed of them</a> is worth reading for full context, but I think the key points are these:</p>\n<p></p><ol>\n<li>Some experts are starting to worry that recent events in eastern Europe have raised the risk of a NATO-Russia nuclear war.</li>\n<li>This is because Putin is feeling vulnerable and threatened, and is using nuclear saber-rattling to compensate, doing some things even Cold War-era Soviet leaders avoided (because they felt more secure in their position).</li>\n<li>While nobody wants an all-out nuclear war, a particularly worrisome scenario is that Putin does something which, he expects, will scare NATO into backing off, but instead leads to a spiral of escalation.</li>\n</ol>\n<div>Another article reports on <a href=\"http://www.vox.com/2015/7/6/8900237/russia-war-odds\">a survey of experts putting the risk of nuclear war with Russia over the next 5 years at 2%</a>. There&apos;s also a <a href=\"http://www.vox.com/2015/6/29/8858909/russia-war-flowchart\">flowchart of how a crisis could escalate</a>.</div>\n<div><br></div>\n<div>I&apos;ve tried to see if other people in the EA community have thought about this issue. The main thing I can find is <a href=\"https://www.google.com/search?q=site%3A80000hours.org+nuclear+war&amp;oq=site%3A80000hours.org+nuclear+war&amp;aqs=chrome..69i57j69i58.5207j0j4&amp;sourceid=chrome&amp;es_sm=119&amp;ie=UTF-8#q=site:givewell.org+nuclear+war&amp;search_plus_one=form\">GiveWell&apos;s research into nuclear policy</a>, but when they&apos;ve looked into the risk of nuclear war, the focus has been on an India-Pakistan nuclear war (which admittedly could be pretty devastating, not just to India and Pakistan but to the rest of the world via fallout and environmental damage).</div>\n<div><br></div>\n<div>I&apos;m not sure what to do about this, except to say that it might be nice if GiveWell looked into the issue, if only on the level of one of their &quot;conversation with a single expert&quot; reports. A longer-term strategy might to found an organization dedicated to shifting incentives towards politicians in the US, UK, and France towards less bellicose rhetoric and less escalation, and more international compromise. (One worry when looking at the risk of nuclear war is that politicians may be repeatedly tempted to do things that slightly raise international tensions, for the sake of scoring political points back home.) But it would take a special skill set to be able to found such an organization.</div>\n<div><br></div>\n<div>Does anyone else have any other ideas?</div>\n<p></p></body></html>", "user": {"username": "TopherHallquist"}}, {"_id": "kf4bxfKsydYbLSb8z", "title": "The first .impact Workathon", "postedAt": "2015-07-09T07:38:12.143Z", "htmlBody": "<html><body><p>Last Sunday we had our first <a href=\"https://www.facebook.com/events/402219343297343/\">.impact Workathon</a>, an event focused on getting people together to get Effective-Altruist-oriented work done. &#xA0;A group in San Francisco worked at <a href=\"http://www.appacademy.io/\">App Academy</a>, and the rest worked remotely. &#xA0;We had approximately 15 people show up in total.</p>\n<p>Overall people seemed to like it a lot. &#xA0;We decided to schedule another one this <a href=\"https://www.facebook.com/events/1592346627696411/\">coming Sunday</a>. &#xA0;We&apos;ll try holding these weekly or bi-weekly. &#xA0;We will experiment with other meetings happening during the workathons; that way people know to expect that all online events and activity will happen within a standard time frame. &#xA0;The workathon may become a period of time for people to both do work, and on occasion attend online meetings to discuss projects. &#xA0;We&apos;ll begin this with a Deep Dive on <a href=\"https://www.facebook.com/events/403247733193470/\">Effective Altruism Policy Analysis</a> that will also happen on this coming Sunday during that time frame.</p>\n<p>We have a <a href=\"https://impact.hackpad.com/5-July-2015-.Workathon-1QsAHXbquSx\">pretty long hackpad</a> of all the work done, videos from the event (setup and checkin), the event template, event feedback (goods, bads, etc), and some of the original activities we considered.&#xA0;</p>\n<p>If you have been considering working on something, or are interested in advising other projects, we invite you to come along! &#xA0;We also think this could be a good format for other groups thinking of ways to have group activities that are both fun and productive.</p>\n<p><a href=\"https://impact.hackpad.com/5-July-2015-.Workathon-1QsAHXbquSx\">Link</a></p></body></html>", "user": {"username": "oagr"}}, {"_id": "nSSCjuGFY4ufwjGHH", "title": "What If You Could Save the World in Your Free Time?", "postedAt": "2015-07-07T01:14:58.162Z", "htmlBody": "<html><body><p>If you want to save the world in your professional life, go to 80,000 hours. And if you want to save the world with money you generate from your profession, go to GiveWell. But what if you want to save the world on the weekend? Or on a Wednesday night, instead of watching The Princess Bride for the 37th time?</p>\n<p><strong>The Problem</strong></p>\n<p>Volunteering is a hallowed part of our altruistic culture, and like our altruistic culture more generally, it often is sub-optimal. For practical reasons, direct-intervention volunteering focuses on the local, such as volunteering in a soup kitchen or cleaning up a local trail. And volunteering focused on raising money rarely capitalizes on the market value of the volunteer&apos;s free time; think: lawyers raising money through a bake sale. &#xA0;</p>\n<p><strong>What Is the Value of One&#x2019;s Free Time?</strong></p>\n<p>The simplest answer is the market rate for whatever one does for a living, e.g., web development, financial advice, legal advice, personal training, writing, editing, translation, etc. Some people have even more-valuable talents that do not lend themselves to a full-time career. If you have ever attended a charity auction, you likely have seen examples of these types of talents.</p>\n<p><strong>Potential Solutions </strong></p>\n<p><em>Work longer hours and donate the earnings to effective charities</em>. Most salaried employees do not have the option to work more hours at their job and collect a proportionately larger paycheck.</p>\n<p><em>Sell one&#x2019;s services on an existing website like Craigslist</em>. Although possible in theory, there is not (as far as I know) a market for regular people to sell a few hours of their time in this manner.</p>\n<p><strong>Proposal: Create a New Market </strong></p>\n<p>Another solution would be to create an online marketplace in which people could sell their time at its most-valued rate and give all, or a published percentage, of the proceeds to a designated charity. The idea would be to create a market that does not presently exist in which people could efficiently convert free time into money. Participants on both ends of a transaction would be contributing to charity, thereby creating an extra-market reason for consumers to purchase services on this site, even if the same service is available for the same price elsewhere. Think of it as an effective bake sale.</p>\n<p><strong>How It Might Work (Just Spitballin&#x2019; here)</strong></p>\n<p>The site would allow individuals to offer services and request services. Service providers would register an account and would receive ratings and reviews. The goal would be to create a genuine, competitive market without substantial barriers to entry. Ideal services would be those that could be provided remotely, such as the services mentioned above. But as mentioned above, because the proceeds go to charity, I suspect markets for unusual services would emerge that would not ordinarily exist.</p>\n<p><em>Where would the money go? </em>The site would promote EA-endorsed charities, but ultimately service providers would be able to choose the recipient of their funds. All payments would be through the site and would go directly to the designated charity. The site would publish how much money it moves to designated charities.</p>\n<p><em>Do All Proceeds Go to Charity?</em> Giving all proceeds to charity has a compelling simplicity to it. That said, I am drawn to the idea of creating a market that encourages for-profit, EA-oriented businesses. I could imagine a commercial niche developing for individuals (or even small companies) who give 30% of their revenue to charity. Indeed, the site might even be able to fund some or all of its own costs by taking a percentage of the for-profit revenue.</p>\n<p><strong>Potential Impact</strong></p>\n<p><em>First, </em>it would capture some portion of current, sub-optimal volunteering and convert it into much more effective volunteering.</p>\n<p><em>Second, </em>it would generate more volunteering. We all waste time. While saving the world is a better use of time than watching bad television, converting bad-television time into world-saving time is unfortunately not that simple. The goal of this site would be to make it simpler.</p>\n<p><em>Third, </em>it would be a potential source of PR and information for EA thinking and EA causes.</p>\n<p><em>Lastly, </em>it would be a means of widely teaching one of the most important and poorly understood EA concepts: trade-off costs.</p>\n<p><strong>Feedback</strong></p>\n<p>So, what am I missing?</p></body></html>", "user": {"username": "mhpage"}}, {"_id": "qrp5xRgpfubDBcJa6", "title": "Announcing the Doing Good Better Giveaway", "postedAt": "2015-07-06T00:02:19.303Z", "htmlBody": "<html><body><p><strong>We at CEA</strong> are running a great contest. You can win a ticket to EA Global, 80,000 Hours coaching, and/or signed copies of <a href=\"http://effectivealtruism.com\">Doing Good Better</a> by entering at <a href=\"http://book.80000hours.org\">book.80000hours.org</a>. You can, and should!, also share it with friends who could become EAs but aren&apos;t already.</p>\n<p>I&apos;ll provide more of the details below. But first, I&apos;ll try to anticipate the EA community response and address it.</p>\n<p><strong>Q1. Why are we doing this? </strong></p>\n<p>A1: First and foremost, we&apos;re running this contest because our book marketing agency has recommended we do so. This agency is behind the successes of many New York Times bestsellers, and they have done this type of contest successfully before.</p>\n<p><strong>Q2. But isn&apos;t this just clickbait? </strong></p>\n<p>A2: Not really. This contest incentivizes effective altruists to share it with their friends, introducing them to the movement. Since it is a giveaway that is free to enter, with prizes that will help share effective altruism with the winners, it is hopefully a great, easy way to begin to introduce new people to EA. Plus, you could win (and probably want) one of these EA-related prizes yourself.</p>\n<p><strong>Q3. What is the benefit? </strong></p>\n<p>A3: This should help us attract a number of people who are likely to be interested in effective altruism, but not already involved. These people are the exact target we&apos;re trying to reach with Will&apos;s book, which serves as a great intro to the movement. You can already see on <a href=\"http://www.amazon.com/Doing-Good-Better-Effective-Difference/dp/1592409105?tag=s4charity-20\">Amazon the reviews rolling in</a> (none of whom were already EAs). I hope that answers any potential concerns or questions. I encourage you to enter and share it with friends.</p>\n<p><strong> Here&apos;s the full details of the contest: </strong></p>\n<p>To herald the release of his book &#x201C;<strong><a href=\"http://www.amazon.com/Doing-Good-Better-Effective-Difference/dp/1592409105?tag=s4charity-20\">Doing Good Better: How Effective Altruism Can Help You Make a Difference</a></strong>&#x201D;, William MacAskill is giving away many ways for people to get involved in the effective altruism community.</p>\n<p><a href=\"http://www.amazon.com/Doing-Good-Better-Effective-Difference/dp/1592409105?tag=s4charity-20\">Doing Good Better</a> helps address five key questions that help guide our altruistic decisions: How many people benefit, and by how much? Is this the most effective thing I can do? Is this area neglected? What would have happened otherwise? What are the chances of success, and how good would success be?</p>\n<p>The following prizes will all help you arrive at those answers.</p>\n<p>Entrance is free, and the more you spread the word, the more likely you are to win &#x2013; earn THREE extra entries for every friend you refer to the contest! You&apos;ll also receive news about effective altruism, 80,000 Hours, and the launch of <a href=\"http://www.effectivealtruism.com\">Doing Good Better</a>. (Unsubscribe at any time.)</p>\n<p>The <strong>GRAND PRIZE</strong> (1 Winner) &#x2013; 1 lucky person will win a ticket to <a href=\"http://eaglobal.org\">EA Global</a> (Effective Altruism Global) featuring Elon Musk.  Effective Altruism Global 2015 is the largest ever convening of thought leaders, entrepreneurs, billionaires, CEOs, investors, and scientists, and more who are applying reason and data to tackle the world&#x2019;s biggest challenges.  PLUS a FREE career coaching package from 80,000 hours.  PLUS a signed copy of William MacAskill&#x2019;s most recent book, Doing Good Better: How Effective Altruism Can Help You Make a Difference.</p>\n<p><strong> SECOND PRIZE </strong>(3 Winners) &#x2013; 3 people will win <a href=\"http://www.80000hours.org\">80,000 Hours</a> career coaching.  Whether you have several options on the table or don&#x2019;t know where to start, we&#x2019;ll provide personal, evidence-based advice to help you choose the career where you&#x2019;ll make the biggest difference.</p>\n<p><strong>THIRD PRIZE</strong> (5 Winners) &#x2013; Five people will win a signed copy of William MacAskill&#x2019;s upcoming book, <a href=\"http://www.amazon.com/Doing-Good-Better-Effective-Difference/dp/1592409105?tag=s4charity-20\">Doing Good Better: How Effective Altruism Can Help You Make a Difference</a>.</p>\n<p>Want to earn additional entries in this giveaway? Earn 3 extra entries for every friend you refer to the contest. We&#x2019;ll give you a unique, &#x201D;lucky URL&#x201D; to share after after you enter at <a href=\"http://book.80000hours.org\">book.80000hours.org</a>.</p></body></html>", "user": {"username": "joshjacobson"}}, {"_id": "HqbGYhx5xvQCQWJ2F", "title": "MIRI is seeking an Office Manager / Force Multiplier", "postedAt": "2015-07-05T19:02:24.163Z", "htmlBody": "<html><body><p><small><em>(Cross-posted on behalf of <a href=\"https://intelligence.org/2015/07/01/wanted-office-manager/\">Alex Vermeer</a>.)</em></small></p>\n<p><em><br></em></p>\n<p>The Machine Intelligence Research Institute is looking for a full-time office manager to support our growing <a href=\"https://intelligence.org/team/\">team</a>. It&#x2019;s a big job that requires organization, initiative, technical chops, and superlative communication skills. You&#x2019;ll develop, improve, and manage the processes and systems that make us an effective organization. You&#x2019;ll obsess over our processes (faster! easier!) and our systems (simplify! simplify!). Essentially, it&#x2019;s your job to ensure that everyone at MIRI, including you, is able to focus on their work and Get Sh*t Done.</p>\n<p>That&#x2019;s a super-brief intro to what you&#x2019;ll be working on. But first, you need to know if you&#x2019;ll even like working here.</p>\n<p>&#xA0;</p>\n<h2>A Bit About Us</h2>\n<p>We&#x2019;re a research nonprofit working on the critically important problem of <em>superintelligence alignment</em>: how to bring smarter-than-human artificial intelligence into alignment with human values. You can learn more at these links:</p>\n<ul>\n<li><a href=\"https://intelligence.org/about/\">About MIRI</a></li>\n<li>Nick Bostrom talk: <a href=\"https://www.youtube.com/watch?v=MnT1xgZgkpk\">What Happens When Our Computers Get Smarter Than We Are?</a></li>\n<li>MIRI&apos;s&#xA0;<a href=\"https://intelligence.org/technical-agenda/\">Technical Agenda</a></li>\n<li>Nate Soares&apos;&#xA0;<a href=\"/ea/ju/i_am_nate_soares_ama/\">EA Forum AMA</a></li>\n</ul>\n<p>Superintelligence alignment is a burgeoning field, and arguably the most important and under-funded research problem in the world. Experts largely agree that AI is likely to exceed human levels of capability on most cognitive tasks in this century&#x2014;but it&#x2019;s not clear <em>when</em>, and we aren&#x2019;t doing a very good job of preparing for the possibility. Given how disruptive smarter-than-human AI would be, we need to start thinking now about AI&#x2019;s global impact. Over the past year, a number of leaders in science and industry have voiced their support for prioritizing this endeavor:</p>\n<ul>\n<li>Stuart Russell, co-author of the leading <a href=\"http://aima.cs.berkeley.edu/\">textbook</a> on artificial intelligence and a MIRI advisor, has given a&#xA0;<a href=\"https://www.youtube.com/watch?v=GYQrNfSmQ0M\">compelling argument</a> for doing this work sooner rather than later.</li>\n<li>Nick Bostrom, another MIRI research advisor, published <em><a href=\"http://www.amazon.com/Superintelligence-Dangers-Strategies-Nick-Bostrom/dp/0199678111/\">Superintelligence: Paths, Dangers, Strategies</a></em>, which details the potential value of smarter-than-human AI systems as well as the potential hazards.</li>\n<li>Elon Musk (SpaceX, Tesla), Bill Gates (Microsoft co-founder), Stephen Hawking (world-renowned theoretical physicist), and others have publicly stated their concerns about long-term AI risk.</li>\n<li>Hundreds of AI researchers and engineers recently signed an <a href=\"http://futureoflife.org/misc/open_letter\">open letter</a> advocating for more research into robust and beneficial artificial intelligence. A number of MIRI publications are cited in the corresponding <a href=\"http://futureoflife.org/static/data/documents/research_priorities.pdf\">Research Priorities</a> document.</li>\n</ul>\n<p>People are starting to discuss these issues in a more serious way, and MIRI is well-positioned to be a thought leader in this important space. As interest in AI safety grows, we&#x2019;re growing too&#x2014;we&#x2019;ve gone from a single full-time researcher in 2013 to what will likely be a half-dozen research fellows by the end of 2015, and intend to continue growing in 2016.</p>\n<p>All of which is to say: we <em>really need</em> an office manager who will support our efforts to hack away at the problem of superintelligence alignment!</p>\n<p>If our overall mission seems important to you, and you love running well-oiled machines, you&#x2019;ll probably fit right in. If that&#x2019;s the case, we can&#x2019;t wait to hear from you.</p>\n<p>&#xA0;</p>\n<h2>What It&#x2019;s Like to Work at MIRI</h2>\n<p>We try really hard to make working at MIRI an amazing experience. We have a team full of truly exceptional people&#x2014;the kind you&#x2019;ll be excited to work with. Here&#x2019;s how we operate:</p>\n<p><strong>Flexible Hours</strong></p>\n<p><strong></strong>We do not have strict office hours. Simply ensure you&#x2019;re here enough to be available to the team when needed, and to fulfill all of your duties and responsibilities.</p>\n<p><strong>Modern Work Spaces</strong></p>\n<p>Many of us have adjustable standing desks with multiple large external monitors. We consider workspace ergonomics important, and try to rig up work stations to be as comfortable as possible.</p>\n<p><strong>Living in the Bay Area</strong></p>\n<p>We&#x2019;re located in downtown Berkeley, California. Berkeley&#x2019;s monthly average temperature ranges from 60&#xB0;F in the winter to 75&#xB0;F in the summer. From our office you&#x2019;re:</p>\n<ul>\n<li>A 10-second walk to the roof of our building, from which you can view the Berkeley Hills, the Golden Gate Bridge, and San Francisco.</li>\n<li>A 30-second walk to the BART (Bay Area Rapid Transit), which can get you around the Bay Area.</li>\n<li>A 3-minute walk to UC Berkeley Campus.</li>\n<li>A 5-minute walk to dozens of restaurants (including ones in Berkeley&#x2019;s well-known Gourmet Ghetto).</li>\n<li>A 30-minute BART ride to downtown San Francisco.</li>\n<li>A 30-minute drive to the beautiful west coast.</li>\n<li>A 3-hour drive to Yosemite National Park.</li>\n</ul>\n<div><strong>Vacation Policy</strong></div>\n<p>Our vacation policy is that we don&#x2019;t have a vacation policy. That is, take the vacations you need to be a happy, healthy, productive human. There are checks in place to ensure this policy isn&#x2019;t abused, but we haven&#x2019;t actually run into any problems since initiating the policy.</p>\n<p>We consider our work important, and we care about whether it gets done well, not about how many total hours you log each week. We&#x2019;d much rather you take a day off than extend work tasks just to fill that extra day.</p>\n<p><strong>Regular Team Dinners and Hangouts</strong></p>\n<p>We get the whole team together every few months, order a bunch of food, and have a great time.</p>\n<p><strong>Top-Notch Benefits</strong></p>\n<p>We provide top-notch health and dental benefits. We care about our team&#x2019;s health, and we want you to be able to get health care with as little effort and annoyance as possible.</p>\n<p><strong>Agile Methodologies</strong></p>\n<p>Our ops team follows standard Agile best practices, meeting regularly to plan, as a team, the tasks and priorities over the coming weeks. If the thought of being part of an effective, well-functioning operation gets you really excited, that&#x2019;s a promising sign!</p>\n<p><strong>Other Tidbits</strong></p>\n<ul>\n<li>Moving to the Bay Area? We&#x2019;ll cover up to $3,500 in moving expenses.</li>\n<li>Use public transit to get to work? You get a transit pass with a large monthly allowance.</li>\n<li>All the snacks and drinks you could want at the office.</li>\n<li>You&#x2019;ll get a smartphone and full plan.</li>\n<li>This is a salaried position. (That is, your job is not to sit at a desk for 40 hours a week. Your job is to get your important work <em>done</em>, even if this occasionally means working on a weekend or after hours.)</li>\n</ul>\n<p>If this sounds like your ideal work environment, read on! It&#x2019;s time to talk about your role.</p>\n<p>&#xA0;</p>\n<h2>What an Office Manager Does and Why It Matters</h2>\n<p>Our ops team and researchers (and collection of remote contractors) are <em>swamped</em> making progress on the huge task we&#x2019;ve taken on as an organization.</p>\n<p>That&#x2019;s where you come in. An office manager is the oil that keeps the engine running. They&#x2019;re <em>indispensable</em>. Office managers are force multipliers: a good one doesn&#x2019;t merely improve their own effectiveness&#x2014;they make the entire <em>organization</em> better.</p>\n<p>We need you to build, oversee, and improve all the &#x201C;behind-the-scenes&#x201D; things that ensure MIRI runs smoothly and effortlessly. You will devote your full attention to looking at the big picture and the small details and making sense of it all. You&#x2019;ll turn all of that into actionable information and tools that make the whole team better. That&#x2019;s the job.</p>\n<p>Sometimes this looks like researching and testing out new and exciting services. Other times this looks like stocking the fridge with drinks, sorting through piles of mail, lugging bags of groceries, or spending time on the phone on hold with our internet provider. But don&#x2019;t think that the more tedious tasks are low-value. If the hard tasks don&#x2019;t get done, <em>none</em> of MIRI&#x2019;s work is possible. Moreover, you&#x2019;re actively encouraged to find creative ways to make the boring stuff more efficient&#x2014;making an awesome spreadsheet, writing a script, training a contractor to take on the task&#x2014;so that you can spend more time on what you find most exciting.</p>\n<p>We&#x2019;re small, but we&#x2019;re growing, and this is an opportunity for you to grow too. There&#x2019;s room for advancement at MIRI (if that interests you), based on your interests and performance.</p>\n<p>&#xA0;</p>\n<p><strong>Sample Tasks</strong></p>\n<p>You&#x2019;ll have a wide variety of responsibilities, including, but not necessarily limited to, the following:</p>\n<ul>\n<li>Orienting and training new staff.</li>\n<li>Onboarding and offboarding staff and contractors.</li>\n<li>Managing employee benefits and services, like transit passes and health care.</li>\n<li>Payroll management; handling staff questions.</li>\n<li>Championing our internal policies and procedures wiki&#x2014;keeping everything up to date, keeping everything accessible, and keeping staff aware of relevant information.</li>\n<li>Managing various services and accounts (ex. internet, phone, insurance).</li>\n<li>Championing our work space, with the goal of making the MIRI office a fantastic place to work.</li>\n<li>Running onsite logistics for introductory workshops.</li>\n<li>Processing all incoming mail packages.</li>\n<li>Researching and implementing better systems and procedures.</li>\n</ul>\n<p>Your &#x201C;value-add&#x201D; is by taking responsibility for making all of these things happen. Having a competent individual in charge of this diverse set of tasks at MIRI is <em>extremely valuable</em>!</p>\n<p>&#xA0;</p>\n<p><strong>A Day in the Life</strong></p>\n<p>A typical day in the life of MIRI&#x2019;s office manager may look something like this:</p>\n<ul>\n<li>Come in.</li>\n<li>Process email inbox.</li>\n<li>Process any incoming mail, scanning/shredding/dealing-with as needed.</li>\n<li>Stock the fridge, review any low-stocked items, and place an order online for whatever&#x2019;s missing.</li>\n<li>Onboard a new contractor.</li>\n<li>Spend some time thinking of a faster/easier way to onboard contractors. Implement any hacks you come up with.</li>\n<li>Follow up with Employee X about their benefits question.</li>\n<li>Outsource some small tasks to TaskRabbit or Upwork. Follow up with previously outsourced tasks.</li>\n<li>Notice that you&#x2019;ve spent a few hours per week the last few weeks doing xyz. Spend some time figuring out whether you can eliminate the task completely, automate it in some way, outsource it to a service, or otherwise simplify the process.</li>\n<li>Review the latest post drafts on the wiki. Polish drafts as needed and move them to the appropriate location.</li>\n<li>Process email.</li>\n<li>Go home.</li>\n</ul>\n<div><br></div>\n<h3>You&#x2019;re the One We&#x2019;re Looking For If:</h3>\n<ul>\n<li>You are authorized to work in the US. (Prospects for obtaining an employment-based visa for this type of position are slim; sorry!)</li>\n<li>You can solve problems for yourself in new domains; you find that you don&#x2019;t generally need to be told what to do.</li>\n<li>You love organizing information. (There&#x2019;s <em>a lot of it</em>, and it needs to be super-accessible.)</li>\n<li>Your life is organized and structured.</li>\n<li>You enjoy trying things you haven&#x2019;t done before. (How else will you learn which things work?)</li>\n<li>You&#x2019;re way more excited at the thought of being the jack-of-all-trades than at the thought of being the specialist.</li>\n<li>You are good with people&#x2014;good at talking about things that are going great, as well as things that aren&#x2019;t.</li>\n<li>People thank you when you deliver difficult news. You&#x2019;re that good.</li>\n<li>You can notice all the subtle and wondrous ways processes can be automated, simplified, streamlined&#x2026; while still keeping the fridge stocked in the meantime.</li>\n<li>You know your way around a computer really well.</li>\n<li>Really, really well.</li>\n<li>You enjoy eliminating unnecessary work, automating automatable work, outsourcing outsourcable work, and executing on everything else.</li>\n<li>You want to do what it takes to help all other MIRI employees focus on their jobs.</li>\n<li>You&#x2019;re the sort of person who sees the world, organizations, and teams as systems that can be observed, understood, and optimized.</li>\n<li>You think Sam is the real hero in <em>Lord of the Rings</em>.</li>\n<li>You have the strong ability to take real responsibility for an issue or task, and ensure it gets done. (This doesn&#x2019;t mean it has to get done by <em>you</em>; but it has to get done <em>somehow</em>.)</li>\n<li>You celebrate excellence and relentlessly pursue improvement.</li>\n<li>You lead by example.</li>\n</ul>\n<div><strong>Bonus Points:</strong></div>\n<ul>\n<li>Your technical chops are really strong. (Dabbled in scripting? HTML/CSS? Automator?)</li>\n<li>Involvement in the Effective Altruism space.</li>\n<li>Involvement in the broader AI-risk space.</li>\n<li>Previous experience as an office manager.</li>\n</ul>\n<div><strong>Experience and Education Requirements:</strong></div>\n<ul>\n<li>Let us know about anything that&#x2019;s evidence that you&#x2019;ll fit the bill.</li>\n</ul>\n<div><br></div>\n<h2>How to Apply</h2>\n<p><a href=\"https://machineintelligence.typeform.com/to/FpvmMf\"><strong>Click here to apply</strong></a> by July 31, 2015!</p>\n<p>P.S. Share the love! If you know someone who might be a perfect fit, we&#x2019;d really appreciate it if you pass this along.</p></body></html>", "user": {"username": "RobBensinger"}}, {"_id": "FdTxTPZnDrdX6Bh5w", "title": "We're hiring an AI Senior Policy Fellow", "postedAt": "2015-07-02T16:10:13.343Z", "htmlBody": "<html><body><p>The Global Priorities Project is advertising a position for a Senior Policy Fellow to lead the creation of a report outlining policy options for AI safety. The deadline for applications is the 2nd of August.</p>\n<p>Please help us find great candidates by passing this on to anyone you think might be interested. Also take a moment to think about people you might know who would know someone interested, even if you don&apos;t yourself.</p>\n<p>The full job description can be found <a href=\"http://globalprioritiesproject.org/2015/06/we-are-hiring-for-a-senior-policy-fellow/\">here</a>.</p></body></html>", "user": {"username": "Sebastian_Farquhar"}}, {"_id": "eqjxL6DiXPBJhakZE", "title": "July Open Thread", "postedAt": "2015-07-02T13:41:52.991Z", "htmlBody": "<html><body><p><span>Here&apos;s a place to discuss projects, ideas, events and miscellanea relevant to the world of effective altruism that don&apos;t need a whole post of their own!</span></p>\n<p>Some news from the last month in effective altruism:</p>\n<p>&#xA0;</p>\n<ul>\n<li><span><span>Giving What We Can reached its target of 150,000 GBP in the <a href=\"http://givingwhatwecan.causevox.com/\">fundraising drive</a>&#xA0;that finished yesterday.</span></span></li>\n<li><span><span>The Future of Life Institute has distributed <a href=\"http://futureoflife.org/misc/2015selection\">$7 million</a>, mostly from Elon Musk, for keeping AI beneficial to humans.</span></span></li>\n<li><span>The Open Philanthropy Project is hiring for </span><a href=\"http://www.givewell.org/about/jobs/open-philanthropy-project\">program officers</a><span> in factory farming and biosecurity. MIRI is hiring for an </span><a href=\"https://intelligence.org/careers/\">office manager</a><span>. CEA is also (I&apos;m told) looking for an office manager.</span></li>\n</ul>\n<div><br></div>\n<div><span><span>The EA Forum again had over 14 thousand sessions and its most ever! Great to have so much participation!</span></span></div>\n<p>&#xA0;</p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "avr2q6cSKzPN4fpSZ", "title": "Stanford EA History and Lessons Learned", "postedAt": "2015-07-02T03:36:56.688Z", "htmlBody": "<html><body><p><em>Written by Alex Richard.</em></p>\n<p>&#xA0;</p>\n<p><span>1) Getting Official Approval</span></p>\n<p>&#xA0;</p>\n<p><span>We had significant trouble getting official approval; it wound up taking us over two years. Lessons learned:</span></p>\n<p>&#xA0;</p>\n<ul>\n<li>\n<p><span>Be very, very careful about implying (or even hinting) that other groups are less than optimally effective. We may (or may not? memory is difficult) have done so at our first meeting, which left university staff very reluctant to approve us. </span></p>\n</li>\n<li>\n<p><span>Check whether your school explicitly desires or opposes affiliation with an outside organization. In our case, we were originally rejected partially because of concerns over our close affiliation with THINK; when we eventually were approved, it was as Stanford EA, not as Stanford THINK. On the other hand, at other schools it might be easier to get approved if you are explicitly an affiliate of a broader organization. You should figure this out before applying- just shoot a quick email to whoever&#x2019;s in charge of registering new groups.</span></p>\n</li>\n</ul>\n<p>&#xA0;</p>\n<p><span>2) Expect Very Low Initial Turnout</span></p>\n<p>&#xA0;</p>\n<p><span>During its first year of existence, Stanford EA both had very low turnout (never exceeding 4) and only irregular meetings. (We now have regular turnout of ~20-25 and meet twice a week.)</span></p>\n<p>&#xA0;</p>\n<ul>\n<li>\n<p><span>In my [Alex Richard&#x2019;s] experience, one of the main reasons local organizations close down is that their founders get discouraged by low initial turnout, go for maybe 4 weekly meetings with just them and 1-2 other people, and then give up.</span></p>\n</li>\n<li>\n<p><span>Some people will come once, then never come again; &#xBC;-&#x2155; of people will come once and then come very consistently. Once a few consistent members aside from the original founders join, the group is very likely to survive the next few years. (The next trouble spot will likely be when the original members graduate, which hasn&#x2019;t occurred at SEA yet.)</span></p>\n</li>\n<li>\n<p><span>Crucial for groups&#x2019; early survival is that the original founders/founder and first members are or become friends outside of the meetings. This will keep people engaged even when it appears that outreach is not going as well as could be hoped. (Once a decent sized group has regular meetings, this is no longer needed; at our summer meetings most of our original members were elsewhere for the summer, but they&#x2019;ve still been going fine.)</span></p>\n</li>\n<li>\n<p><span>I&#x2019;m not sure how to fix this in general; suggestions include:</span></p>\n<ul>\n<li>\n<p><span>Lower expectations of initial turnout/clarify that chapter leaders will likely need to wait around 1-2 years until the group is large and self-sustaining-ish</span></p>\n</li>\n<li>\n<p><span>Focus more on initial recruitment, to make it more likely that the group gets big and sustainable quickly</span></p>\n<ul>\n<li>\n<p><span>Not sure if this will work; I feel like our history, the norms we&#x2019;ve established through trial and error, and our community are important above and beyond the number of individual members. One possibility is to hope that there is shared community at the start, via either LW or people who are already EA&#x2019;s in an area</span></p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>&#xA0;</p>\n<p><span>3) Establish A Regular Meeting That Draws People</span></p>\n<p>&#xA0;</p>\n<ul>\n<li>\n<p><span>We described ours </span><a href=\"http://ea-forum.trikeapps.com/ea/hl/how_we_run_discussions_at_stanford_ea/\"><span>here</span></a><span>; all materials are </span><a href=\"https://drive.google.com/open?id=0B7BGumocZjekfjJXYVBaWWF6S0ZPN1czSVF5QVNnWUhORFpIWkw2Nms4RU9TOXhuU0FYa00&amp;authuser=0\"><span>here</span></a></p>\n</li>\n<li>\n<p><span>Other models: Harvard brings in speakers, Berkeley teaches a class</span></p>\n</li>\n</ul>\n<p>&#xA0;</p>\n<p><span>4) Recruitment Methods We&#x2019;ve Tried</span></p>\n<p>&#xA0;</p>\n<ul>\n<li>\n<p><span>Relying on personal contacts: Generally low yield, but produced committed people. Was better for us at the start; we eventually basically ran out of easily recruitable and interested people we knew.</span></p>\n</li>\n<li>\n<p><span>Posting to EA Forum and LW Meetups list: super effective given the minimal time it takes. We got maybe &#xBC; of our regular attendees from these posts.</span></p>\n</li>\n<li>\n<p><span>Blind emails: Not effective. We &#x2018;recruited&#x2019; exactly one person this way.<br></span></p>\n</li>\n<li>\n<p><span>Advertising in-person to interested groups: Effective for us. (e.g. relevant classes, other relevant student groups)</span></p>\n</li>\n<li><span>General outreach: e.g. sharing our website/mailing list, handing out flyers, etc. Was probably not effective, at least in terms of getting new attendees to our meetings</span></li>\n</ul>\n<p>&#xA0;</p>\n<p><em>Thanks to Michael Dickens, Caroline Ellison, and Kelsey Piper for providing feedback on this post.</em></p></body></html>", "user": {"username": "MichaelDickens"}}, {"_id": "jD4otddxmB4XJABw3", "title": "Random idea: crowdsourcing lobbyists", "postedAt": "2015-07-02T01:16:05.861Z", "htmlBody": "<html><body><p>Hi all,</p>\n<p>A random idea I stumbled across recently: a kickstarter for lobbyists.</p>\n<p>One of the deepest structural problems in our political system is that narrow groups with strong interests often win out over the common good.</p>\n<p>Imagine a country of 1,000 people. A new policy is proposed that will benefit 990 people by $1, but will cost the remaining ten people $10. The net benefit to society is $990 - 10*$10 = $880, a clear win, but these sorts of policies often don&apos;t happen. That&apos;s because the ten people who are harmed are strongly incentivised to work together to lobby the government against the policy. It&apos;s much harder for the 990 people to coordinate, and each individual stands to gain only $1.</p>\n<p>A typical example would be a corporation opposing regulation on pollution. If the regulation goes through, the shareholders of the corporation lose a lot, so will arrange a lobbying effort. The pollution causes a small harm to a much larger number of people, so is net harmful overall.</p>\n<p>However, it&apos;s possible today that social media and crowd funding could alleviate this problem. You could use a platform like kickstarter to get each of the 990 people to pay $0.1 to fund a lobbyist to represent their interests, overwhelming the funds of the narrow interest group.</p>\n<p>Lobbying in general seems to offer a lot of leverage. Typically only millions of dollars are spent on issues where amounts hundreds of times larger are at stake. And there have been academic studies finding the ROI on lobbying is high.</p>\n<p>https://en.wikipedia.org/wiki/Tullock_paradox</p>\n<p>http://www.washingtonpost.com/blogs/ezra-klein/post/the-outsized-returns-from-lobbying/2011/10/10/gIQADSNEaL_blog.html</p>\n<p>http://www.nber.org/papers/w9064</p>\n<p>You could test this idea by running a couple of small campaigns on the side.</p>\n<p>Any suggestions to add? Any ideas on how to make this happen?</p>\n<p>Ben</p></body></html>", "user": {"username": "Benjamin_Todd"}}, {"_id": "TuJvmZQ3QfmwEPWSn", "title": "Meetup : GiveWell research event for Bay Area effective atlruists!", "postedAt": "2015-06-30T01:22:05.169Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/2y\">GiveWell research event for Bay Area effective atlruists!</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>07 July 2015 07:00:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>San Francisco, CA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>If you&apos;re interested in effective altruism, and you live in the Bay Area, you should come eat pizza and hang out with us at GiveWell&apos;s offices in San Francisco a couple weeks from now. (Tentatively, the evening of July 7th or 8th; we&apos;re not sure yet.)</p>\n\n<p>The structure will be similar to past GiveWell research events: food and drinks are provided, there&apos;s some time for mingling, then there are presentations on GiveWell&apos;s top charity work and the Open Philanthropy Project (US policy, global catastrophic risks, etc.), and then more time for mingling. But this event is specifically targeted at those who are strongly interested in effective altruism, including fans of CFAR, MIRI, CEA, FHI, LessWrong, etc.</p>\n\n<p>We hope to be able to accommodate everyone who is interested, but we may have to limit places depending on demand. If you are interested to attend, please fill out this short form:</p>\n\n<p><a href=\"https://docs.google.com/forms/d/1rcN39r3MCF1zcb8C0kF2dAPU8blN957WhO5I-tSleLk/viewform?c=0&amp;w=1\">https://docs.google.com/forms/d/1rcN39r3MCF1zcb8C0kF2dAPU8blN957WhO5I-tSleLk/viewform?c=0&amp;w=1</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/2y\">GiveWell research event for Bay Area effective atlruists!</a></h2></body></html>", "user": {"username": "lukeprog"}}, {"_id": "NDhjoWvTA8z4pq8hD", "title": "Veg*n recidivism seems important, tractable, and neglected", "postedAt": "2015-06-28T18:33:01.268Z", "htmlBody": "<html><body><p>Reducing animal suffering is one of the main <a href=\"/ea/4k/four_focus_areas_of_effective_altruism/\">focus areas</a>&#xA0;of the Effective Altruism movement. &#xA0;Currently, the dominant approach to reducing animal suffering among EAs <a href=\"http://www.animalcharityevaluators.org/recommendations/top-charities/\">seems to be</a> veg*n (vegetarian/vegan) advocacy. &#xA0;But there&apos;s a big problem with veg*n advocacy: most people who switch to veg*n diets later switch back. &#xA0;Animal Charity Evaluators <a href=\"http://www.animalcharityevaluators.org/research/foundational-research/vegetarian-recidivism/\">writes</a>:</p>\n<blockquote>\n<p>Overall, the evidence suggests that the vast majority of people who adopt dietary changes like vegetarianism, veganism, and other forms of animal-product-limiting eventually return at least some distance towards their former dietary habits. An intervention that changes an individual&#x2019;s diet usually has only a temporary effect.</p>\n</blockquote>\n<p>Based on the data, ACE estimates that the average new veg*n lasts about 7 years, and they consider this an important factor affecting the cost-effectiveness of interventions to promote veg*nism. &#xA0;But I&apos;d submit that veg*n recidivism is actually even more important than ACE realizes.</p>\n<p><strong>EDIT</strong>: I highly recommend <a href=\"/ea/ke/vegn_recidivism_seems_important_tractable_and/4a2\">this comment</a> to read along with the rest of this post.</p>\n<p>&#xA0;</p>\n<h3>Shifting the net growth rate of the veg*n movement</h3>\n<p>If a quantity is growing exponentially, the rate of growth is much more important in the long run than the quantity&apos;s current value. &#xA0;A veg*n movement that constitutes 1% of the population and reliably doubles in size every 2 years will quickly surpass a veg*n movement that constitutes 10% of the population and reliably doubles in size every 20 years.</p>\n<p>Exponential growth seems like a good way to think about the growth of the veg*n movement because the growth rate of the veg*n movement is related in an important way to the movement&apos;s current size. &#xA0;A larger movement means more word of mouth and more resources to plow back in to movement growth, creating a positive feedback loop. &#xA0;And indeed, Google searches for the term &quot;<a href=\"https://www.google.com/trends/explore#q=vegan\">vegan</a>&quot; seem to be on a rough exponential trend, having doubled in the past 4-5 years.</p>\n<p>Exponential growth gets harder and harder to sustain the more you grow, and I think it&apos;d be wishful thinking to say that the current exponential trend will continue forever. &#xA0;The animal rights movement has been around for decades and the vast majority of the population is still omnivorous. &#xA0;But the exponential model is still a powerful way to think about veg*n movement growth.</p>\n<p>Based on the exponential model, it makes sense to pay less attention to the current size of the veg*n movement and more attention to the net rate of growth in the veg*n movement. &#xA0;And there are two factors affecting that rate of growth: the rate at which people come in, and the rate at which people leave.</p>\n<p>The rate at which people come in roughly corresponds to the quality of veg*n messaging. &#xA0;Throwing your resources behind a message that converts at a higher rate means a higher rate of growth regardless of how many resources you have. &#xA0;Fortunately for veg*ns, organizations like <a href=\"http://www.animalcharityevaluators.org/research/organizations/the-humane-league-review/\">The Humane League</a>&#xA0;systematically test different messaging strategies to see which work best. &#xA0;(But note that more aggressive veg*n marketing strategies may backfire in the long run if they turn some people off of veg*nism and make it so exponential growth tops off sooner.)</p>\n<p>On the other hand, many fewer people seem to be working on the other factor that effects the net growth rate of the veg*n movement: the rate at which people leave. &#xA0;And there are independent reasons to believe this number is more important. &#xA0;Sam Altman, president of Y Combinator, <a href=\"https://twitter.com/sama/status/608327459252150274\">writes</a>&#xA0;on Twitter:</p>\n<blockquote>\n<p>a much better metric than growth rate for early-stage startup success is how much users love the product. &#xA0;but it&apos;s much harder to measure.</p>\n<p>they eventually converge, but it often takes years.</p>\n<p>in the mean time, lazy investors use growth rate as a proxy for product love, but often get tricked by growth hackers.</p>\n<p>the best investors dig in and figure out the answer to the first-order question.</p>\n</blockquote>\n<p>To someone like Sam, the current veg*n movement might look like a startup that has a bunch of talented growth hackers but an uninspired product. &#xA0;Most users abandon it. &#xA0;In fact, it&apos;s even true that the <a href=\"https://www.psychologytoday.com/blog/animals-and-us/201109/why-are-there-so-few-vegetarians\">majority</a> of self-described &quot;vegetarians&quot; eat meat.</p>\n<p>&#xA0;</p>\n<h3>Why is veg*n recidivism so high, and what can be done to decrease it?</h3>\n<blockquote>\n<p>Why do most vegetarians go back to eating meat? According to data collected by Hal Herzog the major reasons are, in order of frequency, declining health, hassles and social stigma, irresistible urges and shifts in moral thinking. Interestingly only 2/77 reported shifts in moral thinking made them go back to eating meat. This jives with what I&#x2019;ve read about former vegans. From the small sample of ex-vegans interviews I&#x2019;ve read, most seem to experience cravings or health problems and then rationalize their choices with changes in moral ideology.</p>\n</blockquote>\n<p>From <a href=\"http://sentientist.org/2013/06/15/oystersmusselspt2/\">here</a>. &#xA0;Animal Charity Evaluators <a href=\"http://www.animalcharityevaluators.org/research/foundational-research/social-movements-project/animal-activism-case-study/\">writes</a>:</p>\n<blockquote>\n<p>It was also found that half of all veg*ns replaced meat with more vegetables, where legumes and grains would be a better choice nutritionally.</p>\n</blockquote>\n<p>So it seems that the veg*n movement is not doing a very good job of helping veg*ns get all the nutrients they need in the absence of animal products.</p>\n<p>To delve in to this question further, it might be interesting to try to understand whether veg*n recidivism is higher in areas that have more veg*n food options (likely confounded with the number of veg*ns living in an area and providing social support).</p>\n<p>How might the veg*n movement work to reduce recidivism? &#xA0;These <a href=\"http://sentientist.org/2013/05/20/the-ethical-case-for-eating-oysters-and-mussels/\">blog</a> <a href=\"http://sentientist.org/2013/06/15/oystersmusselspt2/\">posts</a> on the ethics of eating oysters and mussels seems like a good step. &#xA0;Educating veg*ns on how to get nutrients like creatine and choline that are mostly found in animal products could be valuable. &#xA0;There might also be value in copying elements of traditional, and therefore proven, vegetarian and pescetarian diets.</p>\n<p>Why has the veg*n movement neglected recidivism thus far? &#xA0;Note that many veg*ns insist that maintaining a veg*n diet doesn&apos;t require much ongoing effort. &#xA0;I think the evidence shows pretty definitively that there&apos;s a large segment of the population that finds it difficult. &#xA0;So perhaps veg*ns are self-selected to find veg*nism easy.</p>\n<p>Veg*n recidivists leave the veg*n movement, leading to them being underrepresented in the movement&apos;s decisionmaking. &#xA0;The leadership of the veg*n movement is thus made up entirely of non-recidivists.</p>\n<p>&#xA0;</p>\n<h3>Conclusion</h3>\n<p>As you might have guessed, veg*nism advocacy isn&apos;t my current guess for the best cause and I don&apos;t restrict my diet. &#xA0;(I won&apos;t get in to details on this because I&apos;d prefer to keep the discussion focused.) &#xA0;But I know I appreciate people providing informed, thoughtful <a href=\"http://www.overcomingbias.com/2015/01/show-outside-critics.html\">outside</a> <a href=\"/ea/df/the_outside_critics_of_effective_altruism/\">criticism</a> of the causes I support, and I guessed many veg*n Effective Altruists feel the same way, so that&apos;s what I tried to do for them. &#xA0;Even though I don&apos;t think veg*n advocacy is the best cause, being veg*n seems admirable from my perspective and I thank veg*ns for their commitment to sentient life.</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "xccf"}}, {"_id": "b8gmF2jbeeC3KPXLq", "title": "Meetup : July Munich Meetup", "postedAt": "2015-06-27T18:35:53.909Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/2x\">July Munich Meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>04 July 2015 02:00:00PM (+0200)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>48&#xB0;09&apos;54.6&quot;N 11&#xB0;33&apos;07.2&quot;E</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>(See also Facebook event in <a href=\"https://www.facebook.com/groups/702982546486730/\">https://www.facebook.com/groups/702982546486730/</a>)</p>\n\n<p>The Munich Effective Altruism group is having its first regular meetup! On Saturday, July 4, we&apos;ll meet for an introductory picnic in case of good weather, and for lunch in a caf&#xE9; otherwise. If you bring food (anything vegetarian/vegan is a safe bet) or a blanket, you&apos;re awesome.</p>\n\n<p>The idea is to hear other effective altruists&apos; stories, discuss what we would like future meetups to be like, define responsibilities, and chat about everything effective altruism. Bring your own ideas! :) It goes without saying that newcomers are very welcome.</p>\n\n<p>I&apos;ll bring my copy of Singer&apos;s &quot;The Most Good You Can Do&quot;, which I hope I will have read by then.</p>\n\n<p>Time and date: 2 pm, July 4, probably until 4 pm or so\nGood weather location: Olympiapark, 48.166538, 11.551907, near the top of the hill. <a href=\"https://goo.gl/yQ5fg8\">https://goo.gl/yQ5fg8</a> To make it easier to find, I&apos;ll also be at the Tollwood main entrance, Spiridon-Louis-Ring, at 1:55 pm\nBad weather location: Caf&#xE9; Puck, T&#xFC;rkenstra&#xDF;e 33</p>\n\n<p>If you&apos;re unsure where we are, you can reach me via the number given in the Facebook event.</p>\n\n<p>See you there! :D</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/2x\">July Munich Meetup</a></h2></body></html>", "user": {"username": "cadac"}}, {"_id": "T8JqFbGoFSfET39CW", "title": "Giving What We Can needs your support — only 5 days left to close our funding gap", "postedAt": "2015-06-25T16:26:31.611Z", "htmlBody": "<html><body><div><img src=\"https://givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/gwwc_fundraising_five_days.jpg\" alt=\"\"><br></div>\n<div><br></div>\n<div>Edit: Thanks to the generosity of our donors, the matching funding has now been used, and we&apos;ve reached our target!</div>\n<div><br></div>\n<div><span>With just a couple of days to go of our <a href=\"https://givingwhatwecan.org/fundraising-2015?utm_campaign=fundraising_2015&amp;utm_source=eaforum&amp;utm_medium=referral\">spring fundraiser</a></span><span>, we are still <a href=\"http://givingwhatwecan.causevox.com/\">&#xA3;40,000 off our target</a></span><span>. We really need your help to help us reach our goal, so that we can make concrete plans for our future, and go back to our main job &#x2014; getting more people to take the pledge to give.</span></div>\n<div><span><br></span></div>\n<div>\n<p>You can still double the effect of your donation &#x2014;there is still &#xA3;10,000 of matching funding for new donors &#x2013; but it has to be before July!<span>&#xA0;</span></p>\n<p><span><br></span></p>\n<p>Over 2014 our membership doubled. Over 2015, using the money we&apos;re currently trying to raise, we aim to double again. We plan to do this by focusing on chapter growth and by capitalising on the media attention around Effective Altruism over the summer, to make sure that it results in concrete impact.</p>\n<p>&#xA0;</p>\n<p><span>It&#x2019;s pretty amazing how much we can each do&#xA0;individually&#xA0;</span><span>by donating 10% of our incomes to the most effective causes. <a href=\"https://www.givingwhatwecan.org/get-involved/how-rich-am-i?country=USA&amp;income=32140&amp;adults=1&amp;children=0&amp;utm_campaign=fundraising_2015&amp;utm_source=eaforum&amp;utm_medium=referral\">Someone on the median US wage could save a person&apos;s life</a></span><a href=\"https://www.givingwhatwecan.org/get-involved/how-rich-am-i?country=USA&amp;income=32140&amp;adults=1&amp;children=0&amp;utm_campaign=fundraising_2015&amp;utm_source=eaforum&amp;utm_medium=referral\"><span>&#xA0;</span><em>every year</em></a><span>!</span><span>&#xA0;But if we could make it the norm in the developing world, we really could <a href=\"http://www.gordoni.com/thoughts/wwit.html\">end extreme poverty</a></span><span>&#xA0;around the world. Hopefully this summer will be the start of making that happen!</span></p>\n</div></body></html>", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "Ce4pHskhve8XKua7P", "title": "Revamping Existing Charities", "postedAt": "2015-06-23T22:30:01.726Z", "htmlBody": "<html><body><p>I&apos;m curious to know if anyone has put thought or time into improving/overhauling existing charities from an EA perspective. Has there been much thought or discussion put into the idea of making existing charities more effective?</p>\n<p>There are lots of organizations out there that contract for nonprofits to make their marketing or fundraising more effective, but has anyone contemplated creating a consulting organization that would work with organizations within an EA framework? This seems to be not just a potentially large opportunity to effect change but a really big empty space that no one is working in.</p>\n<p>&#xA0;</p>\n<p>There are of course a few potential pitfalls. It is hard to instigate change anywhere, but particularly in organizations that believe they are doing good work, or organizations that have been around for a long time. This bias against change would be a hard one to overcome, but I think EAs have gotten particularly good at asking very pointed questions about doing great charity work. This insight could be a huge resource for groups that truly want to improve.</p>\n<p>&#xA0;</p>\n<p>I&apos;ve thought about this myself quite frequently and would be stoked to hear thoughts from others.</p></body></html>", "user": {"username": "SydMartin"}}, {"_id": "jqvSYeSWQ7HhLDaoD", "title": "Opportunity to talk to Against Malaria Foundation founder Rob Mather", "postedAt": "2015-06-22T17:52:54.351Z", "htmlBody": "<html><body><p><img src=\"https://givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/RobMatherAMF.png\" alt=\"\"></p>\n<p>Rob Mather from the <a href=\"http://againstmalaria.com\">Against Malaria Foundation</a> (one of <a href=\"https://www.givingwhatwecan.org/top-charities/against-malaria-foundation\">Giving What We Can</a>/<a href=\"http://www.givewell.org/charities/top-charities\">GiveWell&apos;s</a> top charities) has kindly offered to take some time to chat to supporters over Skype. The format will be a Skype conversation of around 1-2 hours, where participants will have the opportunity to ask Rob questions and discuss ideas relating to AMF&apos;s work and related topics (e.g. the process of starting an effective charity, challenges AMF has faced, next steps etc).</p>\n<p>The conversation is scheduled for <strong>Thursday July 2nd, at 5:30PM/1730 London time</strong> (<a href=\"http://www.timeanddate.com/worldclock/fixedtime.html?iso=20150702T1630\">see this page to find your local time</a>).</p>\n<p>If you would like to take part, please get in touch with me (Sam) at <a href=\"https://givingwhatwecan.org\">Giving What We Can</a> (<em>sam [dot] deere [at] givingwhatwecan.org</em>). <strong>Spaces are very limited, so please get in touch ASAP to secure a spot!</strong></p>\n<p>If you can&apos;t make it along, but would still like to ask a question, please also feel free to submit it to me by email (as above) or post it as a comment below.</p>\n<p>Cheers<br>Sam</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "SamDeere"}}, {"_id": "FPDzJjHo75cGjcZRY", "title": "The career questions thread", "postedAt": "2015-06-20T02:19:07.131Z", "htmlBody": "<html><body><p>Hi everyone,</p>\n<p>I&apos;m Ben from 80,000 Hours. We do careers advice for effective altruists.</p>\n<p>If you have any questions about your career, please post them here and I&apos;ll do my best to answer them.</p>\n<p>In the meantime, you can check out our online career guide: 80000hours.org</p>\n<p>Ben</p>\n<p>&#xA0;</p>\n<p>PS Feel free to ask whatever&apos;s most pressing to you - don&apos;t worry about whether it&apos;s relevant to other readers or not.</p>\n<p>&#xA0;</p>\n<p><strong>Update Jan 2016: We&apos;re no longer checking this thread for new questions!</strong></p>\n<p><strong>Please ask on our Linkedin group instead:&#xA0;https://www.linkedin.com/groups/5057625</strong></p></body></html>", "user": {"username": "Benjamin_Todd"}}, {"_id": "vGbbrTrtccPbcu7gP", "title": "Collective Action and Individual Impact, Part II", "postedAt": "2015-06-19T13:11:37.358Z", "htmlBody": "<html><body><p>Cross posted at zachgroff.com</p>\n<p><span>In my last long post, I argued that if we can greatly help a promising collective action, we are obligated to do so. I did not argue that any particular protest has or will be effective, although I offered a few illustrative examples. I thank Carl Shulman and Ben Kuhn for their helpful responses to my original post. In this post, I would like to argue that the habit of supporting social movements is a good one to have and offer a few examples.<br> <br> To start, let&apos;s consider a few problems where protesting could likely make a difference. It seems to me protests rely on having a problem that is fairly concrete and direct, with an identifiable institution at fault. Poverty in developing countries strikes me as lacking in a clear target for a protest, and existential risk strikes me as too abstract and, again, lacking in a clear target.<br> <br> These are problems that severely affect large numbers of people and are at least somewhat tractable:<br> <br> -Mass incarceration<br> -Climate change<br> -Global institutional reform relevant to poverty<br> -Immigration and open borders<br> -Animal agriculture<br> <br> Now let&apos;s look at the costs and benefits of participating in a protest. Carl Shulman writes, &quot;But to be convincing you have to actually show your work that the returns on protesting really are competitive with the opportunity cost of time (e.g. earning and donating some money, studying to advance your career and ability to get things done, doing malaria research, resting up after all of the above).&quot;<br> <br> Though time is approximately fungible, it seems likely that people sort their time,</span><span>&#xA0;</span><span><a href=\"http://faculty.chicagobooth.edu/Richard.Thaler/research/pdf/MentalAccounting.pdf\"><span>like money</span></a>, into budget categories. Given that, we must ask which category protesting is likely to come out of. It seems unlikely it would come out of one&apos;s job and more likely to&#xA0;come out of either resting up or self-improvement.<br> <br> A basic economic approach would value leisure time at the amount one could earn in that time, but going to a protest doesn&apos;t obliterate leisure time - it simply replaces the alternative activity with going to a protest. This will be costlier for some people than for others. If marching is a chore, this cost could approach or even surpass the</span><span> </span><span>forgone earnings, but if marching is energizing, or even just benign, the cost could be fairly low. The cost will also, of course, depend on how important your being well-rested is - getting less sleep to march in a protest would be quite costly for a life-saving surgeon.<br> <br> To get more specific, again quoting Carl Shulman, &quot;If the tens of millions of person-hours spent on the protests were spent at minimum wage jobs and the proceeds donated, then tens of thousands of African lives would have been saved; if one can earn higher wages or contribute in other scarce ways, the opportunity&#xA0;cost will be larger still.&quot;<br> <br> I assume he is going with</span><span>&#xA0;</span><span><a href=\"http://www.givewell.org/international/top-charities/AMF#Costperlifesaved\"><span>GiveWell&apos;s estimate</span></a></span><span>&#xA0;</span><span>that $3,340 given to the Against Malaria Foundation can, on expectation, save one life. 300,000 people at, say, the People&apos;s Climate March, had they spent five hours at a minimum wage job instead of marching would have earned enough to save about 3,000 lives. As stated above, I don&apos;t think that working is the relevant alternative - protesting would most likely detract from mentally allotted leisure time. Still, even if leisure time is worth 1/10th the amount of time that work time is (and the people marching work minimum wage jobs on average), that march had an opportunity cost of 300 lives that could have been saved, a pretty hefty opportunity cost.<br> <br> How unfavorable is this comparison? Well let&apos;s turn to the benefits.<br> <br> The benefits of any one action are far more diffuse and less measurable than the sort of interventions effectiveness-minded people like to favor. Clearly, the benefits will vary greatly by protest. Each year there are many, many protests with little effect. As someone who grew up outside of Washington, D.C., I can report that every time I visited the White House, I saw a protest outside for a cause that would likely be forgotten.<br> <br> Yet every so often there is a protest with a profound effect. I cited the People&apos;s Climate March in my original post, and that protest, which appeared on</span><span>&#xA0;</span><span><a href=\"http://www.nytimes.com/2014/09/22/nyregion/new-york-city-climate-change-march.html\"><span>the front page of the New York Times</span></a>, seems to have catalyzed one of the liveliest student protest movements in years, which has kept climate change in headlines across the country and perhaps led to Senate Democrats&apos;</span><span>&#xA0;</span><span><a href=\"http://www.nytimes.com/2014/11/19/us/politics/keystone-xl-pipeline.html\"><span>scuttling of a bill to approve the Keystone XL pipeline</span></a>.<br> <br> Meanwhile, the Black Lives Matter marches have made</span><span>&#xA0;</span><span><a href=\"http://www.huffingtonpost.com/cory-booker/our-criminal-legal-system_b_7071792.html\"><span>racism in the criminal justice system</span></a></span><span>&#xA0;</span><span>one of the principal political issues of 2015, and while police in the U.S. kill 1,000 people each year, the U.S. prison population numbers above 2,000,000, which is significant considering the potential tractability of the problem and the misery of being imprisoned, is a worthwhile problem.<br> <br> But beyond this anecdotal evidence, there is a fairly strong scholarly consensus that protests work, spanning</span><span>&#xA0;</span><span><a href=\"http://www.washingtonpost.com/blogs/monkey-cage/wp/2014/08/25/americans-dont-like-protests-but-protests-may-work-anyway/\"><span>political science</span></a>,</span><span>&#xA0;</span><span><a href=\"http://www.amazon.com/Power-Movement-Movements-Contentious-Comparative/dp/052115572X\"><span>history</span></a>, and</span><span>&#xA0;</span><span><a href=\"http://www.hks.harvard.edu/fs/dyanagi/Research/TeaParty_Protests.pdf\"><span>economics</span></a>. Specifically, political scientists&apos; estimates of the effectiveness of nonviolent protest movements range from</span><span>&#xA0;</span><span><a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2374098\"><span>37%</span></a></span><span>&#xA0;</span><span>to</span><span>&#xA0;</span><span><a href=\"http://moreintelligentlife.com/blog/john-paul-omalley/qa-steven-pinker-psychologist\"><span>75%</span></a></span><span>&#xA0;</span><span>of such movements achieving their goals.</span></p>\n<p><span>&#xA0;</span></p>\n<p><span>&#xA0;</span></p>\n<p><span>Of course, that protest movements work does not tell us how well they work, which is what we need to compare participation in them to the alternative.</span><span>&#xA0;</span><span><a href=\"http://www.hks.harvard.edu/fs/dyanagi/Research/TeaParty_Protests.pdf\"><span>A highly rigorous study</span></a></span><span>&#xA0;</span><span>of the Tea Party movement estimated that an additional protester at a Tea Party rally produced 12 extra votes for the Republican party (the question of whether voting matters may be the subject of a later blog post). There aren&apos;t many other estimates like this in the literature.<br> <br> There are many reasons the Tea Party estimate might be an over-estimate for a standard protest, even more so a large one. For one, the Tea Party protests were fairly small, so an additional person likely yielded larger returns. For two, there&apos;s a case to be made that the Tea Party protests happened at a favorable time politically with the pendulum swinging back from extremely large expectations for the incoming President.<br> <br> So let&apos;s take that estimate and divide it by 10. Suppose each person at the People&apos;s Climate March produced an extra 1.2 votes in favor of climate action. That&apos;s 360,000 extra votes for climate action. Some very rudimentary back-of-the-envelope math using</span><span>&#xA0;</span><span><a href=\"http://www.stat.columbia.edu/~gelman/research/published/probdecisive2.pdf\"><span>estimates by Nate Silver</span></a></span><span>&#xA0;</span><span>of the chance that a vote swings an election yields an estimate of a .6% chance of swinging a Presidential election. If swinging the election improves the chance of climate action by 50%, then this march would increase the chance of climate action by .3%. Now if we use as a ballpark estimate the</span><span>&#xA0;</span><span><a href=\"http://www.robertstavinsblog.org/2014/06/19/what-are-the-benefits-and-costs-of-epas-proposed-co2-regulation/\"><span>EPA&apos;s estimated net global benefits</span></a></span><span>&#xA0;</span><span>of climate regulations ($67 billion), this march would, on expectation, yield an expected $201 million in benefits - enough to save 60,000 lives.<br> <br> Many of my assumptions may have inflated this estimate - chiefly, the assumption that the likelihood of each vote swinging the election is independent. I also based each person&apos;s wage on the minimum wage - clearly many people will earn several times the minimum wage. On the other hand, one could argue that I made a conservative estimate of individual impact, and that I assigned to each marcher the average likelihood of swinging an election, which should underestimate the impact since marchers who are from swing states have a higher chance of swinging the election by an order of magnitude. If the march had 1/200th the impact, it would still outweigh the opportunity cost.<br> <br> There are some further problems, though. We just looked at aggregate or average impact, rather than marginal impact. It is likely that the 300,000th marcher does not have a marginal impact equal to the average impact. The relationship between marginal impact and number of marchers is quite unclear. It seems most likely to me that marginal impact would have an S-shape: protesting by yourself or with a few of your buddies likely has very little impact because of the strength (or weakness) in numbers. An additional person would probably do much more good for a small- or medium-sized march.</span></p>\n<p><span><br> Given this, it seems to me to be roughly a toss up that the average person in the People&apos;s Climate March would have much of an expected impact, let alone a high-impact person with potential for higher wages and other factors. But this march was likely not all that high on the effectiveness scale. For a medium-sized march around a potentially higher-impact issue like, say, open borders or animal agriculture, it seems plausible to me that attendance at a march would be high-impact. Given that we are habit-forming creatures, I think an effective person ought to make a habit of showing support for small- to medium-sized protests around highly important causes.<br> <br> The case is stronger as one moves higher up on the collective action ladder. Organizing a protest, or helping to organize one, can mean getting many more people out. The opportunity cost is of course larger as well, but turning out a large enough number of people with a fraction of your effectiveness can create a multiplier effect. People within the effective altruism movement have pushed for more</span><span>&#xA0;</span><span><a href=\"http://lesswrong.com/lw/jyz/effective_effective_altruism_fundraising_and/\"><span>movement-building</span></a></span><span>&#xA0;</span><span>and</span><span>&#xA0;</span><span><a href=\"https://80000hours.org/career-guide/strategy/strategies/advocacy/\"><span>advocacy</span></a></span><span>&#xA0;</span><span>for their multiplier effects. There are possible (and promising) alternative proposals to political protests - pledge parties to pledge to donate 10% of one&apos;s income with</span><span>&#xA0;</span><span><a href=\"https://www.givingwhatwecan.org/\"><span>Giving What We Can</span></a>, for instance - but these seem better for consolidating and utilizing a community than building one. There is something about the raw emotional effect of being part of a crowd united around a cause that</span><span>&#xA0;</span><span><a href=\"http://www.surrey.ac.uk/politics/research/researchareasofstaff/isppsummeracademy/instructors/Social%20Psychology%20of%20Protest,%20Van%20Stekelenburg%20%26%20Klandermans.pdf\"><span>can change people</span></a></span><span>&#xA0;</span><span>in a way more coolheaded activities cannot. Scholars who have studied protest movements</span><span>&#xA0;</span><span><a href=\"http://www.hks.harvard.edu/fs/dyanagi/Research/TeaParty_Protests.pdf\"><span>speculate</span></a></span><span>&#xA0;</span><span>that this psychological effect is what helps generate and sustain activists.Again, whether I can have a big impact by organizing collective action depends quite a bit on my own attributes. But given that</span><span>&#xA0;</span><span><a href=\"http://www.theatlantic.com/international/archive/2014/04/why-street-protests-dont-work/360264/\"><span>one of the most vital ingredients</span></a></span><span>&#xA0;</span><span>in a protest is the structure that transforms it from an event into a movement, if I have this ability, I could be doing significant damage by sitting out.<br> <br> At the end of the day, the question of collective action and its importance comes down to the question of</span><span>&#xA0;</span><span><a href=\"https://en.wikipedia.org/wiki/Emergence\"><span>emergence</span></a>. Many world-changing events have been caused by masses acting together. Few world-changing events have been caused by individuals acting alone. We are individuals, and we cannot directly control anyone but ourselves. But when we look only at the visible results of individual actions, we miss the more diffuse effects our actions have on those around us - the way our actions spread and shape social norms. When you look at the effects of people acting together, though, mass political action may be more effective from a rationalist perspective than it seems at first.</span></p>\n<p><!--[if gte mso 9]><xml> <o:OfficeDocumentSettings> <o:AllowPNG /> </o:OfficeDocumentSettings> </xml><![endif]--><!--[if gte mso 9]><xml> <w:WordDocument> <w:Zoom>0</w:Zoom> <w:TrackMoves>false</w:TrackMoves> <w:TrackFormatting /> <w:PunctuationKerning /> <w:DrawingGridHorizontalSpacing>18 pt</w:DrawingGridHorizontalSpacing> <w:DrawingGridVerticalSpacing>18 pt</w:DrawingGridVerticalSpacing> <w:DisplayHorizontalDrawingGridEvery>0</w:DisplayHorizontalDrawingGridEvery> <w:DisplayVerticalDrawingGridEvery>0</w:DisplayVerticalDrawingGridEvery> <w:ValidateAgainstSchemas /> <w:SaveIfXMLInvalid>false</w:SaveIfXMLInvalid> <w:IgnoreMixedContent>false</w:IgnoreMixedContent> <w:AlwaysShowPlaceholderText>false</w:AlwaysShowPlaceholderText> <w:Compatibility> <w:BreakWrappedTables /> <w:DontGrowAutofit /> <w:DontAutofitConstrainedTables /> <w:DontVertAlignInTxbx /> </w:Compatibility> </w:WordDocument> </xml><![endif]--><!--[if gte mso 9]><xml> <w:LatentStyles DefLockedState=\"false\" LatentStyleCount=\"276\"> </w:LatentStyles> </xml><![endif]--> <!--[if gte mso 10]> <mce:style><! /* Style Definitions */ table.MsoNormalTable {mso-style-name:\"Table Normal\"; mso-tstyle-rowband-size:0; mso-tstyle-colband-size:0; mso-style-noshow:yes; mso-style-parent:\"\"; mso-padding-alt:0in 5.4pt 0in 5.4pt; mso-para-margin:0in; mso-para-margin-bottom:.0001pt; mso-pagination:widow-orphan; font-size:12.0pt; font-family:\"Times New Roman\"; mso-ascii-font-family:Cambria; mso-ascii-theme-font:minor-latin; mso-fareast-font-family:\"Times New Roman\"; mso-fareast-theme-font:minor-fareast; mso-hansi-font-family:Cambria; mso-hansi-theme-font:minor-latin;} --> <!--[endif] --> <!--StartFragment--> <!--EndFragment--></p>\n<p><span>&#xA0;</span></p>\n<p>&#xA0;</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "zdgroff"}}, {"_id": "5myr8o8XoLFg3H2hb", "title": "Effective Altruism Policy Analytics, cooperative documents and feedback", "postedAt": "2015-06-18T16:07:22.694Z", "htmlBody": "<html><body><p>For those who haven&apos;t seen already, <a href=\"https://impact.hackpad.com/Effective-Altruism-Policy-Analytics-hsRGwslz4wC#:h=Description\">Effective Altruism Policy Analytics</a>&#xA0;made its&#xA0;first post&#xA0;<a href=\"/ea/jv/introducing_effective_altruism_policy_analytics/\">last week</a> and will still be looking for more assistance going forward.&#xA0;<br><br>We are looking for help in:</p>\n<ul>\n<li>Finding <a href=\"https://eapolicy.wordpress.com/contribute/\">experts</a></li>\n<li>Making <a href=\"https://docs.google.com/document/d/16ZQdCp97LDw2Yh89gK430WQ3Ws_abWrFzvZB5uTrkAY/edit?usp=sharing\">policy comments</a></li>\n<li>Getting feedback</li>\n<li>Logo design</li>\n<li>Building a website</li>\n<li>Searching <a href=\"http://www.regulations.gov/#!home;tab=browse\">regulations.gov</a></li>\n</ul>\n<p><br>If you are interested, or know an expert who is interested, use this <a href=\"https://docs.google.com/a/terpmail.umd.edu/forms/d/1pZ1MYu62REaVZxKEqpSaIEAmrEaI9qB9rA-LoOeUrFs/viewform\">form</a>&#xA0;to join our network, or send an email to <a href=\"mailto:effectivealtruismatumd@gmail.com\">effectivealtruismatumd@gmail.com</a> with &quot;EAPA&quot; in the subject line followed by what you are interested in helping with.&#xA0;<br><br>The sheet linked&#xA0;<a href=\"https://docs.google.com/spreadsheets/d/1Yfn1sl39k2AulZjwVF8yIT0Ar2i4ULKsqGDMWPENE4U/edit?pli=1#gid=0\">here</a>&#xA0;contains regulations we have looked at, as well as one column that can be edited by viewers and experts who would like to sign up to help with a comment.&#xA0;Each row contains a notice of a proposed rule or a final rule, its comment expiration date, and some short notes. Yellow rows are under consideration or comment construction, green rows have been submitted, gray rows have expired or are no longer being considered at all, and white rows have not been thoroughly investigated yet.&#xA0;<br><br>We will try to post frequently to our <a href=\"https://eapolicy.wordpress.com/\">blog</a>&#xA0;and would like as much feedback as possible about our work. If you do not have a WordPress account, you can still leave us feedback on this forum, or in the comments section of our .impact <a href=\"https://impact.hackpad.com/Effective-Altruism-Policy-Analytics-hsRGwslz4wC#:h=Comments\">page</a>.<br></p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Gentzel"}}, {"_id": "6uTW66KcfM5Ez4bPu", "title": "2015 Summer Welcome Thread", "postedAt": "2015-06-16T20:29:36.185Z", "htmlBody": "<html><body><p>This is the welcome thread for summer 2015, in particular anticipating newcomers exposed to effective altruism through the books <em><a href=\"http://www.mostgoodyoucando.com/\">The Most Good You Can Do</a>, </em>by Peter Singer, and <em><a href=\"http://www.amazon.ca/Doing-Good-Better-Effective-Difference/dp/1592409105\">Doing Good Better</a>, </em>by William MacAskill, and the free and open online <a href=\"https://www.coursera.org/learn/altruism\">course on effective altruism</a>&#xA0;being taught by Peter Singer this summer.&#xA0;<br><br>If you&apos;re new to effective altruism, or even just this forum, please feel free to introduce yourself. You can get a basic overview of effective altruism <a href=\"http://www.effectivealtruism.org/about-ea/\">at this website here</a>. To dive in deeper in learning about effective altruism, check out <a href=\"http://www.effective-altruism.com/ea/6x/introduction_to_effective_altruism/\">our introduction</a>.&#xA0;<br></p></body></html>", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "GsmF23mjn6t3tMSPE", "title": "[Announcement] The Effective Altruism Course on Coursera is Now Open", "postedAt": "2015-06-16T20:20:00.044Z", "htmlBody": "<html><body><p>The free,&#xA0;<a href=\"https://www.coursera.org/learn/altruism \">online course on Effective Altruism</a>, on Coursera, and taught by&#xA0;<a href=\"https://en.wikipedia.org/wiki/Peter_Singer\">Peter Singer</a>, professor of philosophy and bioethics at Princeton University has now opened. Enrollment is open to anyone and everyone, and is free. The course was slated to start in May, but was delayed for a few weeks for whatever reason. This is a reminder for anyone to sign up, or start the coursework, lest they forgot about it in the interim. This course follows the recent release of Dr. Singer&apos;s latest book,&#xA0;<em><a href=\"http://www.mostgoodyoucando.com/\">The Most Good You Can Do</a>,&#xA0;</em>written on the topic of effective altruism.</p>\n<p>If you know anyone who is interested in ethics or effective altruism, whether they be college students or not, this course may be a good way to introduce friends to the philosophy and the movement. If you host local meetups for effective altruism, consider planning them around discussing what comes up in the course.</p>\n<p><br>From the course description:</p>\n<blockquote>\n<p><span>Effective altruism is built on the simple but unsettling idea that living a fully ethical life involves doing the most good one can. In this course you will examine this idea&apos;s philosophical underpinnings; meet remarkable people who have restructured their lives in accordance with it; and think about how effective altruism can be put into practice in your own life. </span></p>\n</blockquote></body></html>", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "6SsGAunuDYTntRHKS", "title": "Impact purchase round 3", "postedAt": "2015-06-16T17:16:12.858Z", "htmlBody": "<html><body><p>In round 3 of the <a href=\"http://impactpurchase.org/\">impact purchase</a>, $2600 of certificates were purchased from sellers (and $700 of certificates were repurchased from the impact purchase organizers). Thanks to Larks and Owen Cotton-Barratt, who also purchased certificates this round.</p>\n<p>The deadline for round 4 is June 25. If you are interested in selling, apply <a href=\"https://docs.google.com/forms/d/1D1PlHNi_7ya9iI1StsR5vSraDvcjTFk-fk-DIUYFtu4/viewform\">here</a> (any kind of submission is welcome, and you are free to opt out of public scrutiny). If you have questions, feel free to <a href=\"mailto:contact@impactpurchase.org\">get in touch</a> or leave a comment here.</p>\n<p>The transactions:</p>\n<ul>\n<li> We purchased another 1/70th of Ryan Carey and Brayden McLean&apos;s organization of EA Melbourne for $1700 (a price of $119k for the whole thing, significantly higher than in the last round). This money was our $1000 budget plus the $700 we received by reselling old certificates. </li>\n<li> Larks purchased 9.9% of Oliver Habryka&apos;s organization of wrap parties, paying us $300 and Oliver $700 (a price of around $10k, somewhat less than we paid) </li>\n<li> Owen purchased 1/3 of Ben Kuhn&apos;s donation matching blog post from us for $400 (a price of $1.2k, exactly what we originally paid) </li>\n<li> Owen purchased 0.4% of EA Melbourne for $200 (a price of $50k, much less than what we are paying) </li>\n</ul>\n<p>We&apos;re going to experiment with starting a comment thread here for each project that was submitted to the impact purchase (where we had permission to start a thread). We&apos;ll use these threads to keep track of transactions, and to discuss our evaluations. We invite discussion of the projects, criticism of the evaluations and our decisions, offers to purchase certificates or sell similar certificates, questions, etc.</p>\n<p>If you might be interested in purchasing certificates, please send us <a href=\"mailto:contact@impactpurchase.org\">an email</a> or leave a comment. We can&apos;t really make money (our counterparties always receive all of the gains from trade), but we&apos;d love to see a more liquid market for impact in general.</p></body></html>", "user": {"username": "Paul_Christiano"}}, {"_id": "EwGRzxJQpoeirPs56", "title": "Introducing Effective Altruism Policy Analytics: Request for help and expert consultation", "postedAt": "2015-06-12T21:25:36.391Z", "htmlBody": "<html><body><p><span>In fall 2014 the Effective Altruism Society of DC and Effective Altruism at UMD started an experimental policy project attempting to bring effective altruism ideas to public policy. We produced comments for regulations on the federal register proposed by the Department of Energy and Environmental Protection Agency. By offering independent cost-benefit analysis, we hoped to provide ammunition to any regulator trying to make policy more effective. While direct feedback from agencies is pending, the </span><a href=\"http://dc-ea.com/progress-report-independent-cost-benefit-analysis-of-proposed-regulations/\"><span>expected benefits</span></a><span> were large enough to bring the project to </span><a href=\"http://www.eaventures.org/\"><span>Effective Altruism Ventures</span></a><span> for assistance in conducting a full-time experiment. &#xA0;</span></p>\n<p><span><br></span><span>On June 1, 2015, Effective Altruism Policy Analytics (EAPA) began operations, attempting to bring non-partisan, cause-neutral improvements to regulatory action in the United States. It works to determine the best practices for creating influential analysis and to turn that knowledge over to effective altruists. EAPA will offer its findings to the community and create guides and information for effective altruists interested in influencing policy. EAPA is staffed full-time by Matthew Gentzel and Emma Atlas, as well as part time by interns and a host of volunteer consultants. EAPA is still growing an even greater network of experts and volunteers interested in beneficially influencing policy. As the experiment proceeds, EAPA will gather feedback and create a foundation for the Effective Altruism movement to exert more political influence in the future.</span><span><br><br></span></p>\n<p><span><br></span><span>Who we are:</span></p>\n<p><strong><br></strong></p>\n<p><span>Matthew Gentzel</span><span> spent the first semester of his college education at the United States Air Force Academy, and then transferred to the University of Maryland to major in engineering. Matt first became interested in utilitarianism early on in college and worked on projects with Engineers Without Borders and small start-ups. Matt was introduced to Less Wrong in his junior year of college and helped found Effective Altruism at UMD in the summer before his senior year.</span><span><br><br></span></p>\n<p><span>Emma Atlas </span><span>graduated May 2015 with a Bachelor&#x2019;s in Government &amp; Politics from the University of Maryland. She worked as an intern in the Maryland General Assembly in Spring 2015 and grew an interest in creating non-partisan effective outcomes. She accepted an offer from Gentzel to help on the project, and began working on the project full-time in June.</span></p>\n<p><strong><br></strong></p>\n<p><span>Lawrence Roth</span><span> is currently an undergraduate student majoring in Criminology/Criminal Justice with a minor in Geographic Information Systems at the University of Maryland. He has experience in programming, web design, and statistics. Roth was introduced to effective altruism by Gentzel and has attended events with the Effective Altruism Society of DC. He accepted an intern position at EAPA assisting with any research needs that Atlas and Gentzel require.</span></p>\n<p><strong><br></strong></p>\n<p><span>Matthew Dahlhausen </span><span>is a graduate research assistant in the Mechanical Engineering Department at the University of Maryland and Cluster of Sustainability in the Built Environment (CITY). Matt completed an M.S. (2014) in architectural engineering from the Pennsylvania State University, and graduated cum laude from Dartmouth college with a B.S. (2011) in engineering sciences and B.E. (2011) in environmental engineering. Prior to starting his graduate studies, he served with AmeriCorps as a quality assurance manager for a residential energy retrofit program in Philadelphia. He is a member of the American Society of Heating, Refrigeration, and Air-Conditioning Engineers (ASHRAE).</span></p>\n<p><strong><br></strong></p>\n<p><span>Richard Bruns </span><span>is an economist at the Food and Drug Administration. His job is to produce economic impact analyses of regulations. Richard has worked on the gluten-free labeling rule, the trans fat ban, and the rule on intentional adulteration of food supplies. Richard has extensive knowledge of the public comment process on regulations and how the FDA responds to these public comments.</span></p>\n<p><strong><br></strong></p>\n<p><span>Why EAPA?</span></p>\n<p><strong><br></strong></p>\n<p><span>Writing policy comments could be one of the most efficient ways you can create effective political influence. Federal agencies are often required to post new or proposed regulations online for the public to review and consider, and agencies must return a response to every comment posted by the public. By reviewing policies available for comment and offering analysis when positive influence can be made, you can have a greater impact than you would just by general voting.</span></p>\n<p><strong><br></strong></p>\n<p><span>As a group focused on facilitating the voice of effective altruists in the federal register, EAPA organizes efforts around targeting the places where we can make the biggest impact. By working and communicating with us, you could become part of the growing voice of effective altruists in government.</span></p>\n<p><strong><br></strong></p>\n<p><span>How you can help:</span><span><br></span><span><br></span><span>If you are an expert and interested in consulting with us, please send your contact information and area(s) of expertise to </span><a href=\"mailto:effectivealtruismatumd@gmail.com\"><span>effectivealtruismatumd@gmail.com</span></a><span> with the subject line &#x201C;EAPA Expert Contact.&#x201D; If you know someone who may be interested, contact them for permission first, then add their contact information on </span><a href=\"https://docs.google.com/forms/d/1pZ1MYu62REaVZxKEqpSaIEAmrEaI9qB9rA-LoOeUrFs/viewform?usp=send_form\"><span>this form</span></a><span>.</span></p>\n<p><strong><br></strong></p>\n<p><span>We are currently seeking experts in: </span></p>\n<p><span><br></span></p>\n<p><span></span></p>\n<ul>\n<li>\n<p><span>Global Health</span></p>\n</li>\n<li>\n<p><span>Foreign Aid</span></p>\n</li>\n<li>\n<p><span>Urban Poverty</span></p>\n</li>\n<li>\n<p><span>Housing</span></p>\n</li>\n<li>\n<p><span>Criminal Justice</span></p>\n</li>\n<li>\n<p><span>Policing</span></p>\n</li>\n<li>\n<p><span>Juvenile Justice</span></p>\n</li>\n<li>\n<p><span>Education</span></p>\n</li>\n<li>\n<p><span>Immigration</span></p>\n</li>\n<li>\n<p><span>Free Trade and Tariffs</span></p>\n</li>\n<li>\n<p><span>Taxes</span></p>\n</li>\n<li>\n<p><span>Economics</span></p>\n</li>\n<li>\n<p><span>Impact of Biodiversity changes</span></p>\n</li>\n<li>\n<p><span>Climate Change</span></p>\n</li>\n<li>\n<p><span>Chemistry and Toxicity</span></p>\n</li>\n</ul>\n<ul>\n</ul>\n<p><span><br></span><span>We likely will be requesting more areas of expertise as we find more proposed regulations, so if you are interested but have a specialty outside those areas, feel free to send us your contact information anyway. Policy change is opportunistic, and likewise not all opportunities for cost effective change and feedback are in areas that have typically been investigated by EAs for high potential impact.</span><span><br><br></span></p>\n<p><span><span>In the future, we are looking to offer more </span><a href=\"https://docs.google.com/document/d/16ZQdCp97LDw2Yh89gK430WQ3Ws_abWrFzvZB5uTrkAY/edit?usp=sharing\"><span>in-depth training</span></a><span> in writing policy comments and building political influence for effectiveness. We would like to build a network of students and volunteers to examine the federal register and increase the probability that regulations are always efficient, cost-effective, and thoroughly researched.</span></span></p>\n<p><strong><br></strong></p>\n<p><span>Questions?</span><span><br></span><span>Go to or request to join the EA Policy Reform </span><a href=\"https://www.facebook.com/groups/450247668487258/\"><span>Facebook group</span></a><span> and send us your questions or ideas. If you want to cooperate more closely and avoid duplication of effort, send an introduction to </span><a href=\"mailto:effectivealtruismatumd@gmail.com\"><span>effectivealtruismatumd@gmail.com</span></a><span> and we will provide you access to our cooperative documents.</span></p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Gentzel"}}, {"_id": "JEyDH82yBQQad9yo3", "title": "What Got Us Here Won’t Get Us There: Failure Modes on the Way to Global Cooperation", "postedAt": "2015-06-12T19:36:19.398Z", "htmlBody": "<html><body><address>By Joao Fabiano (Oxford, Philosophy) and Diego Caleiro (UC Berkeley, Biological Anthropology)</address><address> </address><address>Crossposted at <a href=\"http://blog.practicalethics.ox.ac.uk/2015/06/what-got-us-here-wont-get-us-there/\">Oxford&apos;s Practical Ethics Blog</a></address>\n<p>&#xA0;</p>\n<p>From single-celled to pluricellular to multicellular organisms or from hunter-gatherers to the EU, the history of evolutionary forces that resulted in human society is a history where cooperation has emerged at increasingly large scales. The major life transitions and, once human, the major cultural transitions have rearranged the fitness landscape of evolving entities in ways that increased the size of the largest existing coalitions. Notwithstanding, it seems that freewheeling evoluti<a title=\"Nick Bostrom&apos;s Singleton paper\" href=\"http://www.nickbostrom.com/fut/singleton.html\"><img src=\"https://blog.practicalethics.ox.ac.uk/wp-content/uploads/2015/06/16149408586_921e9df16b_o.jpg\" alt=\"\"></a>on will not lead to <a title=\"Ingmar Persson &amp; Julian Savulescu&apos;s Unfit for the Future\" href=\"http://www.oxfordscholarship.com/view/10.1093/acprof:oso/9780199653645.001.0001/acprof-9780199653645\"> satisfactory levels of global human cooperation in time to prevent severe risks </a> . Nor <a title=\"Nick Bostrom&apos;s Future of Evolution paper\" href=\"http://www.nickbostrom.com/fut/evolution.pdf\"> it will lead to the preservation of human values in the long run</a><a title=\"Nick Bostrom&apos;s Future of Evolution paper\" href=\"http://www.nickbostrom.com/fut/evolution.pdf\"> </a> ; humans, human values, and human cooperation are in no way the end-point of evolutionary processes. One proposed solution for the lack of global cooperation is increasing our cooperativeness with the use of enhancement technologies. One proposed solution for the value preservation problem would be placing permanent constraints on these contingent multi-level evolutionary forces necessary for the continuity of human values; <a title=\"Nick Bostrom&apos;s Singleton paper\" href=\"http://www.nickbostrom.com/fut/singleton.html\"> placing such constraints would also require a strong global cooperative structure.&#xA0;</a></p>\n<p>We will gather a list of possible paths towards massive global cooperation and discuss how all of them fail; thereby drawing attention to the obstacles to achieving such state. By massive global cooperation we mean one where there are no strong sub-groups aggressively competing between themselves or with the global group. Arguably, this level of cooperation would both (1) drastically decrease risks that arise due to our inability for large-scale cooperation (e.g. the Ultimate Harm), and (2) would guarantee our values are preserved even if evolutionary unfit. We will leave aside the question of whether this solution is required and whether there are other solutions for these problems.</p>\n<p><strong>Group condensation</strong></p>\n<p>Smaller groups tend to form semi-spontaneously inside a larger scale group, becoming stronger over time and compromising the larger co-operational structure. For instance, suppose we ban most forms of in-group favouritism and existing sub-groups, but allow monogamy to continue as a dominating mating strategy. Over time, in-group favouritism condensates over the nuclear family, and it gradually spreads across society. This process is partially how some classical civilizations were born. The nuclear family is the solid particle that, over time, condensates the volitile cooperation structure into forming sub-groups.</p>\n<p>But suppose that, using some moral biochemical manipulation or whatever, we make it so that the prior probability of any individual cooperating with any other is the same. Even then, stochastic variations allow reciprocal binary relationships to evolve, and asset specificity and the like will naturally develop. Regardless of the prior probability, other individuals will find more efficient to cooperate within the dyad due to reciprocity and asset specificity. Sub-groups emerge all over again. To avoid the formation of sub-groups, it seems there has to be active altruistic punishment for in-group favouritism. Any instance of it seems to form a nuclei over which progressively larger and stronger groups will condensate; in the same way atmospheric vapour will condensate into cloulds in the presence of micro water droplets. If massive global cooperation is the result we ought to pursue, then the formation of tight-knit, fraternal, norm-oriented, cooperative and efficient groups could be seen as, in this context, a form organized crime, i.e., systematized and coordinated cheating inside a larger cooperative structure.&#xA0;</p>\n<p>Now suppose we ban long-term reciprocity altogether. Nonetheless, if we let leadership skills vary, then naturally individuals will outsource decisions to one another, and this will let groups condensate around natural managers. Therefore, we would have to abolish leadership inequality &#x2013; and servantship inequality for analogous reasons. It seems that if we were to mirror an ant-colony we would have to be as socially featherbrained as they are. No long-term reciprocity, no long-term mating, no asset specificity, no leadership, no servantship and so on. On the extreme, this would be the abolishment of individual agents, we would have turned into one single superorganism. But then doom-prevention is starting to look more like doom than it should. This solution ultimately fails because it produces the very scenario massive global cooperation was intended to avoid.</p>\n<p><strong>Altruism requires bloodshed </strong></p>\n<p>In our path towards increasing human cooperation we might dismiss the fact altruism needs some form of aggression to survive. Eliminating in-group favouritism (parochialism) has to be done thoroughly, because groups without it have no out-group aggression, no defence mechanism and thus become vulnerable. Groups with parochial altruists will always have an advantage over groups with tolerant altruists, thus any remaining group with parochial altruists can immediately take over. No matter how cooperative a group is, if there is no level of parochialism whatsoever, then there will be no incentive to protect the group against aggressors from other smaller groups that do contain parochial altruists. When a tolerant altruistic group encounters a parochial altruistic group, it loses every time, no matter how powerful. This fact is the reason cooperation without aggressiveness never evolved in the first place.</p>\n<p>Another path &#x2013; in line with an alternative explanation for the emergence of altruism &#x2013; would be to allow strong altruistic punishment irrespective of group membership. In order to counterbalance the parochial-altruists&#x2019; danger mentioned above, there would have to be egalitarian measures. There will be no in-group favouritism, but non-parochial altruists would get less punishment <em>iff</em> there is already a high probability outgroups-parochial-altruists will punish them. Call this strong egalitarian altruistic punishment.</p>\n<p>Here is a failure mode for both these paths. Even though there is no credible account of the evolution of altruism where it becomes stable without any form of aggression, an increasingly cooperative and altruistic society will see aggression as a primitive monstrosity. Aggression gets less and less frequent, and the idea of evoking any of the paths above seems abhorrent to this evolved cooperative society. Refusing to take the available options, altruists go extinct for their extremism.</p>\n<p>Solution. Strong reputational positive feedback with egalitarian corrections. There is no punishment for cheaters or out-groups, but altruists are rewarded and non-parochial altruists with a high probability of being punished by outgroups-parochial-altruists are rewarded more. However, this is all very complex and abstract as far as massive global cooperation proposals go. It might as well be that these affirmative justice measures infer too many costs on non-parochial altruists. It would be as if the UK and US gave extra resources to France during WWII instead of directly fighting the Nazis. No idea if it would have worked. We suspect it would have failed from the start because it is unconvincing. If we wish to look for simpler, already evolved solutions, then of the two hypothesized evolutionary pressures for cooperation, i.e. aggression towards out-groups and aggression towards cheaters, the latter seems the most compatible with massive global cooperation.</p>\n<p><strong>Systemic risks</strong></p>\n<p>Some obstacles arise not in the path towards massive global cooperation but in creating an end-result that is too vulnerable to systematic risks brought by increasedrisk correlation and dependency across society. Increased global cooperation means increased risk correlation on a global scale, increasing the likelihood of existential catastrophe. Our current clusters of increased relative correlation (nations, etc.) protect us from existential threats. There are few systemic risks that would take out all nations together, but if we become only one nation we will lose variability. Moreover, if all individuals within nations become unspecific, we become the bleak repetition of a single immune system variant. Whatever kills one individual will be likely to kill all of them. Whatever threatens any group will threaten all groups.</p>\n<p>Solution. Each individual could be packed with an emergency survival strategy. Just like or reptilian brain kicks in when we sense danger, our in-group favouritism and specificity would kick in when we sense existential catastrophe. Like an ant colony that produces more queens every time it senses danger. Society would become some metamorphic superorganism with local fluctuations that would rapidly turn into divergent groups when existential risk increases, only to merge again whenever the risk lowers.</p>\n<p>Problem. This strategy looks more like science fiction than with a massive global cooperation solution. Perhaps it should be a conditional. Whenever we increase individual specificity or dilute groups into a single humanity, we should also assure that we preserve the ability to differentiate again when needed.</p>\n<hr>\n<p>None of the presented solutions is satisfactory. If we currently have reasons to believe massive global cooperation is required, then we should find more feasible and secure ways of producing it.</p></body></html>", "user": {"username": "Diego_Caleiro"}}, {"_id": "Ap83HNQewaihRcB3N", "title": "May in EA Projects", "postedAt": "2015-06-11T23:01:56.055Z", "htmlBody": "<html><body><p>As before, here are updates from the last month in EA projects from <a href=\"http://dotimpact.im/\">.impact</a>, the venue for communicating and collaborating on these. They come from our last meeting on Google Hangouts; as always, notes from previous meetings can be found <a href=\"http://dotimpact.im/meetings.html\">here</a>, as can the agenda for the next general updates meeting - which is happening on Sunday 5 July, and to which anyone&apos;s very welcome! It&apos;s at 9pm UTC (2pm Pacific, 5pm Eastern, 10pm London) and a Google Hangouts link to join will be posted in the <a href=\"https://www.facebook.com/groups/dotimpact/events/\">soon-to-be-created Facebook event</a> at that time.</p>\n<p>Two weeks after each general meeting we also now have a &apos;special&apos; meeting - a deep dive into a particular project, a meeting especially focused on new people, or anything else that seems worthwhile. The next one will be on Sunday 21 June, again at 9pm UTC - Ozzie&apos;s still working out the topic for it, and has suggested options like a &apos;New Project/People Meeting&apos;, which would be smaller than a regular meeting and aimed at people either looking for things to do or with new ideas. I&apos;m sure he&apos;d welcome ideas!</p>\n<h1>7 June 2015 General/Project Updates Meeting</h1>\n<h2>Participants</h2>\n<p><a href=\"https://impact.hackpad.com/ep/profile/qSfdmMKmvAe\"> Marcus Davis</a>, Chicago</p>\n<p><a href=\"https://impact.hackpad.com/ep/profile/xvGv4WFkqm9\"> Matiss Apinis</a>, EA Latvia</p>\n<p><a href=\"https://impact.hackpad.com/ep/profile/B5kgnyspIUQ\"> Ozzie Gooen</a>, .impact cofounder</p>\n<p><a href=\"https://impact.hackpad.com/ep/profile/ywXoYmJQopg\"> Yanick Steinbeck</a> , working on mobile giving</p>\n<p><a href=\"https://impact.hackpad.com/ep/profile/yYmVtny2ziw\"> Tom Ash</a>, Charity Science</p>\n<p><a href=\"https://impact.hackpad.com/ep/profile/EcGbGeUUQzd\"> Eric Bruylant</a>, EA Wiki, and about to start at MIRI</p>\n<p><a href=\"https://impact.hackpad.com/ep/profile/DXCa0lIQAlX\"> Kyle Scott</a>, 80k &amp; CEA</p>\n<h2>Project Updates</h2>\n<p><strong> r/smartgiving changes</strong></p>\n<ul>\n<li> <a href=\"http://www.reddit.com/r/smartgiving/\"> </a> http://www.reddit.com/r/smartgiving/</li>\n<li> People don&#x2019;t like the current auto-poster as much as the old one.</li>\n<li> Fixed by adding Autoposter v3, which is the fixed Autoposter v1.</li>\n<li> <strong> Potential problem:</strong> posts show up in /new, but not on the r/smartgiving front page?</li>\n<li> Matiss: Why is it r/smartgiving rather than r/effectivealtruism? Just wondering. \n<ul>\n<li> Tom: gave explanation. /r/ea is owned by Dee in Vancouver and Peter couldn&#x2019;t get admin rights from her in time.&#xA0; \n<ul>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/qKIxpDQFNxG\"> Peter Hurford</a> , given it&#x2019;s mainly link-sharing rather than commenting it might be worth setting your autoposter to post to /r/ea too/</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/i4RylYOKP1b\"> EA Survey data gathering</a> </strong></p>\n<ul>\n<li> Had a separate brainstorming meeting that went well.</li>\n<li> Currently reaching out to EA orgs for input.&#xA0; Have drafted an email to send and have gathered contact info, but have not sent the emails yet.</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/lGglK2kN3Ll\"> EA Forum</a> </strong></p>\n<ul>\n<li> <strong> Potential AP: </strong> Began recruiting for some minor programming development work. <a href=\"https://github.com/tog22/eaforum/issues\"> See list of requests here</a> .</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/MbqQFaStpnH#Hub-website\"> Hub website</a> </strong></p>\n<ul>\n<li> <strong> Potential AP: </strong> Began recruiting for some minor programming development work. <a href=\"https://github.com/tog22/eahub/issues\"> See list of requests here</a> .</li>\n</ul>\n<p><strong> Evidence Aid Redesign?</strong></p>\n<ul>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/s2nRpZHjFWP\"> Michelle Hutchinson</a> describes Evidence Aid as trying &quot;to get systematic reviews in the humanitarian sphere out to those who could best use them (policy makers and aid workers), and to work out what research most needs to be done in the area and get organisations like the WHO, Dfid and the Cochrane Collaboration to commission them.&quot;</li>\n<li> Michelle says &quot;[t]hey&#x2019;d be interested in having a volunteer who could improve their website and also who could set up analytics to figure out who is using their resources.&quot;</li>\n<li> Corresponded with Claire of Evidence Aid personally, she said: &quot;it would be excellent to have someone who can help Tony [their web guy] on a permanent basis, plus a to act as a back-up when he is away, or when a disaster such as the recent Nepal Earthquake strikes whom we could call in when necessary to help out. There will also be other activities to improve the website in general that will be developed as the business plan (which has just been finalised) is activated.&quot;</li>\n<li> Peter is going to contact Evidence Aid again and ask for more details.</li>\n<li> <strong> Potential AP: </strong> Is anyone interested?&#xA0; What questions would you have?</li>\n</ul>\n<p><strong> Charity Science Research</strong></p>\n<ul>\n<li> Doing shallow overviews of many possible fundraising ideas, with the goal of prioritizing Charity Science&#x2019;s future activities.</li>\n<li> <strong> Potential AP: </strong> Looking for volunteers to finish <a href=\"https://docs.google.com/spreadsheets/d/1xOtW4X71TIrTabkGrNSw-xZ8VcKu_MVCitMAe9I-BRQ/edit?usp=sharing\"> unstarted shallow overviews</a> .</li>\n<li> Volunteers have been very successful at this, and past volunteers have reported it to be a fun activity. :)</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/Studying-Vegetarian-Advocacy-m11aW51ENVW\"> Studying Vegetarian Advocacy</a> </strong></p>\n<ul>\n<li> Just moved to the final study phase -- collecting responses to the intervention questionnaire.</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/vvalHe1W4EB\"> Individual Facebook welcome</a> </strong></p>\n<ul>\n<li> Peter and To plan to talk to <a href=\"https://impact.hackpad.com/ep/profile/tucs5FVK7Uw\"> Giles Edkins</a> about someone sharing the load</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/zTer4SQCS7h\"> EA Point Systems / EA Gamification</a> </strong></p>\n<ul>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/y9rIae1toNV\"> Charley Lucas</a> : \n<ul>\n<li> <em> I have some ideas around gamification of altruism, but don&#x2019;t know if it fits the &quot;EA&quot; label specifically, so have started a new hackpad here:&#xA0; <a href=\"https://impact.hackpad.com/b2HUuTBqsHh\"> Altruism Gamification Church of Life</a> </em> </li>\n</ul>\n</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/1MPaKnomSGv\"> Local Effective Altruism Network</a> </strong></p>\n<ul>\n<li> Description from <a href=\"https://impact.hackpad.com/ep/profile/qSfdmMKmvAe\"> Marcus Davis</a> of how he recruited many new people for presences to cover ~20 new areas</li>\n<li> Helped distribute/coordinate distributing EA Handbooks to local groups</li>\n<li> Found and trialled a few different VAs to do some work on this (and other things), got them to do some tasks</li>\n<li> Started arranging finances</li>\n<li> Dealt with several queries, hooking people up with relevant groups, etc.</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/xdHW2Yxpldw\"> Outreach to famous people/celebrities</a> </strong></p>\n<ul>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/rra9amwxaqa\"> Jason Ketola</a> : This is a long shot, but I was surprised recently to learn that 50 Cent is involved in quite a bit of philanthropy. Generally, the charity is tied to businesses he&#x2019;s started, which suggests to me he may appreciate impact/ROI. I wonder if he could be reached through his agent to talk about effectiveness. <a href=\"http://anonhq.com/rapper-50-cent-targets-feeding-one-billion-children-africa-2016/\"> </a> http://anonhq.com/rapper-50-cent-targets-feeding-one-billion-children-africa-2016/ <a href=\"http://www.forbes.com/sites/rahimkanani/2012/02/23/50-cent-on-philanthropy-and-corporate-social-responsibility-csr/\"> </a> http://www.forbes.com/sites/rahimkanani/2012/02/23/50-cent-on-philanthropy-and-corporate-social-responsibility-csr/ <a href=\"http://www.theagencygroup.com/artist/50-cent/\"> </a> http://www.theagencygroup.com/artist/50-cent/</li>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/w3Qmb3E3Rtf\"> Rochelle Harris</a> : I have some experience with this. It would be helpful to be asking them for a low ask i.e. don&#x2019;t anticipate them becoming EAs, but making a donation (including of goods for auction) or asking them to attend a fundraising event.&#xA0;</li>\n<li> Sam Harris \n<ul>\n<li> Michael MF and Charity Science trying</li>\n<li> RC: what for? \n<ul>\n<li> TA: I&#xA0; believe <a href=\"https://impact.hackpad.com/ep/profile/HBjMQMUn5uC\"> michaelm</a> f is just telling him about EA/effective charity and seeing if he expresses interest or bites, and then following up. The followup would depend on how he responds, but see Xio&#x2019;s ideas for Dawkins.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li> Ben Goldacre \n<ul>\n<li> GWWC tried</li>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/w3Qmb3E3Rtf\"> Rochelle Harris</a> : We live in the same area, I can see if that helps. Any thoughts on what we are asking him for?</li>\n</ul>\n</li>\n<li> Richard Dawkins \n<ul>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/yYmVtny2ziw\"> Tom Ash</a> knew passingly through the secularist sphere (and was friends with his daughter at school). Hopefully meeting up with (passingly) when we&#x2019;re both at the Vancouver Imagine No Religion conference in June 2015. \n<ul>\n<li> <strong> Update:</strong> went well, he seemed <em> genuinely </em> interested (and believe me he doesn&#x2019;t feign interest when it&#x2019;s not present ;-) and invited Charity Science to talk to his foundation.</li>\n</ul>\n</li>\n<li> RC: what for? \n<ul>\n<li> TA: <a href=\"https://impact.hackpad.com/ep/profile/wGSShLtThxm\"> Ryan</a> , now that Dawkins bit and invited further contact, Xio&#x2019;s idea is to try to get him to mention effective charity to his audience, eg via his social media. And follow up any opportunities that present themselves, e.g. his invitation for Charity Science to talk to his foundation.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li> Lawrence Krauss \n<ul>\n<li> He initiated conversations with Xio at the conference and volunteered his email address so she&#x2019;ll follow up.</li>\n</ul>\n</li>\n<li> Tom: has generally not been very promising when organisations and people have tried it. Trouble is that an email from a random unknown individual often gets mentally filed as such or ignored altogether, even if the celebrity would otherwise get excited by EA. One exception is when the celebrity instantly gets <em> exceptionally</em> excited by the idea.</li>\n<li> Ozzie: matters to have someone good doing the introduction to EA. Maybe EA outreach could do better?</li>\n<li> Kyle: EA outreach might get people like Peter Singer, Nick Bostrom, etc. to approach people which is much better \n<ul>\n<li> All agreed</li>\n<li> Kyle is going to contact EAO and ask them for &#x2019;best practices&#x2019; when doing outreach</li>\n</ul>\n</li>\n</ul>\n<p><strong> RC: Machine Learning for Good</strong></p>\n<p>I don&#x2019;t have any action points except for everyone to know this exists. If you have a data-oriented .impact project, you can try passing it to our group. Peter H knows some about this because he attended the first meeting. (Noone knows very much because it&#x2019;s brand new) The description is: we&#x2019;re meeting once a month to learn and apply machine learning, including neural nets. Monthly meetings are kept to one hour, and in-between times we do machine learning courses and Kaggle contests. Professional/academic ML experience is not required but for those who lack it, it&#x2019;ll be necessary to know basic math and be willing to put in some hours to catch up. <a href=\"https://www.facebook.com/groups/1582428355359588/?fref=ts\"> </a> https://www.facebook.com/groups/1582428355359588/?fref=ts</p>\n<p><strong> Gratipay / Paying Network</strong></p>\n<ul>\n<li> Gratipay has re-opened, has different strategy. \n<ul>\n<li> Changes focus from individuals to organizations.</li>\n<li> To be a &#x2019;Gratipay Team&#x2019; you need to apply</li>\n</ul>\n</li>\n<li> Alternatives: \n<ul>\n<li> Dwolla (US only)</li>\n<li> Google Wallet (restricted to your gmail country)</li>\n<li> Cryptos..... :-/</li>\n<li><span>We decided a path forwards: we&apos;re now going to use a pure money transfer service and will handle the other old features of gratipay (transparency, project descriptions, request, etc.) separately, e.g. through the .impact fund.</span></li>\n</ul>\n</li>\n</ul>\n<p><strong> <a href=\"https://impact.hackpad.com/EA-Mobile-Giving-App-Working-TItle-Donr-WArgpXCFp47\"> EA Mobile Giving App [Working title: Donr]</a> </strong></p>\n<p>The basic idea is to build a mobile application for effective giving and market it to a wider audience outside the traditional EA community.&#xA0;</p>\n<p>Would be happy to give you guys an update on the basic idea and the current status of the concept and hear your inputs!</p>\n<p><strong> Charity Gift Cards (CGCs)</strong></p>\n<ul>\n<li> <a href=\"https://impact.hackpad.com/ep/profile/tO3BKBSagAl\"> Haseeb Qureshi</a> mentioned that GWWC tried this last year with sendable printed Christmas CGCs and it wasn&#x2019;t promising (only about 90 purchases).</li>\n<li> Haseeb contacted Sasha Cooper who wrote a test suite, but no code.</li>\n<li> Haseeb may help develop an <a href=\"https://impact.hackpad.com/Charity-gift-cards-CGCs-O66KU6kpwRj\"> EA CGC</a> platform in the future.</li>\n</ul>\n<p><strong> EA Wiki</strong></p>\n<ul>\n<li> Eric got accepted to the MIRI/CFAR summer internship, so is slowing a bit.</li>\n<li> Still around, still want to help, but focusing on the parts I already have the skills for/enjoy (community organizing, MW sysadmin things), rather than things I don&#x2019;t have a comparative advantage at.</li>\n<li> Specifically passing off setting up SSO to someone who already knows drupal and is familiar with login systems, Ozzie suggested hiring someone</li>\n</ul>\n<p><strong> <a href=\"https://goodreads.com/group/show/151274-effective-altruists\"> EA Book club</a> </strong></p>\n<p>We&#x2019;ll be reading Peter Singer&#x2019;s new book (The Most Good You Can Do) this month, good opportunity to invite people you know to a low-commitment entry discussion to EA, or chime in for more nuanced discussion. Should be good!</p>\n<h2>Free Discussion</h2>\n<p><strong> Paper: FAI Research Constraints and Side Effects</strong></p>\n<p><a href=\"/ea/jn/fai_research_constraints_and_agi_side_effects/\"> </a> <a href=\"/ea/jn/fai_research_constraints_and_agi_side_effects/\"> http://effective-altruism.com/ea/jn/fai_research_constraints_and_agi_side_effects/</a></p>\n<p><strong>Is There A Master List of Facebook Groups?</strong></p>\n<p>This is on the EA wiki at <a href=\"http://effective-altruism.wikia.com/wiki/Discussion_groups\"> </a> http://effective-altruism.wikia.com/wiki/Discussion_groups -&#xA0;<a href=\"https://impact.hackpad.com/ep/profile/GAH7eFIP9oP\">Eric Bruylant</a>&#xA0;<em>may</em>&#xA0;be making a polished version.</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "cuB3GApHqLFXG36C6", "title": "I am Nate Soares, AMA!", "postedAt": "2015-06-10T15:47:38.362Z", "htmlBody": "<html><body><p>Hello Effective Altruism Forum, I am <a href=\"http://so8r.es/\">Nate Soares</a>, and I will be here to answer your questions tomorrow,&#xA0;<strong>Thursday the 11th of June, 15:00-18:00 US Pacific time.</strong>&#xA0;You can post questions here in the interim.</p>\n<p>Last week Monday, I took the reins as <a href=\"https://intelligence.org/2015/05/31/introductions/\">executive director of the Machine Intelligence Research Institute</a>. MIRI focuses on studying technical problems of long-term AI safety. I&apos;m happy to chat about what that means, why it&apos;s important, why we think we can make a difference now, what the open technical problems are, how we approach them, and some of my plans for the future.</p>\n<p>I&apos;m also happy to answer questions about my personal history and how I got here, or about personal growth and mindhacking (a subject I touch upon frequently in my blog, <a href=\"http://mindingourway.com/\">Minding Our Way</a>), or about whatever else piques your curiosity. This is an AMA, after all!</p>\n<p>EDIT (15:00): All right, I&apos;m here. Dang there are a lot of questions! Let&apos;s get this started :-)</p>\n<p>EDIT (18:00): Ok, that&apos;s a wrap. Thanks, everyone! Those were great questions.</p></body></html>", "user": {"username": "So8res"}}, {"_id": "pYaYtCT3Fc5H4rfWS", "title": "Opinion piece on the Swedish Network for Evidence-Based Policy ", "postedAt": "2015-06-09T14:35:32.973Z", "htmlBody": "<html><body><p><em>Follow up to: <a href=\"/ea/ic/the_effectivenessalone_strategy_and_evidencebased/\">The effectiveness-alone strategy and evidence-based policy</a></em></p>\n<p><span><span>A translation of the opinion piece can be found&#xA0;</span></span><a href=\"https://stefanschubert.wordpress.com/2015/06/07/knowledge-must-trump-ideology-and-populism/\">here</a><span><span>.</span></span></p>\n<p><span><span><br></span></span></p>\n<p>I</p>\n<p>Effective altruism is a great concept, but it&apos;s&#xA0;not trivial to sell. There are therefore good reasons to ally ourselves with other rationalist memes to increase the level of rationality and effectiveness in the world. One powerful such rationalist meme is&#xA0;<a href=\"http://en.wikipedia.org/wiki/Evidence-based_policy\">&quot;evidence-based policy&quot;</a>, which is inspired by the&#xA0;<a href=\"http://en.wikipedia.org/wiki/Evidence-based_medicine\">&quot;evidence-based medicine&quot;</a>&#xA0;movement.&#xA0;</p>\n<p>The&#xA0;exact meaning of evidence-based policy is somewhat disputed, but generally proponents of&#xA0;evidence-based policy&#xA0;demand that the standards on which policy is based should be raised. Many believe strongly in&#xA0;<a href=\"http://en.wikipedia.org/wiki/Randomized_controlled_trial\">randomized control trials</a>&#xA0;(RCTs) and in the<a href=\"http://en.wikipedia.org/wiki/Hierarchy_of_evidence\">&#xA0;&quot;hierarchy of evidence&quot;</a>, but there is not complete agreement on the strength of RCTs relative to other kinds of studies.</p>\n<p>In the US and the UK, there are several organizations which work on&#xA0;evidence-based policy, such as the British&#xA0;<a href=\"https://www.gov.uk/what-works-network\">What Works Network</a>&#xA0;and the American&#xA0;<a href=\"http://coalition4evidence.org/\">Coalition for Evidence-Based Policy</a>. Inspired by them, I took the initative to start a Swedish network for&#xA0;evidence-based policy&#xA0;at the start of this year. We are by now around 50 (depending on how you count) researchers, civil servants, journalists, consultants, students and other activists in the network. Only myself and a few others are EA members, so it&apos;s not an EA organization,&#xA0;<a href=\"/ea/ic/the_effectivenessalone_strategy_and_evidencebased/\">but as I argued in my previous post</a>, I do believe working on this nevertheless is an effectively altruistic cause.</p>\n<p>One difference between us and What Works is that we aim to be a broad campaigning organization. We believe that policy not being evidence-based is not only due to a lack of knowledge, but also due to a lack of will, especially among politicians. Politicians often disregard expert advice (on what policies are the most effective to reach a given set of goals) which goes against their political prejudices.&#xA0;&#xA0;Therefore we need to put pressure on politicians - not the least in the media - rather than just work behind the scenes as an expert organization.</p>\n<p>II (Most&#xA0;linked replies below are in Swedish)</p>\n<p>Our activities were fairly modest until last Sunday, when&#xA0;<a href=\"https://stefanschubert.wordpress.com/2015/06/07/knowledge-must-trump-ideology-and-populism/\">we wrote an opinion piece</a>&#xA0;calling for&#xA0;evidence-based policy&#xA0;(English). The opinion piece was published in the&#xA0;most widely-read&#xA0;broadsheet,&#xA0;<a href=\"http://en.wikipedia.org/wiki/Dagens_Nyheter\">Dagens Nyheter</a>, on DN Debatt - a sort of op-ed forum. DN Debatt has a special standing in Swedish politics. Everybody reads it and it&apos;s well-respected.</p>\n<p>Hence we had expected a lot of attention, but the results still exceeded them. Ours was the second most shared DN Debatt-article in the month of May. We got&#xA0;<a href=\"http://www.dn.se/debatt/kunskap-maste-ga-fore-ideologi-och-populism/\">seven replies in Dagens Nyheter</a>,&#xA0;<a href=\"http://www.svd.se/de-designar-ditt-rostbeteende/om/ledare\">were strongly criticized</a>&#xA0;in the other main broadsheet,&#xA0;<a href=\"http://en.wikipedia.org/wiki/Svenska_Dagbladet\">Svenska Dagbladet</a>&#xA0;(conservative),&#xA0;<a href=\"http://sverigesradio.se/sida/avsnitt/569601?programid=4743\">parodied in a popular public service</a>&#xA0;(equivalent of BBC) podcast, and were also commented on in a number of smaller newspapers. The discussion on Twitter was pretty intense. Subsequently, we also published two replies to replies in&#xA0;<a href=\"http://www.dn.se/debatt/repliker/vart-intresse-ligger-i-de-politiska-beslutsprocesserna/\">Dagens Nyheter</a>&#xA0;and&#xA0;<a href=\"http://www.svd.se/evidensdebattorer-i-replik-desinformation-om-disputerade-despoter?utm_medium=twitter&amp;utm_source=twitterfeed\">Svenska Dagbladet</a>.</p>\n<p>It&apos;s hard to tell what the majority opinion on our piece was. Certainly, there was a lot of praise and a lot of Facebook likes, but also some&#xA0;fierce&#xA0;criticism. This was almost exclusively down to misunderstandings. I won&apos;t bog you down with all of the details here, but will rather summarize my general conclusions. They could be useful for anyone trying to write on evidence-based policy or related concepts in other countries.&#xA0;</p>\n<p>I should say that &quot;evidence-based policy&quot; isn&apos;t as entrenched a concept in Sweden as it is in the US and the UK, which probably played to our disadvantage.&#xA0;</p>\n<p>1) You need to be very clear over the means-ends-distinction. Evidence-based policy is about making the methods for reaching your political goals (happiness, equality, liberty, etc) more effective by the use of evidence. It is not about propagating any particular set of political goals. We tried to be clear about this, but partly failed for two reasons. Firstly, Dagens Nyheter set the headline, which was misleading. Second, we only clarified this distinction at the end. It should have been at the top.</p>\n<p>2) There is a straw man conception of evidence-based policy, or expert-informed policy and political rationality more generally, akin to&#xA0;<a href=\"http://lesswrong.com/lw/90n/summary_of_the_straw_vulcan/\">Julia Galef&apos;s &quot;Straw Vulcan&quot;</a>&#xA0;conception of rationality. Perhaps this varies a bit from country to country, but in Sweden it&apos;s strong. Let&apos;s call it &quot;Straw Soviet&quot; for now (please come with suggestions!).</p>\n<p>According to this conception, evidence-based policy means technocracy (of a dictatorial form, according to the more extreme interpretations), disregard of non-quantifiable values (cf &quot;Straw Vulcan&quot;), disregard of emotions, &quot;Mad Scientist&quot;-conception of society as a labratory, etc, etc. You need to everything you can to counter such interpretations. I certainly underestimated the power of this straw man meme. I should also say that the Straw Soviet&#xA0;is probably more vicious than the Straw Vulcan, who seems more innocent (perhaps this is partly down to Julia&apos;s plafyul presentation of it, though).&#xA0;</p>\n<p>For instance, <a href=\"http://www.svd.se/de-designar-ditt-rostbeteende/om/ledare\">Svenska Dagbladet&apos;s criticism</a> was all about the &quot;Straw Soviet&quot;. We&#xA0;were said to want to &quot;design voter behaviour&quot; (this was also partly due to the article having been signed by a few <a href=\"http://en.wikipedia.org/wiki/Nudge_theory\">nudgers</a> who call themselves &quot;behavioural engineers&quot; - a big trigger of the Straw Soviet). Here are some more quotes:</p>\n<blockquote>\n<p>It is perhaps not the &#x201C;enlightened despot&#x201D; who is called for in the opinion piece, but rather Dr Despot. Today&#x2019;s most frightening reading came from the recently formed &#x201C;Network for Evidence-Based Policy&#x201D; (Dagens Nyheter 1 June).</p>\n</blockquote>\n<p>//</p>\n<blockquote>\n<p>Since there probably are very few citizens who base their votes on research reports, free elections yields results which are not evidence-based. According to the argument in the opinion piece, that means that since&#xA0;we &#x201C;see the world through&#xA0;partisan lenses&#x201D;, the election results are as a rule problematic or directly harmful.</p>\n</blockquote>\n<p>//</p>\n<blockquote>\n<p>Now if the network were correct, true evidence-based policies would lead to a single proposal, a solution &#x201C;free from ideology and populism&#x201D;. That would in turn mean that all parties arrived at the same answer, and it is absolutely impossible why that &#x2013; though ever so full of evidence &#x2013; would be desirable.</p>\n<p>A vibrant democracy is based on the existence of conflicts of opinion and value, intellectual diversity and the citizen&#x2019;s right to freely express it. The complete and rational citizen is an anomaly, and based on the unpleasant idea that enlightened powers can raise, design, a new man.</p>\n<p>Paradoxically, it is precisely highly ideological regimes which have attempted just that. The results have been devastating.</p>\n</blockquote>\n<p>We got several other replies along these lines, though we also got a <a href=\"http://www.dn.se/ledare/signerat/carl-johan-von-seth-politik-ar-inte-bara-att-tycka-och-onska/\">much more positive one from Dagens Nyheter itself</a>. A large group of replies treated more technical and hum-drum issues concerning RCTs, practical policy-making, etc.</p>\n<p>3) Connected to the Straw Vulcan and the Straw Soviet, there is a &quot;Straw Naive Positivist Scientist&quot; (again, suggestions for better terms are welcome), who thinks that knowledge is easily obtainable even in messy fields like economics, that it&apos;s easy to reach consensus if you just don&apos;t lead political misconceptions mislead you, that you always easily can infer policy-advice from research, etc. We got a lot of criticism which was based on the Straw Naive Positivist. Obviously, we don&apos;t hold any of those views.</p>\n<p>4) People read very superficially. This is not only true of the man in the street, but also of many journalists, politicians, etc. At some level I know this,&#xA0;<a href=\"http://www.economist.com/news/science-and-technology/21612118-it-not-just-old-married-couples-who-talk-without-communicating-you-never-listen\">having myself written about research on this</a>&#xA0;on my blog, but it&apos;s harder to make full use of that knowledge when you write.</p>\n<p>Also lots of people don&apos;t use the <a href=\"http://en.wikipedia.org/wiki/Principle_of_charity\">principle of charity</a> at all. Some of the replies - <a href=\"http://www.dn.se/debatt/kunskap-maste-ga-fore-ideologi-och-populism/\">including one from a philosophy professor</a> - were exceedingly uncharitable. Thus don&apos;t expect people to use the principle of charity - especially when emotional memes like the Straw Soviet are around.</p>\n<p>When you fight such powerful memes, you need to be extremely clear. You need to say the things you really want to get across early, to repeat them, and to give examples. If at all possible, you should control the title, since that sets so much of the tone of the piece (give the publishers a juicy suggestion and they might buy it). Don&apos;t say too much, but focus on getting the central message across.</p>\n<p>This is&#xA0;so<em></em><strong><em>&#xA0;</em></strong><em></em>different from writing an academic paper. Of course that&apos;s obvious, but it&apos;s one thing to get it on an intellectual level, quite another to really internalize it. If you could get a skilled public communicator on board, that would be very useful.</p>\n<p>I also think it would be good to pre-test major articles (e.g. on Mechanical Turk) to get a clearer picture of whether the message gets across. If you don&apos;t want the content to leak beforehand, that might not be doable, though.</p>\n<p>5) We were probably a bit too extreme regarding RCTs, which triggered the Straw Soviet and the Straw Naive Positivist (for epistemological and ethical reasons). It would have been more tactical to emphasize other stuff.</p>\n<p>6) We would have come off as more concrete if we had based our opinion piece on a research report on the state of Swedish policy-making.&#xA0;It&apos;s great if you can do that, but I don&apos;t think it would have been rational for us (see below).</p>\n<p>7) We should have stressed how big the movement on evidence-based policy is in the US and the UK. For instance, we could have mentioned that <a href=\"http://www.brookings.edu/blogs/fixgov/posts/2015/02/04-obama-budget-evidence-based-policy-kamarck\">&quot;Obama&apos;s 2016 budget calls for an emphasis on evidence-based approaches at all levels of government&quot;</a>. Obama being popular and respected in Sweden, that would have done much to disarm the Straw Soviet.&#xA0;</p>\n<p>8) It was a mistake to mention legal means as a way of making politics more evidence-based, since it strongly triggers the Soviet meme. Even those who otherwise supported us criticized this suggestion.</p>\n<p>III</p>\n<p>In our replies, we focused on rectifying the misunderstandings, focusing on the claim that we are calling for &quot;Dr Despot&quot;. These replies normally gets much less attention, and so it was with ours as well. However, the reception also was more&#xA0;<a>unanimously</a>&#xA0;positive, especially from academics and civil servants who know the field.</p>\n<p>I don&apos;t regret writing this opinion piece at this early stage. Before I started writing it (I wrote the body of the text, and the others then made minor tweaks) there wasn&apos;t much activity in our network. Now, we have many more members, including more senior ones. Also, those who already were in the network grew much more enthusiastic after the publication. Thus all-in-all it&apos;s been a major success. Still, I think you can learn a lot from things we could have done better.</p>\n<p>I&apos;ll write more later on how the network is developing more generally.&#xA0;Also I should add that I&apos;m still digesting what I&apos;ve learnt, so my conclusions aren&apos;t set in stone. Any comments are welcome.</p>\n<p>[Edit: Added #7, #8]</p></body></html>", "user": {"username": "Stefan_Schubert"}}, {"_id": "eQpAPSbfejeud8fkj", "title": "EA Ventures Request for Projects + Update", "postedAt": "2015-06-08T21:29:18.349Z", "htmlBody": "<html><body><p>Below are some brief updates on EA Ventures for those who followed our <a href=\"/ea/fo/announcing_effective_altruism_ventures/\">launch thread</a>.</p>\n<p><strong>Request for Projects</strong></p>\n<p>We&apos;ve recently released EA Ventures&apos; <a href=\"http://www.eaventures.org/rfp\">Request for Projects</a>&#xA0;which details some of the projects that the EA Ventures team and funders find especially promising. We modeled this after YCombinator&apos;s <a href=\"https://www.ycombinator.com/rfs/\">Request for Startups</a>&#xA0;in two senses: 1) we plan to mostly recommend funding from projects not on this list, but find this list to be a helpful starting point for project brainstorming; 2) implementation matters, so submitting a project that we suggest is definitely not a guarantee of a funding recommendation.</p>\n<p><strong>Current progress</strong></p>\n<p>We received over 70 applications before our first official deadline which exceeded our expectations. The quality of the projects was also higher than I expected. We&apos;ve done a first-pass review of most of these project and plan to send some feedback to projects in the near future.</p>\n<p>We also recommended our first project for funding: Effective Altruism Policy Analytics which is an EA political influence project being run out of DC. You can see their application <a href=\"https://docs.google.com/document/d/18rctYPF5-cdniK539eVP5uDQkWMjokkwAtHRa9zB5mc/edit?usp=sharing\">here</a>. The project was successfully funded for $19,000. We found the fundraising process to take slightly longer and be slightly more difficult than we were expecting. We&apos;ll be looking to see if a trend emerges as we recommend other projects.</p>\n<p><strong>Current bottlenecks</strong></p>\n<p><strong></strong>We&apos;re mostly bottlenecked on time currently. Most of the EA Ventures team is also working on <a href=\"http://www.eaglobal.org/\">EA Global</a>&#xA0;which is slowly taking up all of our time. We&apos;re interesting in looking for someone who would like to help with evaluations with an eye&#xA0;towards potentially having someone work on this full time in the future. Interested people should contact me.</p>\n<p>We would also like to expand our funder pool. If you&apos;re a donor to EA project interesting in hearing about new EA projects, please let me know.</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Kerry_Vaughan"}}, {"_id": "s7nqmFPnWthoL5b9E", "title": "We are living in a suboptimal blogosphere", "postedAt": "2015-06-08T16:41:51.213Z", "htmlBody": "<html><body><p><em>Cross Posted on Lesswrong</em></p>\n<p>At Event Horizon (a Rationalist/Effective Altruist house in Berkeley) my roommates yesterday were worried about Slate Star Codex. Their worries also apply to the Effective Altruism Forum, so I&apos;ll extend them.&#xA0;</p>\n<p><strong>The Problem:</strong></p>\n<p>Lesswrong was for many years the gravitational center for young rationalists worldwide, and it permits posting by new users, so good new ideas had a strong incentive to emerge.</p>\n<p>With the rise of Slate Star Codex, the incentive for new users to post content on Lesswrong went down. Posting at Slate Star Codex is not open, so potentially great bloggers are not incentivized to come up with their ideas, but only to comment on the ones there.&#xA0;</p>\n<p>The Effective Altruism forum doesn&apos;t have that particular problem. It is however more constrained in terms of what can be posted there. It is after all supposed to be about Effective Altruism.&#xA0;</p>\n<p>We thus have three different strong attractors for the large community of people who enjoy reading blog posts online and are nearby in idea space.&#xA0;</p>\n<p><strong>Possible Solutions:&#xA0;</strong></p>\n<p>If Slate Star Codex became an open blog like Lesswrong, more people would consider transitioning from passive lurkers to actual posters.&#xA0;</p>\n<p>If the Effective Altruism Forum got as many readers as Lesswrong, there could be two gravity centers at the same time.&#xA0;</p>\n<p>If the moderation and self selection of Main was changed into something that attracts those who have been on LW for a long time, and discussion was changed to something like Newcomers discussion, LW could go back to being the main space, with a two tier system (maybe one modulated by karma as well).&#xA0;</p>\n<p><strong>The Past:</strong></p>\n<p>In the past there was Overcoming Bias, and Lesswrong in part became a stronger attractor because it was more open. Eventually lesswrongers migrated from Main to Discussion, and from there to Slate Star Codex, 80k blog, Effective Altruism forum, back to Overcoming Bias, and Wait But Why.&#xA0;</p>\n<p>It is possible that Lesswrong had simply exerted it&apos;s capacity.&#xA0;</p>\n<p>It is possible that a new higher tier league was needed to keep post quality high.</p>\n<p><strong>A Suggestion:&#xA0;</strong></p>\n<p>I suggest two things should be preserved:</p>\n<p>Interesting content being created by those with more experience and knowledge who have interacted in this memespace for longer (part of why Slate Star Codex is powerful), and&#xA0;</p>\n<p>The opportunity (and total absence of trivial inconveniences) for new people to try creating their own new posts.&#xA0;</p>\n<p>If these two properties are kept, there is a lot of value to be gained by everyone.&#xA0;</p>\n<p><strong>The Status Quo:&#xA0;</strong></p>\n<p>I feel like we are living in a very suboptimal blogosphere. On LW, Discussion is more read than Main, which means what is being promoted to main is not attractive to the people who are actually reading Lesswrong. The top tier quality for actually read posting is dominated by one individual (a great one, but still), disincentivizing high quality posts by other high quality people. The EA Forum has high quality posts that go unread because it isn&apos;t the center of attention.&#xA0;</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Diego_Caleiro"}}, {"_id": "6kri6hBbDaKHQcwse", "title": "[Discussion] What have you found great value in not doing?", "postedAt": "2015-06-08T15:42:34.113Z", "htmlBody": "<html><body><p>A bet about your last week: you are probably not learning how to play the pan flute, scheming a revolution in a southeast Asian country, or dancewalking through your main avenue every other day.</p>\n<p>There are also<strong> interesting</strong> things you are not doing. <em>Things that you are gaining value because you are not doing.</em>&#xA0;</p>\n<p>Here are some of mine that other EAs may also gain value from:&#xA0;</p>\n<p>&#xA0;</p>\n<ul>\n<li>I&apos;m not seeing any advertisement online, thanks to the <em>no ads at all</em> feature of <a href=\"https://adblockplus.org/\">AdBlock Plus</a></li>\n<li>I&apos;m not reading newspapers or any other source of news. I just assume other people will filter me into the relevant news.&#xA0;</li>\n<li>I&apos;m not considering what to do on weekends during the day. I&apos;ve locked in a routine I like so I don&apos;t have to process any information.&#xA0;</li>\n<li>I&apos;m not eating nearly as much meat as I once did.&#xA0;</li>\n<li>I&apos;m not watching sports, because I like participating in them as much as watching, so given a choice, I&apos;ll take the <em>Two for the price of one </em>value. I only exercise in ways that fill two or more goals at the same time.&#xA0;</li>\n<li>I&apos;m not using email to schedule things with people, but Google Calendar directly, saving precious coordination time.&#xA0;</li>\n</ul>\n<p>&#xA0;</p>\n<p><strong>I&apos;d like to suggest that we list things we learned to value not doing on the comment section. I would love to <em>not do</em> some of them!&#xA0;</strong></p></body></html>", "user": {"username": "Diego_Caleiro"}}, {"_id": "hfLCSyNwC7xjJHBvD", "title": "An update on Project Healthy Children", "postedAt": "2015-06-08T13:36:16.414Z", "htmlBody": "<html><body><p>Hi!</p>\n<p>I&apos;ve written an update on Project Healthy Children and their micronutrient fortification programs.</p>\n<p>Any feedback would be very welcome:</p>\n<p>https://docs.google.com/document/d/1diJ1hCyORmDzkoZKf7Gou6bei-ciWezoTDXiXc3kdLI/edit?usp=sharing</p>\n<p>Hauke :)</p></body></html>", "user": {"username": "HaukeHillebrandt"}}, {"_id": "2uK3c36Tai2BqMcSH", "title": "Meetup : Meet up at Mad City Vegan Fest", "postedAt": "2015-06-07T22:41:40.920Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/2w\">Meet up at Mad City Vegan Fest</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>27 June 2015 05:00:00AM (-0500)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Goodman Community Center, 149 Waubesa Street, Madison, WI</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>As discussed at our last meetup, animal welfare is one of the four big causes that have gathered the most support from the EA community. Coincidentally, Mad City Vegan Fest is coming up soon!</p>\n\n<p>Many of the EA group members will be there either as volunteers or attendees. If you&apos;d like to attend and pick a time to meet up with other EA Madison members there, feel free to coordinate that in the comments area.</p>\n\n<p>Some questions to think about while attending:</p>\n\n<p>&#x2022; What metrics should you measure to determine if the event was effective?</p>\n\n<p>&#x2022; How could you collect the data for those metrics?</p>\n\n<p>&#x2022; How could the event have been made more effective?</p>\n\n<p>Event description:</p>\n\n<p>Join an expected crowd of over 2,000 attendees for delicious food (free samples and larger portions for purchase), inspiring speakers, cooking demonstrations, a great variety of exhibitors (some with products for purchase), and raffles throughout the day -- get a free raffle ticket just for showing up!</p>\n\n<p>Mad City Vegan Fest is a great opportunity to learn more about protecting animals, the environment, and your health. It&#x2019;s an event where everyone is welcome -- from omnivores who are just curious, to longtime vegans and vegetarians.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/2w\">Meet up at Mad City Vegan Fest</a></h2></body></html>", "user": {"username": "Gina_Stuessy"}}, {"_id": "gYb4nSMdneB3xmDsx", "title": "FAI Research Constraints and AGI Side Effects", "postedAt": "2015-06-07T20:50:21.908Z", "htmlBody": "<html><body><p>Justin Shovelain and I have written a paper on modeling FAI research constraints. &#xA0;We have not tried applying any numbers or uncertainties to these models, but we have established a few simple equations that numbers could easily be applied to.</p>\n<p>This is available on&#xA0;<a href=\"http://lesswrong.com/r/lesswrong/lw/m82/fai_research_constraints_and_agi_side_effects/\">LessWrong</a>, and <a href=\"https://www.penflip.com/ozziegooen/unfriendly-leakage?invite=4xB3rjsy\">Penflip</a>, which is better formatted (but does not have comments)</p>\n<h2>Summary</h2>\n<p>Friendly artificial intelligence (FAI) researchers have at least two significant challenges. First, they must produce a significant amount of FAI research in a short amount of time. Second, they must do so without producing enough general artificial intelligence (AGI) research to result in the creation of an unfriendly artificial intelligence (UFAI). We estimate the requirements of both of these challenges using two simple models.</p>\n<p>Our first model describes a&#xA0;<em>friendliness ratio</em>&#xA0;and a&#xA0;<em>leakage ratio</em>&#xA0;for&#xA0;<em>FAI research projects</em>. These provide limits on the allowable amount of artificial general intelligence (AGI) knowledge produced per unit of FAI knowledge in order for a project to be net beneficial.</p>\n<p>Our second model studies a hypothetical&#xA0;<em>FAI venture</em>, which is responsible for ensuring FAI creation. We estimate necessary total FAI research per year from the venture and leakage ratio of that research. This model demonstrates a trade off between the speed of FAI research and the proportion of AGI research that can be revealed as part of it. If FAI research takes too long, then the acceptable leakage ratio may become so low that it would become nearly impossible to safely produce any new research.</p>\n<p><strong>Addition Information</strong> (Not in Paper)</p>\n<p>This paper had many equations that required LaTeX. &#xA0;Doing this all in the LessWrong proved very time intensive and frustrating. &#xA0;Fortunately, we did find an assistant on TimeEtc, who was able to accomplish this in around 2 hours. &#xA0;This cost around $45 of time labor for, which was a bit much, but it was very easy to schedule (results the next day).&#xA0;</p></body></html>", "user": {"username": "oagr"}}, {"_id": "ToTpmYyhcLXzYFDXN", "title": "[Discussion] What does winning look like?", "postedAt": "2015-06-07T19:52:26.201Z", "htmlBody": "<html><body><p>Today, a few Bay Area EAs and myself are asking the question, &quot;How can we measure whether the EA movement is winning?&quot;</p>\n<p>Intutively, deciding on a win condition seems important for answering this question. Most social movements appear to have win conditions. These win conditions refer to a state of the world that looks different from the world&apos;s present state, and they are often even implicit within the movement&apos;s name (e.g., abolishionism, animal rights).</p>\n<p>What does winning look like for EA? And how do we know if we&apos;re winning?</p>\n<p>Discuss!</p></body></html>", "user": {"username": "tyleralterman"}}]