[{"_id": "J2aqDnXzLMavmEgCm", "title": "The Possibility of an Ongoing Moral Catastrophe", "postedAt": "2015-02-07T01:10:26.471Z", "htmlBody": "<h1>Abstract</h1><blockquote><p>This article gives two arguments for believing that our society is unknowingly guilty of serious, large-scale wrongdoing.&nbsp;</p><p>First is an inductive argument: most other societies, in history and in the world today, have been unknowingly guilty of serious wrongdoing, so ours probably is too. Second is a disjunctive argument: there are a large number of distinct ways in which our practices could turn out to be horribly wrong, so even if no particular hypothesized moral mistake strikes us as very likely, the disjunction of all such mistakes should receive significant credence.&nbsp;</p><p>The article then discusses what our society should do in light of the likelihood that we are doing something seriously wrong: we should regard intellectual progress, of the sort that will allow us to find and correct our moral mistakes as soon as possible, as an urgent moral priority rather than as a mere luxury; and we should also consider it important to save resources and cultivate flexibility, so that when the time comes to change our policies we will be able to do so quickly and smoothly.</p></blockquote><h3><a href=\"https://assets.ctfassets.net/ohf186sfn6di/1UzEHuHjxaSOMs02IcUKS0/055ec7f9f5367b82ea2e3db532db5818/williams2015_--_Moral_Catasatrophe.pdf\"><strong>Read the rest of the paper</strong></a></h3>", "user": {"username": "EA Fellowship"}}, {"_id": "3p8QvF25xiCFvM8RQ", "title": "A form for people interested in EA projects or volunteering", "postedAt": "2015-02-19T13:37:22.007Z", "htmlBody": "<html><body><p>If you&apos;re interested in effective altruist&#xA0;projects or volunteering, you may like to&#xA0;<a href=\"http://dotimpact.im/join.html\"><strong>completing this form to let others know</strong></a>. It lets you be contacted by anyone recruiting for these, or simply sharing ideas or relevant resources. It also gives all EA groups and organisations a picture of the distribution of people and skills potentially available. The results are <a href=\"https://docs.google.com/spreadsheet/ccc?key=0AqYgDWjtTPhSdG1hblR4LXZiWHlXZUZPNGtNWmkxLUE#gid=0\">shared publicly here</a>&#xA0;- please note that this includes the contact details that you give.</p>\n<p>This form was originally created for <a href=\"http://dotimpact.im/\">.impact</a> by its co-founders, <a href=\"http://effectivealtruismhub.com/user/ozzie-gooen\">Ozzie Gooen</a> and <a href=\"http://effectivealtruismhub.com/user/peter-hurford\">Peter Hurford</a>. But it doesn&apos;t belong to any one organisation; any EA is welcome to contact any other EA on it. Indeed, .impact isn&apos;t an organisation in the classic sense - it&apos;s a venue for coordinating and communicating the projects people are working on and the ideas they have, and hooking interested people up with one of these. (This happens in particular through its <a href=\"https://www.facebook.com/groups/dotimpact/events/\">monthly Google Hangouts</a> for project updates and free discussion, which anyone is welcome at.)&#xA0;</p>\n<p>You can also indicate if you&apos;re already considering or working on projects. If you are, it can be helpful to <a href=\"https://impact.hackpad.com/How-to-Add-a-Project-to-.impact-XAQuRKC4c7R\">add it</a> to .impact&apos;s <a href=\"https://impact.hackpad.com/Projects-aRiPtncmuKS\">central repository of people&apos;s projects and ideas</a>, which you can do instead of mentioning it on the form.&#xA0;Interested people can then find either you or your idea, which can get projects going, avoid duplication of effort, share knowledge, and reveal useful synergies.&#xA0;You can also find a partial list of ways to get involved with active projects <a href=\"https://impact.hackpad.com/EA-volunteer-opportunities-FTVxgDn6jk6\">here</a>. My impression is that EA projects are particularly short of people willing to do design (who don&apos;t have to be professionals or hugely fancy at this!)</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "vjqagNvYeuk95ZRb4", "title": "The Value of Starting a Giving What We Can/EA Chapter", "postedAt": "2015-02-18T17:09:25.469Z", "htmlBody": "<html><body><p><span>I think most of us in the EA movement have a sense that EA chapters are valuable, but its often hard to tell how valuable they are. &#xA0;Well, in this blog post, I am going to argue that they are incredibly valuable. &#xA0;So much so, that starting a Giving What We Can/EA chapter could be one of the most effective things you can do with your time. &#xA0;Some rough calculations show that establishing even a relatively small chapter at a university could result in producing 100,000 USD for effective charities. &#xA0;Similar calculations lead me to think that time starting a community based chapter can be worth 110 USD/hour of work. &#xA0;These are both incredible results, and I hope they inspire many of you to start up a new chapter! &#xA0;</span></p>\n<p><strong><br></strong></p>\n<p><span>The Importance of Chapters</span></p>\n<p><strong><br></strong></p>\n<p><span>Chapters are important because they represent a natural way for Giving What We Can and EA to grow. &#xA0;Given our experiences with chapters so far, we think it is reasonable to expect a new Giving What We Can Chapter to produce 3-5 new members in their first year. This represents an absolutely incredible amount of money moved to the most effective charities. Even by conservative estimate, we should value this at $60,000-$100,000 USD moved to the most effective charities. (We have settled on valuing the pledge at $20,000USD to accommodate counterfactual giving and possible attrition rates. &#xA0;This is a very conservative figure, as the median earning individual in the US will give away over $150,000USD &#xA0;over the course of their career through the pledge. &#xA0;That said, valuing the pledge quite conservatively at $20,000USD only helps to strengthen the conclusions of this post- if anything we might expect the real value of money moved to the most effective charities to be much higher than the numbers considered here) &#xA0;</span></p>\n<p><strong><br></strong></p>\n<p><span>Even if we assume that running a chapter is quite time intensive, requiring say 40 hours a month, this means that you will still be producing 120-200 dollars of value per hour of work- an incredible result! &#xA0;&#xA0;The most successful chapters do much better than this. During Cambridge&#x2019;s <a href=\"http://www.thesundaytimes.co.uk/sto/news/uk_news/Society/article1503068.ece\">exceptionally successful event</a> this December, over </span><span>100</span><span> individuals, took the pledge representing over </span><span>$</span><span>2 million USD </span><span>going to cost-effective charities. &#xA0;This is an absolutely amazing result for students to be able to have, and it really shows the potential of chapters. &#xA0;</span></p>\n<p><strong><br></strong></p>\n<p><span><strong>If you are an EA, I argue that one of the most impactful things you can do with your time is to start a chapter.</strong></span></p>\n<p><strong><br></strong></p>\n<p><span>If we turn our attention from University chapters, to community chapters, the same incredible returns still seem to apply. Most community chapters focus their time on social events. &#xA0;Recently, Sam Hilton, head of the London chapter, <a href=\"/ea/ey/how_i_run_a_growing_effective_altruism_group_in_a/\">explained that he runs their successful chapter on only 30 minutes a month</a>, which is quite an achievement! &#xA0;But even if we assume that organising a community chapter will take much more time than this, it turns out to be an incredibly valuable activity. If over the course of a year your social events lead to just one person in the group taking the pledge, that represents $20,000 USD for the most cost effective charities. &#xA0;Lets say it takes 15 hours a month to organise these activities (30x more time than Sam&#x2019;s figure). That is 180 hours of work over the course of the year producing $20,000 USD. That means you earn roughly 110 dollars/hour for the most effective charities. &#xA0;Just to put that in perspective, this represents the same value added, per hour, as someone earning $440,000 USD a year pursuing earning to give at 50% of their income. &#xA0;</span></p>\n<p><span><br></span></p>\n<p><span>Sufficed to say this is an incredible fact. &#xA0;It clearly paints a picture of how unbelievably effective working on EA Movement growth is, insofar as this movement growth translates into people taking the pledge. &#xA0;</span></p>\n<p><strong><br></strong></p>\n<p><span>Start a chapter today!</span></p>\n<p><strong><br></strong></p>\n<p><span>I hope this post has inspired you to start a chapter at your city or at your university! &#xA0;As I mentioned, by starting a chapter at your university or in your city, you could potentially move tens or hundreds of thousands of dollars to the most effective charities. &#xA0;</span></p>\n<p><strong><br></strong></p>\n<p><span>In my next post, I will be addressing some of the concerns that often prevent people from starting up a chapter. &#xA0;One concern people often express is that they don&apos;t know how to properly start up a chapter, and feel intimated by the potential difficulty of it. &#xA0;Luckily, Giving What We Can has shifted our outreach strategy, in part, to try and address this concern. Our outreach strategy will now be much more Chapter focused, I will be spending most of my time communicating with current chapters, and supporting people starting out new chapters. </span></p>\n<p><strong><br></strong></p>\n<p><span>If you are interested in starting a chapter, please <a href=\"mailto:jonathan.courtney@givingwhatwecan.org\">email me</a> and/or fill out <a href=\"https://docs.google.com/forms/d/1czOhTygsmprIaMN0CLS7jd5NVuTMlWmo8PbHnrf9I4E/viewform?usp=send_form\">this form</a>. I will be happy to work with you- sharing best practices, directing you to other EAs in your area, and otherwise doing all that I can to help make your chapter a success! </span></p>\n<p>&#xA0;</p>\n<p><span>2015 is going to be a big year for EA- let&#x2019;s make it even bigger by pursuing big wins like starting up successful chapters! </span></p></body></html>", "user": {"username": "jonathancourtney"}}, {"_id": "apKTPEcRm6jSFaMya", "title": "The Value of a Life", "postedAt": "2015-02-17T17:33:56.374Z", "htmlBody": "<html><body><p><em>This post is cross-posted from <a href=\"http://mindingourway.com/the-value-of-a-life/\">MindingOurWay</a>. It&apos;s about some of my reasons for being an effective altruist. It&apos;s targeted more towards people who aren&apos;t EAs or who haven&apos;t heard of effective altruism, but some people here may also find it inspiring.</em></p>\n<p>If you have money and want to save lives, you had better put a price on life. <a href=\"http://squid314.livejournal.com/260949.html\">Scott Alexander explains it better than I can</a>.</p>\n<p>But don&apos;t mix up the <em>price</em> of a life with the <em>value</em> of a life. I see this happen all too frequently. To correct this mistake, I&apos;m going to tell a little story.</p>\n<p><a></a></p>\n<hr>\n<p>Once upon a time, there was a village of peaceful immortal humans. They did not age past their primes, but they could still die from starvation or injury. But perhaps because their lives were so long and full, they all valued each other very highly and lived in peace. Indeed, there were no lengths to which the villagers would not go in order to save one of their fellows from unwanted annihilation.</p>\n<p>Or, at least, that&apos;s how life was before the dragon came.</p>\n<p>Dragons desire two things from people, as I&apos;m sure you know: gold, and flesh. And this dragon, woe be upon the villagers, was powerful indeed &#x2014; nigh invincible, with a cunning to match. The dragon, easily capable of killing the entire village outright, gave a grim ultimatum:</p>\n<blockquote>\n<p>Each person in this village must pay a tax of gold, every year, in proportion to that person&apos;s age. Anyone who cannot pay the tax will be eaten.</p>\n</blockquote>\n<p>The villagers begged and pleaded, they wept and raged, but the dragon was unmoved. It merely showed them a few heaps of rock that looked likely to make good gold mines, and told them to get to work.</p>\n<p>The villagers tried their best. They really did. They were not miners, but they were fast learners. They worked themselves ragged, throwing aside stones, digging at the earth with their bare hands until their fingers bled, hunting and gathering as little as possible, letting their shelters deteriorate &#x2014; yet still, they could not make the dragon&apos;s tax. At the end of a year, the dragon returned, and took all the gold they had, and ten of the oldest villagers (for giving up the eldest villagers was the way to save the most lives).</p>\n<p>Distraught, the villagers resolved to try harder next time. They pushed themselves to their limits and beyond. They raced against time. They grew gaunt and ragged. Their eyes sank, their skin grew sallow, their arms thinned. They pushed themselves too hard, until they were collapsing in the mines. The next time the dragon came, it took all their gold and fifty of their number.</p>\n<p>Their strategy wasn&apos;t working.</p>\n<p>But these villagers were born of humanity, and ingenuity is humanity&apos;s birthright. So in their third year, the surviving villagers came to bitter terms with their situation, and set to hunting and gathering and growing stronger, accepting that they had to take care of themselves before they could take care of their friends. They set to building picks and shovels, realizing that they could not save themselves with their hands alone.</p>\n<p>At the end of the third year, the dragon took all their gold and one hundred of their number, for their infrastructure had not yet started paying off.</p>\n<p>But by the end of the fourth year, the dragon only took two.</p>\n<p>Shortly thereafter, the dragon (delighted by their progress) informed the villagers that the tax would now begin increasing faster; exponentially in age.</p>\n<p>This time, the villagers only nodded, and forged their hot fury into cold resolve.</p>\n<p>It has been many, many years since the dragon came to the village. In fact, it is not a village any more: the village grew to a city, and the city grew to a civilization.</p>\n<p>The population is quite a bit younger now. The elders are wiser and more productive, and can get more gold out of the ground per hour, but there simply comes a time when this increased productivity is not worth the cost in lives. When that time comes, the elders go willingly to their fate, for these people are not the type to buy their own lives at the cost of two others.</p>\n<p>In fact, hard tradeoffs such as these are commonplace. The villagers long ago discovered specialization and economics, and now most of them don&apos;t work in the mines. Some of them spend time growing or preparing food, others spend time maintaining shelter, others spend time inventing new tools and mechanisms that can keep pace with the dragon&apos;s dreadful tax. Indeed, some spend their lives on art and entertainment &#x2014; for the villagers have learned the importance of maintaining motivation and morale.</p>\n<p>(And some villagers, deep underground, far from the dragon&apos;s prying eyes, are designing weapons.)</p>\n<p>So you will find, in this civilization, that there are people who dedicate their lives not to mining gold, but to writing books &#x2014; but if you look closely, you&apos;ll notice that this only happens when the author can save <em>more</em> lives through increased morale and productivity than they can through working in the mines directly. And so this civilization, hellbent on saving as many people as it can every year, still produces books and plays and movies.</p>\n<p>Which means that in modern times, you can calculate the exact cost of saving an additional life. It turns out that one life goes for about the same price as a thousand movie tickets.</p>\n<p>As it happens, two of the citizens of this dragon-ridden world, Alice and Bob, are having a conversation about the value of a life, right now. Let&apos;s listen in:</p>\n<p><strong>Alice:</strong> So you see, the true value of a life is equivalent to about a thousand views on the latest blockbuster.</p>\n<p><strong>Bob:</strong> Nonsense! A life is worth much more than two thousand hours of movie-viewing! A life is nigh invaluable! You can&apos;t put a price tag on a human life!</p>\n<p><strong>Alice:</strong> What hollow indignation! If your actions are inconsistent with putting a price tag on life, then there are ways you could shuffle money around to save more lives. If you want to save as many people as possible with a limited amount of money, then you <em>must</em> put a price on life!</p>\n<p><strong>Bob:</strong> But a thousand viewings of a movie simply isn&apos;t worth the same as a life! If I got to choose between a thousand people watching another blockbuster and the life of my mother, I&apos;d choose the life of my mother any day!</p>\n<p><strong>Alice:</strong> Yes, but this intuition is inconsistent. The market for lives here is effecient, and the market has spoken, and the market says that a life is equal to about a thousand views of the latest blockbuster. Your mother&apos;s life <em>isn&apos;t</em> worth more than the accumulated pleasure that a thousand people experience when watching the latest blockbuster! The viewing experience and your mother&apos;s life just turn out to have the same value, and if your intuition disagrees, you&apos;ll have to fix your intuition!</p>\n<hr>\n<p>Do you see the errors here?</p>\n<p>Alice and Bob are both right, and both wrong.</p>\n<p>Alice is correct in that the villagers <em>must</em> treat a life as equivalent to a few thousand hours worth of watching movies. Given that the villagers are all still trying to save each other, those thousand people only go to the movies if the resulting boost in motivation and morale leads them to collectively generate enough additional wealth to save <em>more</em> than one additional person. If you stopped those people going to the movies, and put their money towards producing gold instead, then <em>less</em> gold would be produced overall, and more people would die. Bob <em>must</em> trade off two thousand movie-hours against one life, if he wants to maximize lives saved.</p>\n<p>But Bob is correct in that the value of a life is worth much more than two thousand hours of viewing movies!</p>\n<p>Alice&apos;s claim is that the <em>sum experience</em> of two thousand movie-hours is equal to the intrinsic value of a life. The market has spoken, and so you must not protest, if you want to save lives.</p>\n<p>But in fact, the very reason that Bob must treat the thousand movie-viewings as equivalent to a life is because those viewings lead to increased morale, which leads to <em>more than one life being saved.</em> This fact <em>does not</em> equate the experience of a life lived to the pleasure of the viewers.</p>\n<p>What Alice has forgotten is that the village is <em>plagued by a dragon.</em></p>\n<p>Were it not for the dragon, these villagers would go to almost any lengths to save each other from unwanted death. There might be <em>some</em> lengths to which they would not go, <em>some</em> price they would not pay, in pain, sorrow, and decreased quality of life among the rest of the villagers, in order to save a friend. But, in the absence of a dragon, this cost would be a <em>hell of a lot higher</em> than two-thousand hours worth of watching movies.</p>\n<hr>\n<p>Enough analogies. Let&apos;s look at our universe, now. Our economy is <em>not</em> efficient &#x2014; it costs a few million dollars to save a life in developed nations, and a few thousand dollars to save a life in underdeveloped nations (where &quot;save a life&quot; really only means &quot;push death back a bit&quot;, in these dark times). Furthermore, our economy is <em>not</em> maximizing for lives: humans are prone to scope insensitivity and a whole slew of other biases that <a href=\"http://mindingourway.com/on-caring/\">dampen their ability to care</a> about other humans dying against their will. Furthermore, it is important to care not only about the lives we save, but about the lives we <em>live</em>.</p>\n<p>Despite all this, we are not all that different from those villagers in the lengths we would go to save each other if death was not inevitable.</p>\n<p>I don&apos;t know how the future will turn out. I don&apos;t know how we&apos;ll end up trading off the preservation of a life against the improvement of a life against the creation of a life, if and when we make it past this phase of scarcity. But I can tell you this: <em>There may well come a day when humanity would tear apart a thousand suns in order to prevent a single untimely death.</em></p>\n<p><em>That</em> is the value of a life.</p>\n<hr>\n<p>You still have to put a price tag on lives, and that price tag still has to somewhere between a few thousand dollars and a few million dollars.</p>\n<p>Imagine a button which, when pressed, picks a random number between 1 and a million. If that number is 1, it kills a randomly selected person. How much would somebody have to pay you to press that button?</p>\n<p><a href=\"http://squid314.livejournal.com/260949.html\">Many people react with disgust, saying they wouldn&apos;t press such a button at any price.</a> They say that the value of a life is nigh inconceivable.</p>\n<p><em>And this intuition is correct!</em></p>\n<p>But when somebody offers you ten dollars to press that button, press it anyway. Press it, and worry about it less than you worry about driving a car for a year (which, if I did my math right, is like pressing a button that has a one in ten thousand chance of killing somebody each year, in return for the convenience of driving [<a href=\"http://www-fars.nhtsa.dot.gov/Main/index.aspx\">1</a>] [<a href=\"http://www.fhwa.dot.gov/ohim/onh00/bar8.htm\">2</a>]). If you want to save the most lives, then you press that button for $10, and you put the money towards saving lives.</p>\n<p><em>But don&apos;t confuse the cost of a life with the value of a life!</em></p>\n<p>In some parts of this world, it costs as little as a few thousand dollars to save a life. If you act like the price on a life is higher than a few thousand dollars, if you <em>actually</em> refuse a million dollars to press the button, or pay a billion dollars to save a single life, then there were other things you could have done to save more lives. If you want to save the most people, you <em>must</em> put a price tag on life according to the <em>actual</em> cost of saving a life.</p>\n<p>But you don&apos;t have to confuse the <em>current cost of saving a life</em> with the <em>intrinsic value of a life.</em></p>\n<p>There is a gap there. There is a gap between how much a life is <em>really worth</em>, and the price tag that you <em>must assign.</em> That gap is not there because your intuitions are wrong. That gap is there because <em>our village is being plagued by a godamn dragon.</em></p>\n<p><em>That gap is a direct measure of the difference between the universe that is, and the universe that should be.</em></p>\n<p>That price difference, the difference between a few thousand dollars and a few thousand suns, is a direct measure of how fucked up things are.</p>\n<hr>\n<p>Most people start with an intuition that they should refuse to press the button at any price, because lives are nigh invaluable. You can go to these people, and show them that in order to save as many lives as possible with a bounded amount of money, they must put a price on life. Most people, at that point, react one of two ways.</p>\n<p>Some accept the logic and reject their intuitions. They see that, to save the most lives, they <em>must</em> use a price tag. It sounds repugnant to say that the pleasure experienced by a few million people drinking a can of soda is equivalent to the value of a life, but (they think) that&apos;s exactly the sort of reasoning that leads someone to thinking that life is invaluable, which is a deadly misconception. And so, wanting to save as many people as they can with the money allotted to life-saving, they bite the bullet, and conclude that lives were never worth all that much anyway.</p>\n<p>Others reject the logic, and continue to claim that life is invaluable, and then try to back up their intuitions with some strange version of ethics where saving as many lives as possible with the money available is not the right thing to do, for convoluted reasons.</p>\n<p>But there&apos;s a third option here! All these people have forgotten about the dragon!</p>\n<p>It is possible to live in a universe where it is <em>both</em> the case that (1) lives are nigh invaluable, and (2) people are being annihilated constantly, against their will, in ways that can be prevented using relatively small sums of money.</p>\n<p>The universe is not fair! Pressing the button for $10 is the way to save the most lives, <em>and this very fact is a horrible thing.</em> Lives are nigh invaluable, <em>but you have to treat them as if they&apos;re worth only a few thousand dollars.</em></p>\n<p>This gap between price and value is <em>unacceptable,</em> but physics wasn&apos;t written according to what we would accept. We live in a cold, uncaring universe; a universe <a href=\"http://so8r.es/stories/BeyondTheReachOfGod.pdf\">beyond the reach of God</a>.</p>\n<p>One day, we may slay the dragons that plague us. One day we, like the villagers in their early days, may have the luxury of going to any length in order to prevent a fellow sentient mind from being condemned to oblivion unwillingly. If we ever make it that far, the worth of a life will be measured not in dollars, but in <em>stars</em>.</p>\n<p><em>That</em> is the value of a life. It will be the value of a life then, and it is the value of a life <em>now.</em></p>\n<p>So when somebody offers $10 to press that button, you press it. You press the hell out of it. It&apos;s the best strategy available to you; it&apos;s the only way to save as many people as you can. <em>But don&apos;t ever forget that this very fact is a terrible tragedy.</em></p>\n<p>Don&apos;t ever forget about the gap between how little a life costs and how much a life is worth. For that gap is an account of the darkness in this universe, it is a measure of how very far we have left to go.</p>\n<hr>\n<p>I don&apos;t want to turn this into a sermon. But some of you, seeing the great abyss between cost and worth clearly for the first time, may decide that this gap is worth closing, that our dragons are dragons are worth slaying. Some of you may be wondering, what now? What next? This last part is for you.</p>\n<p>Know that there are those of us who fight.</p>\n<p>Some of us <a href=\"http://www.givewell.org/\">work in the mines</a> to <a href=\"http://givingwhatwecan.org/\">make the dragon&apos;s tax</a>. Others <a href=\"http://www.fhi.ox.ac.uk/\">prepare for the day we will confront the dragon</a> &#x2014; for the weapons we must bring to bear will be powerful indeed, <a href=\"http://intelligence.org\">and may prove difficult to aim</a>.</p>\n<p>And this is a fight you can join. For some of you, fighting means joining an effective cause. But for most of you, fighting means putting a low price tag on lives, and then honoring it &#x2014; by purchasing lives wherever they are cheapest; by donating to highly effective causes. Remember that just as courage is about doing the right thing even though you&apos;re afraid, <a href=\"http://mindingourway.com/on-caring/\">caring is about doing the right thing even when you&apos;re not overwhelmed by emotion</a>.</p>\n<p>If this is a fight you wish to join, then I urge you to remember the first lesson that the villagers learned: you must care for yourself before you care for others. You do not need to become destitute to struggle against the darkness in this universe. Any small amount of money or effort you can put towards saving lives is money and effort well spent. <a href=\"http://slatestarcodex.com/2014/12/19/nobody-is-perfect-everything-is-commensurable/\">Pledging 10% of your earnings to an effective cause is a difficult achievement worthy of great acclaim</a>.</p>\n<p>If you are going to stand beside us in this fight, then I will welcome you no matter what &#x2014; but I would rather you join us filled with hot fury or cold resolve, rather than with guilt or shame.</p>\n<p>Oh, Death was never an enemy of ours!<br> We laughed with him, we leagued with him, old chum.<br> No soldier&apos;s paid to kick against his powers.<br> We laughed, knowing that better men would come,<br> And greater wars; when each proud fighter brags<br> He wars on Death, for lives; not men, for flags.</p>\n<p>&#x2014; Final stanza of <em>The Next War</em>, by Wilfred Owen</p>\n<p><br> <br> <br> <br> <br> <br></p></body></html>", "user": {"username": "So8res"}}, {"_id": "ySi72Ni2YayviMh5Y", "title": "Motte-and-Bailey Explanations of EA", "postedAt": "2015-02-17T04:49:15.803Z", "htmlBody": "<html><body><p><span><span><em>This is my submission to February&apos;s FGO topic was about explaining effective altruism, especially in person. (We aren&apos;t searching for new explanations, as much as we are for meta-advice.)</em></span></span></p>\n<p><span>I&apos;ve barely ever tried to explain EA-ish ideas to anybody in person. The few times that I have didn&apos;t go very well. I didn&apos;t receive any counterarguments, it was just clear that the people I was talking to were generally unconvinced. The main reason why I don&apos;t tell anyone around me about effective altruism is because I expect these reactions. </span></p>\n<p><span>The closest I&apos;ll come is telling some people I plan to donate a lot of money in the future and that I want to be smart about how I do it. I think this substitute explanation of EA (one that doesn&apos;t actually explain EA at all but instead offers a socially acceptable proxy) is likely to get far better reactions. In my personal experience, people are supportive of philanthropy so long as you don&apos;t come off as <em>weird</em> or as some sort of fanatic. </span></p>\n<p><span>This is similar to the <a href=\"http://slatestarcodex.com/2014/11/03/all-in-all-another-brick-in-the-motte/\">motte-and-bailey fallacy</a>, where effective altruists tell each other that they&apos;re about, say maximizing total expected utility according to a hedonistic utilitarian framework, but only tell &quot;the public&quot; that they want to donate a lot and make sure their donations count. The &quot;true&quot; explanation of EA - that is, the definition that most of us more or less actually agree with - is swapped for a more easily defensible, socially acceptable explanation.</span></p>\n<p><span>Maybe this is just routine, common sense marketing.</span></p></body></html>", "user": {"username": "Bitton"}}, {"_id": "rokASALwwTo74tFYN", "title": "February Open Thread", "postedAt": "2015-02-16T17:42:35.208Z", "htmlBody": "<html><body><p><span>Welcome to February&apos;s open thread on the Effective Altruism Forum. This is our place to discuss relevant topics that have not appeared in recent posts.</span></p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "groHTNtfFhxm7DJnP", "title": "Long-term reasons to favour self-driving cars", "postedAt": "2015-02-13T18:40:16.440Z", "htmlBody": "<html><body><p>This is a short piece <a href=\"http://globalprioritiesproject.org/2015/02/the-hidden-benefit-of-self-driving-cars-that-might-matter-the-most/\">cross-posted</a> from the <a href=\"http://globalprioritiesproject.org/\">new Global Priorities Project website</a>. Paul Christiano has explored the case for <a href=\"http://rationalaltruist.com/2013/02/23/self-driving-cars-as-a-target-for-philanthropy/\">self-driving cars as a target for philanthropy</a>&#xA0;based on direct societal effects; we ask what a longer-term perspective might mean.</p>\n<p><small> </small></p>\n<p><small><strong>By Owen Cotton-Barratt and Sebastian Farquhar</strong></small></p>\n<p>Self-driving cars are coming. A <a href=\"https://www.gov.uk/government/publications/driverless-cars-in-the-uk-a-regulatory-review\">review of existing legislation</a> by the Department for Transport, released Wednesday, said the cars could be tested legally on any roads in Britain, so long as there was a human driver in the car who could assume control and would take responsibility for any accident. Google&#x2019;s prototypes have been driving unaided in pre-mapped environments. Google entered <a href=\"http://www.reuters.com/article/2015/01/14/us-autoshow-google-urmson-idUSKBN0KN29820150114\">discussions last month</a> with major car manufacturers about getting production lines rolling within the next two to five years.</p>\n<p><a href=\"http://www.forbes.com/sites/modeledbehavior/2014/11/08/the-massive-economic-benefits-of-self-driving-cars/\">Pundits </a><a href=\"http://www.investopedia.com/articles/investing/052014/how-googles-selfdriving-car-will-change-everything.asp\">gush </a>about the potential benefits, but the effect of driverless cars helping us build a legislative framework for future automation technologies, though often <a href=\"http://www.vox.com/2014/5/28/5756736/the-case-for-self-driving-cars\">seen as a challenge</a>, may be a huge opportunity.</p>\n<p>Many of the benefits of self-driving cars are well known. First, car crashes kill a lot of people. 1,700 people die in traffic accidents each year in Britain and worldwide the total is 1.2 million&#xB9;, almost as many as die from HIV/AIDS. These are overwhelmingly caused by human error, and it seems likely that the technology could soon become reliable enough to eliminate a large proportion of these.</p>\n<p>Second, people spend a lot of time driving. Some of this is enjoyed, but much is merely endured. Freeing people to use their travel time in work, study or leisure would be a substantial boost to the economy and to wellbeing. Moreover, the effects on congestion, emissions and accessibility could be substantial.</p>\n<p>But there is another big reason to push ahead adopting driverless cars that gets neglected. We are living in a world of increasing automation. We need to adapt to that: technically, legally, and socially. Self-driving cars seem like a big step today, but we can expect much greater automation in our lifetimes, for example in medical diagnosis. <a href=\"https://web.archive.org/web/20150109185039/http://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf\">A recent paper</a> estimates that around half of current jobs in developed economies may be automated away in the coming decades.</p>\n<p>We have a lot to learn. How can we produce systems which are robust to unknown errors in their code? Which are resistant to any remote sabotage? How we can structure our laws so that liability is clear when things fail? How can we structure the incentives so that it is in everyone&#x2019;s interest to prevent them from failing? What new areas of employment can we create to take advantage of this liberation of human time and expertise?</p>\n<p>All of these will take time, and will almost certainly not be done right from the beginning.The longer we wait on grappling with the practical issues that driverless cars present, the longer before we get an opportunity for our society to adapt to the next great force to shape humanity. That will make us less prepared for future increases in automation, which may be much more dramatic and essential to get right. If this were the last time we had to face this challenge, it might make sense to take things slowly. But because there is so much yet to come, the societal knowledge we gain from experimentation is very valuable.</p>\n<p>Slowing things down now might make it easier for us in the short term. It is likely, however, that it will make it harder for society to adapt to a more sudden and alarming change in the future, when we can no longer hold back the rising tide of technology.</p>\n<p><small> </small></p>\n<p><small>Endnotes:</small></p>\n<p><small> </small> <small> </small></p>\n<p><small>1 The UK figure, from the Department for Transport, is from their 2013 annual report as 2014 data have not yet been finalised. The world-wide figure, provided by the World Health Organisation, is for the year 2010. It is likely that this represents a significant underestimate as car ownership in less economically developed nations, which often have poor road safety, has risen in that time.</small></p></body></html>", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "hHwFMK6ccpyykuxWM", "title": "Saving the World, and Healing the Sick", "postedAt": "2015-02-12T19:03:05.269Z", "htmlBody": "<html><body><p>[Part EA origin story, part introduction to EA. I&apos;ve experimented with a more discursive style, but it may come off as flabby, verbose, etc. Probably won&apos;t cover anything new. Hope folks enjoy reading it as much as I enjoyed writing it.]</p>\n<p>When I applied to medical school, I had to write a personal statement: selling how exceptional my achievements were, what wonderful personal qualities I had, and my noble motivations for wanting to be a doctor. The last of these is the most embarrassing in retrospect:</p>\n<blockquote>\n<p>I want to study medicine because of a desire I have to help others, and so the chance of spending a career doing something worthwhile I cannot resist. Of course, Doctors [sic] don&#x2019;t have a monopoly on altruism, but I believe the attributes I have lend themselves best to medicine, as opposed to all the work I could do instead.</p>\n</blockquote>\n<p>These &#x201C;I like science and I want to help people&#x201D; sentiments are common in budding doctors: when I recite this bit of my personal statement in a talk (generally as a self-flagellating opening gambit) I get a mix of laughs and groans of recognition &#x2013; most wrote something similar. The impression I get from those who have to&#xA0;<em>read</em>&#xA0;this juvenalia is the &#x201C;I like science and I want to help people&#x201D; wannabe doctor is regarded akin to a child zooming around on their bike with stabilizers &#x2013; an endearing work in progress. As they became seasoned in the blood sweat and tears of clinical practice, the vainglorious naivete will transform into a more grizzled, realistic, humane compassion.&#xA0;<a href=\"https://www.goodreads.com/quotes/520-the-mark-of-the-immature-man-is-that-he-wants\">Less dying nobly, more living humbly</a>; less JD, and more Perry Cox.</p>\n<p>I still have a long way to go.<a></a></p>\n<h1>A portrait of the altruist as a young man</h1>\n<p>My other interest back then was philosophy, so much so that it was a toss-up whether I should try and study medicine or philosophy. Along the way I read ethics, which led to utilitarianism, which led to Singer&#x2019;s &#x2018;<a href=\"http://www.utilitarian.net/singer/by/1972----.htm\">Famine, Affluence, and Morality</a>&#x2018;. I remember at the time thinking how austere and demanding it was, but after some wrestling with my conscience I decided it was the right thing to do. So at around the age of sixteen I decided I would devote my life towards making the world better: of course, that would mean giving lots of my money to charity; and of course I had to spend my life doing something important (I settled on curing AIDS as a suitably worthy goal); and so, of course, the rather painful to read personal statement above.</p>\n<p>I chose medicine, and kept philosophy around as an affectation during medical school. My altruistic zeal faded under the pressure of work. It took another philosophy book &#x2013;&#xA0;<a href=\"http://www.amazon.co.uk/Living-High-Letting-Die-Innocence/dp/0195108590\">Living High and Letting Die</a>&#xA0;(ironically bought at a charity shop) &#x2013; to prod these thoughts back into the front of my mind.</p>\n<p>The moral case made by Singer and Unger (and many others) has a simple summary. Very large numbers of people are suffering and dying from so-called &#x2018;diseases of poverty&#x2019; &#x2013; diseases that would be cured, or prevented, or ameliorated if only those afflicted could afford to. If you are rich &#x2013; which, relative to those suffering from diseases of poverty, virtually everyone reading this&#xA0;<em>will&#xA0;</em>be &#x2013; you&#xA0;<em>can</em>afford to. So you&#xA0;could give some of your money to help these people: you would still be very well off, and you&#x2019;d make some of them a lot better. Why not?</p>\n<p>Some soft numbers make the consequentialist case harder to resist. Although it is hard to estimate (on which more later) it is conservatively reckoned a few thousand pounds, given well, could save a child&#x2019;s life. It seems hard to pretend that&#xA0;<em>anyone&#x2019;s&#xA0;</em>few grand is worth more than a child&#x2019;s life: if we could choose between depriving Richard the rich person of a few thousand pounds worth of stuff (a couple of nice holidays, say) or depriving Pauline the pauper of her 2 year old child, the choice that should be made is obvious. Nothing morally relevant changes when the few thousand pounds are not Richard&#x2019;s but our own. Giving lots of our money away is thus a moral bargain, and few of us are taking advantage of it as much as we should.</p>\n<p>You needn&#x2019;t be a thoroughgoing consequentialist to accept this sort of reasoning. Singer et al. strive to show assent to much weaker moral principles (e.g. &#x201C;If you can secure a really great good for someone else via a much smaller sacrifice on your part, you ought to make this sacrifice&#x201D;) are enough to drive a much greater concern for charity. Besides, other ways of thinking converge here: perhaps one should give lots because it begins to&#xA0;<a href=\"https://www.givingwhatwecan.org/blog/2014-12-02/christianity-and-giving\">live up to Jesus&#x2019;s commandment to love your neighbour as yourself</a>&#xA0;&#x2013; I understand most world religions are similarly keen on charity; or perhaps one should give lots because what made us rich and made them poor is unjust, and giving goes part way to correcting this inequity &#x2013; perhaps it should even be viewed as reparations for prior colonial injustices; or perhaps something else.</p>\n<p>In any case, I renewed my faith in the &#x2018;giving lots&#x2019; principle of charity. It was around this time I first heard of&#xA0;<a href=\"https://www.givingwhatwecan.org/\">Giving What We Can</a>&#xA0;&#x2013; a group of people who were pledging to give 10% of their income to help beat global poverty. At the time I ignored them, because I thought (with the easy self-assured righteousness of someone living on their parents&#x2019; forbearance and government-subsidized credit) that 10%&#xA0;<em>wasn&#x2019;t enough</em>, and I was obviously going to give much more than that when I started earning &#x2013; conveniently a long time away.</p>\n<p>It took me a few more years to realize that Giving What We Can was for people planning to give 10%&#xA0;<em>or more</em>&#xA0;(and indeed the guy who set it up&#xA0;<a href=\"http://www.bbc.co.uk/news/magazine-11950843\">was doing just that</a>), and there might be benefits to joining a community of such people, and trying to encourage others to do what I was planning to. So I joined up in 2012 or so, generally made a nuisance of myself both in my local university group and the wider organization, and looked forward to completing medical school and having a salary to start practicing&#xA0;<a href=\"http://www.tcs.cam.ac.uk/comment/0013318-why-im-giving-10-of-my-income-to-charity.html\">what I had been preaching interminably</a>.</p>\n<h1>My Giving</h1>\n<p>N.B: This section is going to talk about how much I have given to charity. This violates norms about it being bad, or immodest, or self-aggrandizing to talk about ones charitable giving:&#xA0;<a href=\"http://en.wikipedia.org/wiki/Matthew_6:3\">Let not thy left hand know what thy right hand doeth</a>, etc.&#xA0;My intent in doing so is to&#xA0;<a href=\"http://www.tcs.cam.ac.uk/?p=0025508\">encourage more charitable giving</a>, to normalize bolder efforts at charity &#x2013; and, besides, I don&#x2019;t take what I am doing to be particularly praiseworthy. If you&#x2019;re unsatisfied at this defense, accept my apology, and feel free to scroll through.</p>\n<p>I&#x2019;m writing this after around 18 months of being a doctor, and thus 18 months of earning a salary.</p>\n<p>Last academic year (Aug &#x2019;13 to Jul &#x2019;14) I earned &#xA3;33,214 and gave &#xA3;10,836, about a third of my (pre-tax) income. I put a spreadsheet of my giving&#xA0;<a href=\"https://docs.google.com/spreadsheets/d/1gVx43MTO2yvMNukL2WUp7LOORlIVMcf6SCDcIpX4feQ/edit?usp=sharing\">here</a>: I didn&#x2019;t give anything at first as I wanted to buy various bits and pieces for my medical career, but steadily ramped up my giving as I found I could afford to give quite a lot &#x2013; in the last few months I was giving just over half my money away. Although I do not have such good figures for the first six months of the current academic year thanks to various administrivia, I intend to stick with&#xA0;<a href=\"http://www.jefftk.com/p/giving-half\">giving around half</a>, and will be giving several thousand pounds of my (now slightly larger) salary towards this end.</p>\n<p>What am I giving to, exactly? When I joined Giving What We Can, I found out that giving smart was as important as giving lots. My naive assumption was that there wasn&#x2019;t much to choose between different interventions: Tuberculosis, Malaria, HIV, starvation (and many more) are all awful things, so it made little difference which particular horror one&#x2019;s money was directed against. The data proved me wrong: different interventions tackling&#xA0;<em>the same disease</em>&#xA0;can&#xA0;<a href=\"https://www.givingwhatwecan.org/research/charities-area/hivaids\">vary in efficacy by&#xA0;<em>orders of magnitude</em></a>, and so there are vast dividends to finding the most effective interventions, and the most effective charities. Happily, both Giving What We Can and another group called&#xA0;<a href=\"http://www.givewell.org/\">Givewell</a>&#xA0;tackle this very hard question, and reassuringly their recommendations&#xA0;<a href=\"https://www.givingwhatwecan.org/top-charities\">align</a>&#xA0;<a href=\"http://www.givewell.org/charities/top-charities\">closely</a>. So about half of my money goes into a charitable trust run by Giving What We Can, which in turn distributes it to these extremely high performing charities.&#xA0;<a title=\"For those interested in how this is distributed via the trust: you can instruct the trust to give to charities it includes in whatever proportions you see fit.&#xA0;I have stipulated the trust distributes my money in proportion to the other charities the trust dispenses funds to &#x2013; so if half the money given via the trust goes to the Against Malaria Foundation and the other half to Deworm the World, then my donation is split 50:50 between the two (and mutatis mutandis&#xA0;to whatever the actual balance of contributions actually are). The underlying idea is to exploit peer knowledge. Although one can identify what look like very high performing charities, picking between these for the very highest &#x2018;value for money&#x2019; is hard, on which sensible people disagree. I don&#x2019;t back myself to have a better insight than they, but I can apply an &#x2018;equal-weight&#x2019; type view and so try and follow the weighted sum of sensible opinion, which should be closer to the mark than my own guessing. The closest financial analogy would be an index fund.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-1\"><sup>1</sup></a></p>\n<p>The other half is directed to more &#x2018;behind the scenes&#x2019; work. Answering the &#x2018;what does the most good?&#x2019; question is extremely hard, and rides on top of several other extremely hard questions, yet getting better answers&#xA0;<a href=\"https://www.givingwhatwecan.org/blog/2012-10-27/estimating-the-effectiveness-of-dcp2\">could be extremely valuable</a>. So last year the other half was given to&#xA0;<a href=\"http://www.fhi.ox.ac.uk/research/global-priorities-project/\">funding research into these questions</a>.&#xA0;I plan to do the same sort of thing this year: half of my giving towards effective charities, and the other half aimed at &#x2018;behind the scenes&#x2019; work, in the hope this will lead to even better outcomes (and more donations!) further down the road.&#xA0;<a title=\"Another possibility, given how helpful I have found this way of thinking about things for myself, is the fund efforts to spread the word more widely. I&#x2019;m not sure yet.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-2\"><sup>2</sup></a></p>\n<h1>I&#x2019;m no Superman</h1>\n<p>N.B. This section is going to talk (among other things) about how wealthy I am. Similar to above, I know doing so is unseemly, but I think the ends justify the means. Again, apologies if I am wrong, and feel free to skip.</p>\n<p>When people find out how much I&#x2019;m giving, they tend to react with either admiration (one Buddhist FY1 I know said it was &#x2018;amazing&#x2019;, and that it would earn me great merit for my next life &#x2013; here&#x2019;s hoping!); consternation (in the words of one medical registrar: &#x201C;It really upsets me how much you&#x2019;re giving. Promise me you&#x2019;ll stop.&#x201D;);&#xA0;or, perhaps most commonly, cynicism (&#x201C;You&#x2019;ll change your tune when you get a mortgage/have kids/you have to deal with your wife&#x2019;s shoe budget etc.&#x201D;). I don&#x2019;t think any of these attitudes are quite right.</p>\n<p>I am giving a larger proportion than the average household in the UK (around 0.5% of gross income)<a title=\"I couldn&#x2019;t find a direct source of this, so I had to calculate it myself, which is more error prone. The average weekly donation per household (in 2008) was &#xA3;2.42, giving a yearly donation of &#xA0;&#xA3;126.27. Average gross individual income was &#xA3;26,800, which means a somewhat overestimate of proportion would be 126.27/26,800, or 0.47%\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-3\"><sup>3</sup></a>&#xA0;but I&#x2019;m also earning a lot more: I doubt my accounting is perfect, but a salary of &#xA3;33,000-ish last year puts me into the&#xA0;<a href=\"http://en.wikipedia.org/wiki/Income_in_the_United_Kingdom#Percentile_points_for_income_of_individuals_before_tax\">top 25% of UK individuals by income</a>, and well above the&#xA0;<a href=\"http://www.ons.gov.uk/ons/dcp171776_341133.pdf\">UK median household income of ~&#xA3;23,200</a>&#xA0;&#x2013; and, unlike many UK households, I don&#x2019;t have children or adult dependents to look after.&#xA0;<a title=\"Although, in fairness, the Office of National Statistics try and account for this via equivalisation.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-4\"><sup>4</sup></a></p>\n<p>This inequity is starker on a global scale: Britons are much richer than most of the world.&#xA0;<a title=\"People often remark, &#x201C;Yeah, but this isn&#x2019;t a fair comparison, because your money would go a lot further in the developing world&#x201D;. That&#x2019;s true, but this effect is already accounted for by purchasing parity adjustment. So a graph like this would be even more starkly iniquitous if &#x2018;real&#x2019; income was used.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-5\"><sup>5</sup></a>&#xA0;My post tax income of ~&#xA3;26,295 puts me into the top&#xA0;<em>3%</em>&#xA0;of people by wealth, and&#xA0;<em>24.7</em>&#xA0;times richer than the average person on the planet (you can run your own numbers&#xA0;<a href=\"https://www.givingwhatwecan.org/get-involved/how-rich-am-i\">here</a>).</p>\n<p>It is a bit tricky to work out exactly where I stand &#x2018;post giving&#x2019; given Gift Aid etc., but I&#x2019;m still probably above median in the UK, and comfortably in the top decile globally. Medical salaries increase with seniority, so, even if I continue giving half, my position in the global pecking order will improve still further. So even&#xA0;<em>after</em>&#xA0;my giving, I am still earning more than the average &#x2018;man on the street&#x2019; where I live, and&#xA0;<em>many, many times</em>&#xA0;more than the average person alive today.</p>\n<p>This partly explains why I don&#x2019;t feel poorly off or destitute. There are other parts. One is that&#xA0;<a href=\"https://prezi.com/_azcgt_nucbe/giving-and-happiness-final/\">giving generally makes you happier</a>, and often more happier than buying things for yourself. Another is that I am fortunate in non-monetary respects: my biggest medical problem is dandruff, I have a loving family, a wide and interesting circle of friends, a fulfilling job, an e-reader which I can use to store (and occasionally read) the finest works of western literature, an internet connection I should use for better things than loitering on social media, and so on, and so on, and so on. I am blessed beyond all measure of desert.</p>\n<p>So I don&#x2019;t think that my giving has made me &#x2018;worse off&#x2019;. If you put a gun to my head and said, &#x201C;Here&#x2019;s the money you gave away back. You&#xA0;<em>must</em>&#xA0;spend it solely to further your own happiness&#x201D;, I probably wouldn&#x2019;t give it away: I guess a mix of holidays, savings, books, music and trips to the theatre might make me even happier (but who knows? people are bad at affective forecasting). But I&#x2019;m pretty confident giving has made me happier compared to the case where I never had the money in the first place. So the downside looks like, &#x201C;By giving, I have made myself even happier from an already very happy baseline, but foregone opportunities to give myself a larger happiness increment still&#x201D;. This seems a trivial downside at worst, and not worth mentioning across the scales from the upside, which might be several lives saved, or a larger number of lives improved and horrible diseases prevented.</p>\n<p>I agree with the cynics that these sorts of &#x2018;sacrifices&#x2019; are pretty easy when you are as unjustly privileged as I am. And of course my circumstances might change: maybe my good run is interrupted by some misfortune, or (as I hope is more likely) maybe &#x2018;life gets in the way&#x2019; &#x2013; marriage, kids, and middle England might come knocking. If things change, then they change &#x2013; although I hope in the latter case I could follow examples of&#xA0;<a href=\"http://www.theguardian.com/theguardian/2011/dec/24/toby-ord-bernadette-young-joy-of-giving\">Toby Ord and Bernadette Young</a>, or&#xA0;<a href=\"http://www.givinggladly.com/\">Julia Wise</a>&#xA0;and&#xA0;<a href=\"http://www.jefftk.com/giving\">Jeff Kaufmann</a>&#xA0;in terms of combining a family with charitable giving. But in the meanwhile, I plan to make the best of my current lot.</p>\n<h1>A tale of two sickies</h1>\n<p>The &#x201C;I like science and I want to help people&#x201D; sentiment tends to go hand-in-hand with a romanticized image of what medicine is and what doctors do: saving lives every episode of your own private medical melodrama, the patients and their suffering hand-picked as if by the patron saint of the vainglorious to be strewn in front of you as your own Potemkin vale of soul-making&#xA0;<a title=\"Doctors were the most self-righteous people on earth, Schwartz thought. Healthy and wealthy themselves, surrounded by the sick and dying &#x2014; it made them feel invincible, and feeling invincible made them pricks. They thought they understood suffering because they saw it every day. They didn&#x2019;t understand shit. Chad Harbach,&#xA0;The Art of Fielding.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-6\"><sup>6</sup></a>, and the self-indulgent moaning of working unpaid overtime and being exhausted but deep down you&#x2019;re okay with it because you&#x2019;re&#xA0;<em>making a difference</em>.</p>\n<p>In reality, expansion of morbidity and other doctors assiduously picking low-hanging fruit for their patients makes medical practice, to a first approximation, either trying to snatch glimpses of better health for those with chronic, deteriorating conditions medical science cannot cure, or extremely risk-adverse screening to pick up, among those who are essentially well, the unfortunate few who really need help. You generally don&#x2019;t save lives, especially if you&#x2019;re junior, because there&#x2019;s a long hierarchy of supervising doctors who are poised to leap in and save the day in case you don&#x2019;t.</p>\n<p>In 18 months of being a doctor, I can point to one instance where I maybe &#x2013;&#xA0;<em>maybe</em>&#xA0;&#x2013; saved someone&#x2019;s life. She was 92, on a respiratory ward for pneumonia, and had suddenly become breathless on a background of on-again, off-again chest pain. She was compromised, her chest sounded wet, and the X-ray showed fluid on the lungs, and the bloods later demonstrated a heart attack. I was on call, and the medical registrar (generally the guardian angel of the hospital wards, especially when you&#x2019;re a shit-scared first year) was with an even sicker patient. I sprung into action: oxygen, morphine, GTN, CPAP, relatives, forlorn call to ITU to confirm that ward-based treatment was the ceiling of care &#x2013; in other words, if this didn&#x2019;t work, they wouldn&#x2019;t take her, and she would die.</p>\n<p>Happily, it worked, and she got better in the next couple of hours, and went home well a while later. Could I really say I saved her life? At the very least I have to share credit with the nurses and assistants who readied all the kit and administered all the drugs I&#x2019;d prescribed, not to mention being astute enough to see she was really unwell and demanding the doctor come quickly. Credit diffuses further if we include (and we should) all the people who were needed for her to recover and leave hospital: her usual team of doctors, and the specialists who reviewed her, several teams of nursing staff on two different wards, physiotherapists, occupational therapists, pharmacists, and many more. Besides, maybe all my panicked doctoring was coincidental to her getting better by herself; and even if the doctoring was vital, maybe another doctor could have stepped into the breach in time had I not been able to do it myself.</p>\n<p>So the total &#x2018;QALY yield&#x2019; for my &#x2018;life saving&#x2019; was not that high, especially when we add in that at 92 this lady&#x2019;s expected lifespan is fairly short even if she returns to good health. Of course, I did other things in the last 18 months: I could brag about (in ascending order of frequency) some atypically astute diagnoses, performing some tricky practical procedures, prescribing analgesia, and marshalling paper work as some other &#x2018;QALY positive&#x2019; things to add to the sum total of my good deeds.&#xA0;In sum, thought, it probably isn&#x2019;t that much &#x2013; as all the caveats to my &#x2018;saving a life&#x2019; apply here.</p>\n<p>Besides, the life-saving isn&#x2019;t the thing I am most proud of in my nascent medical career. It&#x2019;s this:</p>\n<p>My first rotation was on a general medical ward. One of the patients was mid eighties admitted after a fall. He had a long list of co-morbidities, amongst them vascular dementia. Medically, he was making an unremarkable recovery, but he was upset and morose: as he kept saying, he had been with his wife for 60 years, and was lost without her. Each bed (including his) had a phone which could be used with cards bought in the corridor outside, and the ward phone was only five meters from his bed. Both were several steps too far for his severely impaired cognition: he had a digit span of 3 at best, did not remember how to operate a phone, and had a shaky grasp of where he was and why his wife wasn&#x2019;t there.</p>\n<p>It took a couple of days for me to realize I could help him out. I promised I would help him talk to his wife, but I forgot him&#xA0;amongst the other patients. The day after he told me again how how lonely he was, how much he wanted to be with his wife, how they had been married for sixty years&#x2026; he had forgotten my promise, but it reminded me.</p>\n<p>Stung by my failing, I got to work. I checked with the ward clerk that the patient&#x2019;s phones could receive calls (they could). I noted his number down from his bedside. I found his wife&#x2019;s number from his medical notes, and phoned her. She was also frail (although faculties intact) and recovering from her&#xA0;<em>own</em>&#xA0;fall at their home, and so could not easily visit, although she hoped to as soon as she was able. I gave her his number, and suggested she call it now. I loitered by his bed for a couple of minutes until the phone rang, and I handed it to him. He thanked me tearfully the day after.</p>\n<h1>Chequebooks and stethoscopes</h1>\n<p>Anecdotes make unreliable data&#xA0;<a title=\"Aside: Although they are data, thus the adage &#x201C;The plural of anecdote is not data&#x201D;, is &#x2013; sensu stricto &#x2013; false. That said, people generally over-interpret and overweigh &#x2018;anecdata&#x2019;, and so the implied norm of being cautious using it is wise.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-7\"><sup>7</sup></a>; in the world of evidence based medicine,&#xA0;<a href=\"http://www3.mdanderson.org/library/evidence-based/img/pyramid.gif\">the greatest weight is given</a>&#xA0;to systematic reviews, meta-analyses, and randomized controlled trials, whilst &#x2018;expert opinion&#x2019; is right at the bottom &#x2013; I would be still lower.</p>\n<p>Although the &#x2018;hard data&#x2019; on how much good doctors really do is hard to come by, I have found it even more sobering than the many times experience have formed parables about the limits and oversights of technocratic medicine.</p>\n<p>The only published&#xA0;<a href=\"http://ije.oxfordjournals.org/content/30/6/1260.long\">attempt</a>&#xA0;I know was by Bunker, an epidemiologist. His strategy was looking at trial data to look at the impact of the most common medical interventions, and then extrapolating them to the population. Medicine turns out pretty well &#x2013; it can take credit for a few of the many years added to life expectancy in the developed world since the turn of the last century. Playing with some numbers, you can get a fairly good-sounding estimate of the impact of a doctor like me over their career: ~2500 QALYs.&#xA0;<a title=\"QALY &#x2013; Quality-adjusted life year, a subset of health adjusted life years. The idea is to produce a unified metric of health that can be used to compare diseases (and their treatments) to one another. Calculating the &#x2018;life year&#x2019; part is relatively simple: look at how how diseases shorten life, and how well a treatment lengthens it, on average. The &#x2018;Quality adjustment&#x2019; is harder: one tries to come up with &#x2018;weights&#x2019; for given disabilities to see how much worse they are to live with than perfect health (so if blindness was weighed at 0.5, then 2 years of blindness are about as good as one year of healthy life). Techniques for getting weightings vary, and are admittedly far from perfect. They are probably better than other candidates for weighing health, hence their wide adoption by national and global health organizations.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-8\"><sup>8</sup></a></p>\n<p>Bunker freely admitted these estimates are &#x201C;more than speculative and less than precise&#x201D;. They are also systemically optimistic, and the means of deriving from them an individual doctor&#x2019;s impact even more so. We know trial data&#xA0;<a href=\"http://ije.oxfordjournals.org/content/30/6/1263.full\">overestimates</a>&#xA0;the benefit of treatment when &#x2018;out in the wild&#x2019; of clinical practice. It is also obvious that doctors can&#x2019;t take sole credit for medicine (what about nurses, pharmacists, porters, and, well, everyone else?); that the relationship between doctors and health is confounded (what about better education, wealth, hygiene, and the other&#xA0;<a href=\"http://en.wikipedia.org/wiki/Social_determinants_of_health\">social determinants of health</a>?); that doctors should have diminishing marginal turns, and be&#xA0;<a href=\"https://80000hours.org/2014/07/what-does-economics-tell-us-about-replaceability/\">replaceable</a>&#xA0;&#x2013; if I was never a doctor, there would not be a &#x2018;Greg shaped hole&#x2019; in the national health service.</p>\n<p>A better analysis would try and correct for confounders, try and account for diminishing returns, and maybe look at macro measures of health disease and their relationships to doctor numbers. I couldn&#x2019;t find that, so I&#xA0;<a href=\"http://www.thepolemicalmedic.com/how-many-lives-does-a-doctor-save/\">tried</a>&#xA0;to do it&#xA0;<a href=\"http://www.thepolemicalmedic.com/why-doctors-dont-do-much-good/\">myself</a>. The bottom line is bad news for medics (but perhaps better news for everyone else!) The &#x2018;QALY impact&#x2019; of a medical career is not ~2500 QALYs, but maybe ~150, and as the data and methods improve, the numbers get smaller still (I hope it never goes negative&#x2026;) Rather than saving lives every episode, one is adding a few years of life every year.</p>\n<p>The comparison to charity is humbling. The &#x2018;cost per QALY&#x2019; of a leading charity (such as the Against Malaria Foundation) may lie around ~&#xA3;60/QALY. So the good of my medical career is approximately the same as &#xA3;9000, given well.&#xA0;<em>Pro rata</em>, it means a year is worth around &#xA3;240, each working day just over &#xA3;1. Not only can your chequebook beat my stethoscope, your&#xA0;<em>pocket change</em>&#xA0;can as well.&#xA0;<a title=\"People often object to consequentializing measures like QALYs as they inevitably don&#x2019;t capture all that really matters &#x2013; the benefit of letting my patient talk to his wife again is poorly captured by aggregate measures of health. It invites Dickensian satire: the&#xA0;Thomas Gradgrinds of good deeds, carefully moving beads along their moral abacuses without a humane grasp of what it means: &#x2018;Very well, then. He is a veterinary surgeon, a farrier and horsebreaker. Give me your definition of a horse.&#x2019; (Sissy Jupe thrown into the greatest alarm by this demand.) &#x2018;Girl number twenty unable to define a horse!&#x2019; said Mr. Gradgrind, for the general behoof of all the little pitchers. &#x2018;Girl number twenty possessed of no facts, in reference to one of the commonest of animals! Some boy&#x2019;s definition of a horse. Bitzer, yours.&#x2019; The square finger, moving here and there, lighted suddenly on Bitzer, perhaps because he chanced to sit in the same ray of sunlight which, darting in at one of the bare windows of the intensely whitewashed room, irradiated Sissy. For, the boys and girls sat on face of the inclined plane in two compact bodies, divided up the centre by a narrow interval; and Sissy, being at the corner of a row on the other side, came in for the beginning of a sunbeam, of which Bitzer, being at the comer of a row on the other side, a few rows in advance, caught the end. But, whereas the girl was dark-eyed and dark-haired, that she seemed to receive a deeper and more lustrous colour from the sun when it shone upon her, the boy was so light-eyed and light-haired that the self-same rays appeared to draw out of him what little colour he ever possessed. His cold eyes would hardly have been eyes, but for the short ends of lashes which, by bringing them into immediate contrast with something paler than themselves, expressed their form. His shortcropped hair might have been a mere continuation of the sandy freckles on his forehead and face. His skin was so unwholesomely deficient in the natural tinge, that he looked as though, if he were cut, he would bleed white. &#x2018;Bitzer,&#x2019; said Thomas Gradgrind. &#x2018;Your definition of a horse.&#x2019; &#x2018;Quadruped. Graminivorous. Forty teeth, namely twenty-four grinders, four eye-teeth, and twelve incisive. Sheds coat in the spring; in marshy countries, sheds hoofs, too. Hoofs hard, but requiring to be shod with iron. Age known by marks in mouth.&#x2019; Thus (and much more) Bitzer. &#x2018;Now girl number twenty,&#x2019; said Mr. Gradgrind. &#x2018;You know what a horse is.&#x2019; QALYs are imperfect, but they do count, and although a QALY measure of the good my medical career does fails to capture all of its value, it will similarly fail to capture the goods of high performing charity. Every death of a child from malaria has its own tragic story &#x2013; stories which we all too seldom hear. We err badly if we attend to how vivid&#xA0;goods and evils are to our imagination, rather than to their size; first responders to multiple casualty incident are told to&#xA0;ignore those who are screaming&#xA0;at first, but to look carefully for any people who are so desperately injured they cannot even cry for help. And if a common failing of doctors is to become drunk on their apostolic role and self-righteous power, looking at &#x2018;just the bare numbers&#x2019;, sobering as they are, may part-way provide a cure.\" href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#note-9-9\"><sup>9</sup></a></p>\n<h1>On saving the world</h1>\n<p>The seventeen year old who wanted to be a doctor should be disappointed: medicine has a modest impact on people living long and being healthy, and although an individual doctor may be the mechanism through which this modest impact flows, little of it depended on you.</p>\n<p>But doctor&#x2019;s don&#x2019;t have a monopoly on altruism, and the seventeen year old me who wanted to save the world would be overjoyed. The difference a doctor makes is significant, even if it is small in QALY terms; charity can make a large difference in QALY terms, and its &#x2018;real&#x2019; value is larger still. I have not lost out, and only benefited from thinking carefully and trying my best to make a difference &#x2013; hopefully (and expectedly) many others have benefited too. I&#x2019;d encourage anyone to start thinking harder about these matters, to&#xA0;<a href=\"http://www.effectivealtruism.org/\">get involved</a>, and to&#xA0;<a href=\"https://www.givingwhatwecan.org/get-involved/become-member\">give more</a>&#xA0;&#x2013; and better.</p>\n<p>I hope, after reading this, you do.</p>\n<div>\n<p>Notes:</p>\n<ol>\n<li>For those interested in how this is distributed via the trust: you can instruct the trust to give to charities it includes in whatever proportions you see fit.&#xA0;I have stipulated the trust distributes my money in proportion to the other charities the trust dispenses funds to &#x2013; so if half the money given via the trust goes to the Against Malaria Foundation and the other half to Deworm the World, then my donation is split 50:50 between the two (and&#xA0;<em>mutatis mutandis&#xA0;</em>to whatever the actual balance of contributions actually are). The underlying idea is to exploit peer knowledge. Although one can identify what look like very high performing charities, picking between these for the very highest &#x2018;value for money&#x2019; is hard, on which sensible people disagree. I don&#x2019;t back myself to have a better insight than they, but I can apply an &#x2018;equal-weight&#x2019; type view and so try and follow the weighted sum of sensible opinion, which should be closer to the mark than my own guessing. The closest financial analogy would be an index fund.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-1\">&#x21A9;</a></li>\n<li>Another possibility, given how helpful I have found this way of thinking about things for myself, is the fund efforts to spread the word more widely. I&#x2019;m not sure yet.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-2\">&#x21A9;</a></li>\n<li>I couldn&#x2019;t find a direct source of this, so I had to calculate it myself, which is more error prone. The average weekly donation per household (in 2008) was&#xA0;<a href=\"http://www.cgap.org.uk/uploads/Briefing%20Papers/CGAP%20BN7%20How%20generous%20is%20the%20UK.pdf\">&#xA3;2.42</a>, giving a yearly donation of &#xA0;&#xA3;126.27. Average gross&#xA0;<a href=\"http://en.wikipedia.org/wiki/Income_in_the_United_Kingdom\"><em>individual</em>&#xA0;income was &#xA3;26,800</a>, which means a somewhat overestimate of proportion would be 126.27/26,800, or 0.47%&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-3\">&#x21A9;</a></li>\n<li>Although, in fairness, the Office of National Statistics try and account for this via&#xA0;<a href=\"http://en.wikipedia.org/wiki/Equivalisation\">equivalisation</a>.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-4\">&#x21A9;</a></li>\n<li>People often remark, &#x201C;Yeah, but this isn&#x2019;t a fair comparison, because your money would go a lot further in the developing world&#x201D;. That&#x2019;s true, but this effect is already accounted for by purchasing parity adjustment. So a graph like&#xA0;<a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/world-income-distribution.png\">this</a>&#xA0;would be even more starkly iniquitous if &#x2018;real&#x2019; income was used.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-5\">&#x21A9;</a></li>\n<li>\n<p>&#xA0;</p>\n<blockquote>\n<p>Doctors were the most self-righteous people on earth, Schwartz thought. Healthy and wealthy themselves, surrounded by the sick and dying &#x2014; it made them feel invincible, and feeling invincible made them pricks. They thought they understood suffering because they saw it every day. They didn&#x2019;t understand shit.</p>\n</blockquote>\n<p>Chad Harbach,&#xA0;<em>The Art of Fielding</em>.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-6\">&#x21A9;</a></p>\n</li>\n<li>Aside: Although they&#xA0;<em>are</em>&#xA0;data, thus the adage &#x201C;The plural of anecdote is not data&#x201D;, is &#x2013;&#xA0;<em>sensu stricto</em>&#x2013; false. That said, people generally over-interpret and overweigh &#x2018;anecdata&#x2019;, and so the implied norm of being cautious using it is wise.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-7\">&#x21A9;</a></li>\n<li><a href=\"http://en.wikipedia.org/wiki/Quality-adjusted_life_year\">QALY</a>&#xA0;&#x2013; Quality-adjusted life year, a subset of health adjusted life years. The idea is to produce a unified metric of health that can be used to compare diseases (and their treatments) to one another. Calculating the &#x2018;life year&#x2019; part is relatively simple: look at how how diseases shorten life, and how well a treatment lengthens it, on average. The &#x2018;Quality adjustment&#x2019; is harder: one tries to come up with &#x2018;weights&#x2019; for given disabilities to see how much worse they are to live with than perfect health (so if blindness was weighed at 0.5, then 2 years of blindness are about as good as one year of healthy life). Techniques for getting weightings vary, and are admittedly far from perfect. They are probably better than other candidates for weighing health, hence their wide adoption by national and global health organizations.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-8\">&#x21A9;</a></li>\n<li>People often object to consequentializing measures like QALYs as they inevitably don&#x2019;t capture all that really matters &#x2013; the benefit of letting my patient talk to his wife again is poorly captured by aggregate measures of health. It invites Dickensian satire: the&#xA0;<a href=\"https://www.mtholyoke.edu/acad/intrel/hardtime.htm\">Thomas Gradgrind</a>s of good deeds, carefully moving beads along their moral abacuses without a humane grasp of what it means:\n<p>&#xA0;</p>\n<blockquote>\n<p>&#x2018;Very well, then. He is a veterinary surgeon, a farrier and horsebreaker. Give me your definition of a horse.&#x2019;</p>\n<p>(Sissy Jupe thrown into the greatest alarm by this demand.)</p>\n<p>&#x2018;Girl number twenty unable to define a horse!&#x2019; said Mr. Gradgrind, for the general behoof of all the little pitchers. &#x2018;Girl number twenty possessed of no facts, in reference to one of the commonest of animals! Some boy&#x2019;s definition of a horse. Bitzer, yours.&#x2019;</p>\n<p>The square finger, moving here and there, lighted suddenly on Bitzer, perhaps because he chanced to sit in the same ray of sunlight which, darting in at one of the bare windows of the intensely whitewashed room, irradiated Sissy. For, the boys and girls sat on face of the inclined plane in two compact bodies, divided up the centre by a narrow interval; and Sissy, being at the corner of a row on the other side, came in for the beginning of a sunbeam, of which Bitzer, being at the comer of a row on the other side, a few rows in advance, caught the end. But, whereas the girl was dark-eyed and dark-haired, that she seemed to receive a deeper and more lustrous colour from the sun when it shone upon her, the boy was so light-eyed and light-haired that the self-same rays appeared to draw out of him what little colour he ever possessed. His cold eyes would hardly have been eyes, but for the short ends of lashes which, by bringing them into immediate contrast with something paler than themselves, expressed their form. His shortcropped hair might have been a mere continuation of the sandy freckles on his forehead and face. His skin was so unwholesomely deficient in the natural tinge, that he looked as though, if he were cut, he would bleed white.</p>\n<p>&#x2018;Bitzer,&#x2019; said Thomas Gradgrind. &#x2018;Your definition of a horse.&#x2019;</p>\n<p>&#x2018;Quadruped. Graminivorous. Forty teeth, namely twenty-four grinders, four eye-teeth, and twelve incisive. Sheds coat in the spring; in marshy countries, sheds hoofs, too. Hoofs hard, but requiring to be shod with iron. Age known by marks in mouth.&#x2019; Thus (and much more) Bitzer.</p>\n<p>&#x2018;Now girl number twenty,&#x2019; said Mr. Gradgrind. &#x2018;You know what a horse is.&#x2019;</p>\n</blockquote>\n<p>QALYs are imperfect, but they do count, and although a QALY measure of the good my medical career does fails to capture all of its value, it will similarly fail to capture the goods of high performing charity. Every death of a child from malaria has its own tragic story &#x2013; stories which we all too seldom hear. We err badly if we attend to how&#xA0;<em>vivid</em>&#xA0;goods and evils are to our imagination, rather than to their size; first responders to multiple casualty incident are told to&#xA0;<em>ignore&#xA0;</em>those who are screaming&#xA0;at first, but to look carefully for any people who are so desperately injured they cannot even cry for help. And if a common failing of doctors is to become drunk on their apostolic role and self-righteous power, looking at &#x2018;just the bare numbers&#x2019;, sobering as they are, may part-way provide a cure.&#xA0;<a href=\"http://www.thepolemicalmedic.com/saving-the-world-and-healing-the-sick/#return-note-9-9\">&#x21A9;</a></p>\n</li>\n</ol></div></body></html>", "user": {"username": "Gregory_Lewis"}}, {"_id": "pqRGTZsYy2bM44bBc", "title": "Animal Charity Evaluators is hiring", "postedAt": "2015-02-12T00:30:58.076Z", "htmlBody": "<html><body><div><img src=\"https://www.animalcharityevaluators.org/wp-content/uploads/2015/02/referral_long.png\" alt=\"Employee Referral Poster\"></div>\n<p>As you may know, Animal Charity Evaluators is currently seeking applications for a <a title=\"Researcher Job Description\" href=\"http://www.animalcharityevaluators.org/wp-content/uploads/2015/02/ACEResearcherjobdescription_2014.pdf\">researcher position</a>. We&#x2019;ve already received some great responses, and will continue to accept new <a title=\"Researcher Position Application\" href=\"http://www.animalcharityevaluators.org/researcher-position-application/\">applications</a> through the end of the month.</p>\n<p>However, we&#x2019;ve historically received high quality applicants from referrals, and especially from the EA community, so we&#x2019;re taking an extra step to accentuate the importance of thinking about possible candidates from your own personal network. To that end, we&#x2019;re excited to offer a $1,000 donation to the animal charity of your choice if you refer a candidate to us that we otherwise didn&#x2019;t know about but end up hiring for the position.</p>\n<p>Please take the time to think if anyone in your network is a good fit for this position. We&#x2019;re looking forward to taking our evaluative work to the next level, and appreciate your support in helping us find the best possible candidate.</p>\n<p>If you would like more information, feel free to <a title=\"erika.alonso@animalcharityevaluators.org\" href=\"mailto:erika.alonso@animalcharityevaluators.org\">contact me</a> anytime!</p></body></html>", "user": {"username": "erikaalonso"}}, {"_id": "ks4aQ8TBK4gEd22AC", "title": "4 Common (Hedonic) Prediction Failures and How to Fix Them", "postedAt": "2015-02-11T23:36:13.668Z", "htmlBody": "<html><body><p><em>Crossposted from <a href=\"http://rationality.org/blog/\">CFAR&apos;s blog</a> about the errors we make in hedonic prospecting. It was based on Gilbert and Wilson&apos;s 2007 review article of the topic.&#xA0;</em></p>\n<p>&#xA0;</p>\n<p>Our predictions fail in predictably bad ways. Picture the last time you were getting ready to leave the house and you were asked how much longer you would take. And when was the last time you actually left by then? You might be better at this than I am, but I have struggled with forecasting how long it will take. My dad used to account for this, and pretended we needed to leave 15 minutes before we actually did. Without knowing, my dad was accounting for Hofstadter&apos;s Law:</p>\n<blockquote>It always takes longer than you expect, even when you take into account Hofstadter&apos;s Law.</blockquote>\n<p>&#x2014; Douglas Hofstadter, G&#xF6;del, Escher, Bach: An Eternal Golden Braid</p>\n<p>What does it matter if we haven&#x2019;t left on time? That might well be sometimes inconsequential. But leaving on time is easy compared to plenty of other predictions you need to make, that <em>do</em> matter. How much will I enjoy my new job? Should I move to sunny California? Should I buy that lottery ticket? Psychological science has made a lot of progress in determining where we systematically make inaccurate predictions. So where do we stumble?</p>\n<h2>1. Simulations are unrepresentative</h2>\n<p>We tend extrapolate from tiny bits of data that are unrepresentative: We characterize an experience by its worst elements, and predict on that basis. For example, when people are asked to imagine missing a train in the future, they tend to remember their worst train-missing experience rather than their typical train-missing experience. They picture missing their train before that important meeting they had and being lambasted by their boss, not every other time they just caught the next one in a few minutes. The converse is also true: We idealize &#x2018;good&#x2019; experiences by predicting, for instance, that moving to sunny California would change our lives, when, really, weather is only a small part of what makes us happy. Everyone remembers their best day, their worst day, and their yesterday.</p>\n<h2><strong>2. Simulations are essentialized</strong></h2>\n<p>We often only remember what we see as the essential pieces of an experience, not everything surrounding it. Participants asked about a recent theater experience, they only remembering the theater as being what&apos;s on stage, not the cold, the parking, the noise, and the interlude. Because accurate predictions are contingent on accurate memories, it&#x2019;s hard to get the final step right if the first one is in the wrong direction. Simulations of events omit inessential features, and people tend to predict that good events will be better and bad events will be worse than they actually turn out to be.</p>\n<h2><strong>3. Simulations are abbreviated</strong></h2>\n<p><a> </a> Only thinking about a small portion of the experience can also get us into trouble. How happy would you be if you were to win the lottery? Ecstatic, right? What about 6 months down the track? Still incredibly happy, I&#x2019;m guessing? When Daniel Gilbert took a sample of people who had this happen to them, he found their happiness to be back at baseline within a few months, with a minor blip in between <a href=\"#[1]\">[1]</a>. So why is this? Turns out when you&#x2019;re predicting, you only think of day 1, not day 277 and we humans are remarkably good at adapting to our circumstances.</p>\n<h2><strong>4. Simulations are decontextualized</strong></h2>\n<p><a> </a> When the context in which you make your prediction differs from the context of the event, problems arise. For instance, Gilbert, Gill, and Wilson <a href=\"#[2]\">[2]</a> found that hungry people predict they&apos;d like spaghetti for breakfast, while sated people predict they&apos;d dislike it for dinner. As you might have guessed, and running thematically with the rest of this article, they weren&#x2019;t very good at getting it right. Hungry participants overrated their enjoyment of a spaghetti breakfast, and full participants underrated their enjoyment of a spaghetti dinner.</p>\n<h2><strong>So, what can we do about them?</strong></h2>\n<p>Daniel Gilbert and Timothy Wilson, academic psychologists who research this area, recommend we pretend the event is happening tomorrow and thinking through events hour per hour. So a nebulous desire of moving to California turns into thinking what will be different in every hour of waking up, getting ready, commuting, working, eating etc. And the difference might not amount to that much. This, he reasons, assists in making our predictions more concrete. Similarly, on a smaller scale, we can break everything down into its constituent steps. Think through each step of what you&#x2019;ll be doing, and try to avoid relying on your brain&apos;s associations with whole events. In an attempt to make decisions when you might be feeling differently, consider specific factors that might be altering your decision and account for them, or try to defer decision to when you&apos;re in a similar state. We should try, Gilbert recommends, shopping when you&#x2019;re not feeling so hungry, or pre-committing to doing that study before you change your mind, for instance.</p>\n<p>Can you predict how successful you&#x2019;ll be able to influence your predictions?</p>\n<p>&#xA0;</p>\n<h2><strong>Notes</strong></h2>\n<p><a>[1]</a>&#xA0;Gilbert, D. T., et al. (2002). &quot;The future is now: Temporal correction in affective forecasting.&quot; Organizational Behavior and Human Decision Processes 88(1): 430-444. <a title=\"http://www.sciencedirect.com/science/article/pii/S0749597801929826\" href=\"http://www.sciencedirect.com/science/article/pii/S0749597801929826\">http://www.sciencedirect.com/science/article/pii/S0749597801929826</a> <a href=\"#up1\">&#x2934;</a></p>\n<p><a>&#xA0;[2]&#xA0;</a>Gilbert, D. T. and T. D. Wilson (2007). &quot;Prospection: Experiencing the future.&quot; Science 317(5843): 1351-1354. <a title=\"http://www.sciencemag.org/content/317/5843/1351.full\" href=\"http://www.sciencemag.org/content/317/5843/1351.full\">http://www.sciencemag.org/content/317/5843/1351.full</a> <a href=\"#up2\">&#x2934;</a></p></body></html>", "user": {"username": "Peter McIntyre"}}, {"_id": "CsqnaotQsNvdfdeTs", "title": "Meetup : Effective Altruism Madison: Documentary + Dinner", "postedAt": "2015-02-10T16:44:39.346Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/25\">Effective Altruism Madison: Documentary + Dinner</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>22 February 2015 04:00:00PM (-0600)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>944 Williamson Street, Madison, WI</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Sunday, Feb 22</p>\n\n<p>-Documentary (&quot;Pink Ribbons, Inc.&quot;) at 4pm at Anne&apos;s house (text/call 505-550-8171 for address)</p>\n\n<p>-Dinner at 6pm at Bahn Thai (944 Williamson Street)</p>\n\n<p>Feel free to come to either or both! Let me know if you&apos;re coming to dinner though so I can make a reservation (gstuessy@gmail.com)</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/25\">Effective Altruism Madison: Documentary + Dinner</a></h2></body></html>", "user": {"username": "Gina_Stuessy"}}, {"_id": "jyznuc2ia8RLEThW2", "title": "[LINK] GiveWell is hiring", "postedAt": "2015-02-10T11:31:43.530Z", "htmlBody": "<html><body><p>From their <a href=\"http://blog.givewell.org/2015/02/05/givewell-is-hiring-3/\">blog post</a>:<br><br>We&#x2019;re resuming hiring to expand our ability to identify outstanding giving opportunities. Filling the roles below would make a substantial difference to our research.<br><br>If you follow GiveWell and want to help us out, please share this post with anyone whom you think might be a good fit for the jobs listed below.</p>\n<ul>\n<li>&#xA0;&#xA0;&#xA0; Research Analyst. Research Analysts are GiveWell&#x2019;s primary staff and work on all parts of our research process. We hope to add a few entry-level research analysts this year, and are open to hiring individuals later in their career.</li>\n<li>&#xA0;&#xA0;&#xA0; Summer Research Analyst. We offer summer positions to students entering their final year of undergraduate or graduate school with the hopes that they will become full-time employees following graduation.</li>\n<li>&#xA0;&#xA0;&#xA0; Outreach Associate. Outreach Associate is a new position we&#x2019;re hiring for. The role will have some overlap with that of a Research Analyst, but has a particular focus on outreach and communication with donors.</li>\n<li>&#xA0;&#xA0;&#xA0; Conversation Notes Writer. Conversation notes are a key part of our research process. Conversation Notes Writers listen to conversations conducted by GiveWell staff and produce summaries. This position is flexible: it can be done from anywhere in the world at any time of day, but we ask for people who can commit at least 10 hours per week. We are currently looking to find 1-2 additional Conversation Notes Writers.</li>\n</ul>\n<p>&#xA0;</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "Qi29QhmtGJeBkHuF8", "title": "Meetup : Vienna - 1. EA Meetup", "postedAt": "2015-02-09T18:42:30.648Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/24\">Vienna - 1. EA Meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>19 February 2015 07:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Vienna</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>For further information (for example the exact location) join the FB group and look at the event there: \n<a href=\"https://www.facebook.com/events/548403548630611/\">https://www.facebook.com/events/548403548630611/</a></p>\n\n<p>Or message me (Anna Riedl)</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/24\">Vienna - 1. EA Meetup</a></h2></body></html>", "user": {"username": "AnnaRiedl"}}, {"_id": "2NsnGWtC2jxLxEQYR", "title": "How I organise a growing effective altruism group in a big city in less than 30 minutes a month.", "postedAt": "2015-02-08T22:20:43.455Z", "htmlBody": "<html><body><p>Starting a local group is really easy to do, a lot of fun and you meet some amazing people. And of course you can have a huge huge impact on the world by encouraging people to do good and to think more carefully about how they do good.</p>\n<p>I started organising regular EA social events in London in the summer of 2013. I had for a while been helping organise irregular GWWC events, then, one day, I thought why not try something a little different. I arranged an evening at a pub with a friend, created an EA social Facebook event and invited anyone who I thought might be interested. It went well and I have been creating infrequent social events ever since.</p>\n<p>I recently came to the rather surprising realisation that the EA London group was growing quite fast. This was particularly curious because for quite a while I had been putting in less than 30 minutes a month. Essentially the only organising I had been doing was taking the responsibility to choose a time and place for a social event and posting this on Meetup.com and Facebook about once a month.</p>\n<p>Now perhaps it is just chance that the group has grown of late, some twist of fate or flimsy whim of the gods. But either way it was suggested that I write my tips down on paper (well screen). The recipe below describes how I have organised things in London. Everywhere is different but I hope some of this is useful to someone.</p>\n<p>The rest of the article from hereon in has been cross-posted to the EA Wikipedia so that others can add their advice. So to see the most up-to-date version go to:<br><a href=\"http://effective-altruism.wikia.com/wiki/How_to_Run_a_Local_Effective_Altruism_Group_in_a_Minimal_Amount_of_Time\">http://effective-altruism.wikia.com/wiki/How_to_Run_a_Local_Effective_Altruism_Group_in_a_Minimal_Amount_of_Time</a></p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<p>&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;&#x2013;</p>\n<h1><strong><span>HOW TO RUN A LOCAL EA GROUP IN A MINIMAL AMOUNT OF TIME</span></strong></h1>\n<p>Starting a local group is <a href=\"https://80000hours.org/2012/04/the-haste-consideration/\">very high value</a> and very easy. This page is aimed at non-students living in a city that does not already have an effective altruism group, who may not have much time to put into growing a group but who will be in the same city for a prolonged period of time.&#xA0;This post does not set out the ideal way to run a local group but sets out how to run and grow a group if optimising for investing a minimal amount of time.</p>\n<p>&#xA0;</p>\n<h2><strong><span>Building a group &#x2013; first event</span></strong></h2>\n<ol>\n<li><strong>Create a Facebook event</strong><span>&#xA0;for a social event and invite friends of yours who you think might be interested. Have at least one friend who can definitely come, so if your event is not popular you are not sitting alone for an evening. Choose a time (Eg. evening/weekend) and place (Eg. pub/bar/caf&#xE9;/arts centre/etc) that people should be able to make.<br><br></span></li>\n<li><strong>Turn up</strong><span> and have a pleasant evening.</span></li>\n</ol>\n<p>Well done - you have started a local group!! It should take about 20 minutes to organise a first event. Once this is done <strong>you can use Facebook to create future events and automatically invite all the same people</strong> by going to the first event on Facebook and clicking &quot; &#x2022;&#x2022;&#x2022; &quot; then clicking &quot;copy event&quot;.</p>\n<p>EXAMPLES:</p>\n<ul>\n<li><a href=\"https://www.facebook.com/events/488224411226931/\">EA London first event</a></li>\n<li><a href=\"https://www.facebook.com/events/757376197665390/\">EA Leeds first event</a></li>\n</ul>\n<p>&#xA0;</p>\n<h2><strong><span>Building a group &#x2013; get an online presence</span></strong></h2>\n<ol>\n<li><strong>Create a Meetup.com group and/or create a Facebook group and/or start and email list and/or find other places online to post events. </strong><span>It is useful to have an online platform which can gradually grow in membership and from which events can be publicised. A good online platform (<strong>I highly recommend Meetup.com</strong>) will help your group grow without you having to do extra work or publicity. Posting about each event in more places will help your group grow faster but will take some a little bit of extra time on a regular basis to copy and paste across the event details. EA London posts all events on Meetup and on Facebook. See below for more advice on different online platforms.<br><br></span></li>\n<li><strong>Host more social events. </strong><span>See below for advice on running events. Make sure events are posted on all the sites that you are using (Facebook/Meetup/etc).</span></li>\n</ol>\n<p>EXAMPLES:</p>\n<ul>\n<li><a href=\"http://www.meetup.com/Effective-Altruism-London/\">EA London meetup group</a></li>\n<li><a href=\"https://www.facebook.com/groups/EALondon/\">EA and GWWC London Facebook group</a></li>\n</ul>\n<p>&#xA0;</p>\n<h2><strong><span>Building a group &#x2013; low cost publicity</span></strong></h2>\n<p>Once you have an online platform that people can join and be invited to events, then you can start publicising it. Below are some very simple quick easy ways of publicising your group:</p>\n<ol>\n<li><strong>Spread through word of mouth.</strong><span> Encouraging people who turn up to bring friends and to add people to the online groups is crucial.<br><br></span></li>\n<li><strong>Let the EA community know that you exist. </strong><span>Post about your new group in the </span><a href=\"https://www.facebook.com/groups/effective.altruists/\">EA Facebook page</a><span>. List your group on the </span><a href=\"http://effectivealtruismhub.com/groups\">EA Hub</a><span>. Maybe even add the occasional event on to the </span><a href=\"/meetups/new/\">EA forum</a><span>.<br><br></span></li>\n<li><strong>Let other groups know you exist. </strong><span>Tell the people who run other groups whose members might be interested about your group. Ideally tell them about a specific relevant upcoming event. People to tell would be local groups for: Less Wrong, students, philosophy, charity, atheist and humanists, religions, RESULTS, etc.</span></li>\n</ol><!--[if !supportLists]-->\n<p>&#xA0;</p>\n<h2><strong><span>Building a group &#x2013; try things</span></strong></h2>\n<p>Trying something slightly different every few months is low cost and will allow you to gradually work out what works best in your city. You can experiment with: Frequent / infrequent events. Regular times / ad hoc times. Evenings / weekends. East side of town / west side of town. Different ways of describing the event. Etc. (And if you find out useful information that can apply to other cities then come and edit this Wiki to help the rest of us.)</p>\n<p>&#xA0;</p>\n<h2><strong><span>Building a group &#x2013; final words</span></strong></h2>\n<p>And that is it &#x2013; SUCCESS &#x2013; you should now have a growing thriving local group. And none of the steps above should have taken you very long to do.</p>\n<p>Remember, you can spread this work out over as much time as needed. In London this whole process was spread out over about a year and took a small amount of time each month. Alternatively you can take a single evening to kickstart the process and do all of the above steps at once.</p>\n<p>Below is more advice to make sure that events run smoothly and that the group does not fail.</p>\n<p>&#xA0;</p>\n<h2><strong><span>Additional tips &#x2013; Choosing online platforms</span></strong></h2>\n<ol>\n<li><strong>Meetup.com </strong><span>has a cost but it has really helped the EA London group grow. It may not work for your city but it is likely to be worth trying. Keep the description snappy, make sure you add lots of popular &#x201C;labels&#x201D; so that your event will be found.<br><br></span></li>\n<li><strong>A Facebook group </strong><span>(not a Facebook page) lets people add their friends to the group and events turn up on people&#x2019;s Facebook newsfeed. If you create a Facebook group add anyone who you think would be interested and then when you create future events create them from the Facebook group so people in the group are automatically invited.<br><br></span></li>\n<li><strong>Other platforms.</strong><span> Consider looking for other websites where events are posted. For example Eventbrite or Time Out or Yelp. Try googling &#x201C;</span><em>how to meet new people in [city]</em><span>&#x201D; or &#x201C;</span><em>finding interesting events in [city]</em><span>&#x201D; and seeing what websites appear prominent.</span></li>\n</ol>\n<p>EXAMPLES:</p>\n<ul>\n<li><a href=\"http://www.meetup.com/Effective-Altruism-London/\">EA London meetup group</a></li>\n<li><a href=\"https://www.facebook.com/groups/EALondon/\">EA and GWWC London Facebook group</a> (click <em>About</em> to see the description. Feel free to copy and paste this)</li>\n</ul>\n<p><strong>&#xA0;</strong></p>\n<h2><strong><span>Additional tips &#x2013; Preparing for an event</span></strong></h2>\n<p><span>If trying to run a group with&#xA0;minimal&#xA0;time and effort a simple social event is the easiest to organise. People turn up when they want and discuss whatever takes their fancy, often including effective altruism.</span></p>\n<ol>\n<li><strong>Choose a time</strong><span>. In London we tend to meet at 7pm on a weekday evenings. Increase the regularity of events as the group grows. In London we started off with events every few months, then every other month, then every month, and now a few times a month. As the group grows having a fixed time for events (Eg. 1</span><sup>st</sup><span> Tuesday of each month) can help people plan around them.<br><br></span></li>\n<li><strong>Choose a place</strong><span>. In London we tend to meet in a centrally located pub. The ideal location will be somewhere cheap, without background music, with some vegetarian/vegan foodstuffs where space can be pre-booked.<br><br></span></li>\n<li><strong>Theme</strong><span>. People are more likely to attend events and enjoy events more if each event has a specific theme. It helps give people something to discuss and a reason to talk about EA topics as well as educating people about the key questions that underpin the EA movement. Put a list of interesting questions in the event description. (Optionally print of some articles that are connected to the theme. This can help spark interest and conversation but can also be a sizable time sink.)<br><br></span></li>\n<li><strong>Event description</strong><span>. Remember that your target audience for the description is not people who turn up every week but the people most likely to be persuaded to turn up with a good event description (ie. new people or people who have only attended once). Be welcoming. Describe something about effective altruism. Add a phone number so people can find you. Make it clear that people can turn up at any time.<br><br></span></li>\n<li><strong>Print Signs</strong><span>. Have signs so people can find you. </span><a href=\"https://drive.google.com/file/d/0BwwvTgW1FiT_WEVmNkxkazhuN0k/view?usp=sharing\">Example</a><span>.<br><br></span></li>\n<li><strong>Have leaflets</strong><span>. The main benefit here is for people who have been brought along by a friend or by word of mouth and are keen to sign up on Facebook / Meetup / etc. A small piece of paper with a short explanation of effective altruism and a link to any Facebook / Meetup / etc groups would suffice.</span>&#xA0;</li>\n</ol>\n<p>EXAMPLES:</p>\n<ul>\n<li><a href=\"https://www.facebook.com/events/268860213289681\">Effective Altruism fun pub times!!</a><span> (Theme: Giving strategically)</span></li>\n<li><a href=\"https://www.facebook.com/events/211537855668032\">Effective Altruism fun pub times!! (with Isha Datar Director of New Harvest)</a><span> (Theme: Lab grown mean)</span></li>\n<li><a href=\"https://www.facebook.com/events/1551475418433744\">Super Fun EA Pub Social - How to choose between causes?</a></li>\n<li><a href=\"https://www.facebook.com/events/744299242273461\">Under the influence @ the Shakespeare&apos;s Head</a><span> (Theme: Influencing others)</span></li>\n<li><a href=\"https://www.facebook.com/events/723458864356470\">Effective Animal Activism &#x2013; short talk and social</a></li>\n<li><a href=\"https://www.facebook.com/events/315981185274972\">Effective Altruism - Awesomely Fun Christmas Social</a><span> (Theme: Christmas!)</span></li>\n</ul>\n<!--[if !supportLists]-->\n<p>&#xA0;</p>\n<h2><strong><span>Additional tips &#x2013; Hosting an event</span></strong></h2>\n<ol>\n<li><strong>Be welcoming,</strong><span> friendly, hospitable, nice and so on. Talk to the new people. Explain effective altruism. Smile.<br><br></span></li>\n<li><strong>Ask for feedback </strong><span>from attendees as to how they found the event.<br><br></span></li>\n<li><strong>Suggest people move around</strong><span>. Feedback has suggested that it is useful to walk about at the half way point of an event and say: &#x201C;</span><em>Hi everyone. Sometimes at events like this people end up talking to the same person or group of people the whole evening and wish they had met more of the wonderful people here. So I want to suggest that you move about, now or in a few minutes. Just saying this to prompt you or to give you an excuse to get up and move around and meet more people</em><span>&#x201D;.<br><br></span></li>\n<li><strong>Zero-tolerance</strong><span> to any offensive or off-putting behaviour.<br><br></span></li>\n<li><strong>Have fun</strong><span>!</span>&#xA0;</li>\n</ol>\n<p>At first you do have to turn up to your own events &#x2013; although once you have a few regulars this is a relatively easy task to pass on to someone else if you need to.</p>\n<p>&#xA0;</p>\n<h2><strong><span>Additional tips &#x2013; Avoiding failure</span></strong></h2>\n<ol>\n<li><strong>Do not get disheartened</strong><span>. Most EA groups that have fizzled out have done so because the leaders have had limited success at growing the group, have felt disheartened and given up. To avoid this:</span> \n<ul>\n<li><strong>Aim low and you will not be disappointed.</strong></li>\n<li><strong>Be aware of the huge potential benefit of EA outreach</strong><span>. Read <a href=\"https://80000hours.org/2012/04/the-haste-consideration/\">haste consideration</a> and do a back of the envelope calculations.</span></li>\n<li><strong>Have fun</strong><span>. Make sure you enjoy the events. Do not get stressed organising things - organise things at your convenience. Finding a co-organiser may help.</span></li>\n<li><strong>Put less time into running the group</strong><span> (see below).</span>&#xA0;</li>\n</ul>\n</li>\n<li><strong>Feeling like this is a sub-optimal use of time</strong><span>. Put less time in but keep events going. Eg have events every 2 months. Copy and paste the same event description for each event. Organise them at your convenience (oh I am meetup up with a friend that evening anyway so I can make it an EA event and invite others). If people ask for more events then suggest they organise them. If necessary try to hand over (see below).<br>&#xA0;</span></li>\n<li><strong>Handovers</strong><span> can be difficult (without significant effort). If you think there is a high chance that you will leave a town in less than a year then maybe don&#x2019;t start a group like this. Ask lots of people and pressure them into helping. Write a very detailed handover note with everything you can think of.<br><br></span></li>\n<li><strong>Feeling like this is a sub-optimal use of money</strong><span>. Ask me (Sam) and I can pay for the cost of a meetup group. Or maybe ask Giving What We Can (</span><a href=\"mailto:information@givingwhatwecan.org\">information@givingwhatwecan.org</a><span>). Remember 1 Meetup account can host 3 groups.<br><br></span></li>\n<li><strong>Group does not grow at all</strong><span>. Bigger groups grow faster &#x2013; if the group is not growing you could try some of the </span><strong>additional things to do with extra time </strong><span>that are listed below. If you can or find someone to organise one big event &#x2013; such as a famous talker that may be all the group needs.</span></li>\n</ol>\n<p>&#xA0;</p>\n<h2><strong><span>Additional tips &#x2013; Things to do with extra time</span></strong></h2>\n<ol>\n<li><strong>Speaker events</strong><span>. A single big well publicised event can help group the group significantly. In London we had Peter Singer come and talk to a crowd of 400 and this helped the group take off (</span><a href=\"http://www.eventbrite.co.uk/e/peter-singer-effective-altruism-a-new-movement-emerges-tickets-11763193027\">event</a><span>).<br><br></span></li>\n<li><strong>Other kinds of events</strong><span>. For resources on other events see </span><a href=\"/ea/a6/outreaching_effective_altruism_locally_resources/\">this post</a><span>. Examples to consider: </span><a href=\"https://www.facebook.com/events/1066695483346249\">volunteer-a-thons</a><span>, </span><a href=\"https://www.facebook.com/events/275062456024101\">dinners</a><span>, </span><a href=\"https://www.facebook.com/events/657005137695116\">small talks</a><span>, </span><a href=\"https://www.facebook.com/events/497803373678819\">interactive theatre</a><span>, and so on.<br><br></span></li>\n<li><strong>Responding to emails and communication</strong><span>. As the group leader your main time sink after creating (and attending) the event each month or so will be responding to emails form people who are interested in EA. The easy thing to do is to ignore these or send a standard message to people. Being polite and responding to individual emails is likely to be a useful way to spend extra time.<br><br></span></li>\n<li><span><strong>Keep trying things</strong>.&#xA0;With more time your experiments into how best to run the group can be bigger and more rigorous. You can trial different kinds of events or having a to do list with tasks that anyone can take on or sending a personal message to new members and so on.</span></li>\n</ol>\n<p>&#xA0;</p></body></html>", "user": {"username": "weeatquince"}}, {"_id": "o77aWTyYy3WAeApxc", "title": "What we learned from our donation match", "postedAt": "2015-02-07T23:13:32.758Z", "htmlBody": "<html><body><h3><span><span>Between Christmas and the end of January, Alex Gordon-Brown and I ran a donation match for AMF. We decided to triple (Gift aid included) and raised almost 14,000 pounds.</span></span></h3>\n<p><span><span><br></span></span></p>\n<p><span>Our motivation besides raising money that wouldn&#x2019;t have been donated otherwise was to find people who haven&#x2019;t been involved in the EA community so far. We hoped we could try to draw in newcomers and get them to donate, in the hope they&#x2019;d donate more in the future. For those reasons, for evaluating the impact of our match, we aren&#x2019;t looking too closely at the money we have raised officially (not even taking into account the obvious concern that some of those donations would have happened anyway).</span></p>\n<p><span><br></span></p>\n<p><span>Unfortunately, most of these benefits are difficult to assess. People who donated seemed to mainly come from EA-affiliated circles with some peopl</span><span>e being &#x201C;core EAs&#x201D; and some people being more losely connected. We also had a few donations by people whom we suspect to be Alex&#x2019; coworkers. This flags up a neglected benefit of Earning-to-Give-careers - more access to people who are able to donate large sums too. Those donations were also the highest we got, which highlights this benefit further. </span><span><br></span><span><br></span><span>There were a few donations in the thousands, a decent chunk in the hundreds and many below a hundred pounds. </span></p>\n<p><span><br></span></p>\n<p><span>We decided the amount based on how much we thought was achievable, but still high enough so it would bring out higher donations. So far, donation matches were capped at 4-figure sums*, while the largest donation we got was already more than 5,000 dollars. We hoped to anchor people with a high target. This seems to have worked. A smaller goal probably wouldn&#x2019;t have brought out as many &gt;$1000 donations. </span></p>\n<p><strong><br></strong></p>\n<p><span>Ben Kuhn mentioned in <a title=\"his post\" href=\"http://www.benkuhn.net/matching\">his post</a> that matching a donation more than 1:1 doesn&#x2019;t seem to be worth it (this post appeared after we started the match). Since we wouldn&#x2019;t have gone for a higher amount even if we had done only 1:1 matching, there wasn&#x2019;t a cost to tripling. [Edit: Ben pointed out in the comments that this result was based on a direct mailing campaign, so it&apos;s unclear how well it translates to Social Media fundraising.]</span></p>\n<p><strong><br></strong></p>\n<p><span>On the cost side in general, we put a couple of hours in, but very few overall. The donation match was shared on Facebook and we had a few private conversations because of it, but again, very few. The money we put up for the donation match would have been donated anyway to AMF.</span></p>\n<p><strong><br></strong></p>\n<p><span>The other cost was the match not filling up, though the effects of that are unclear. It might demotivate people in the future if there&#x2019;s a match with a similarly high goal. I think this is offset by the experimental value the match had.</span></p>\n<p><strong><br></strong></p>\n<p><span>Most donations happened in the first and the last week of the match, that&#x2019;s also when we tried to draw attention to it the most. We could probably have done the match over a shorter timeframe, so donations would have been more regular. This might have resulted in people being more motivated to donate, compared to when it looks like it&#x2019;s come to a halt. </span></p>\n<p>&#xA0;</p>\n<p><span>Another reason behind the timing was the intention for the match to be Christmas related, since people are more likely to donate during that period. We were a bit late for that unfortunately, so in the future (combined with the reason above), we&#x2019;d rather do a match only for December. If you have any suggestions how to improve (our) donation matches in the future, we&apos;d be happy to hear them. </span></p>\n<p>&#xA0;</p>\n<p><span><br></span></p></body></html>", "user": {"username": "Denise_Melchin"}}, {"_id": "uykLQmdHdPQtHR3hu", "title": "Meetup : Effective Altruism Leeds Pub Social", "postedAt": "2015-02-06T16:12:04.924Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/23\">Effective Altruism Leeds Pub Social</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>11 February 2015 07:00:00PM (+0000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Old Bar, Lifton Place, Leeds LS2 9JZ</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>This is Effective Altruism Leeds&apos;s very first event, open to everyone.</p>\n\n<p>The Facebook event is here: <a href=\"https://www.facebook.com/events/757376197665390/\">https://www.facebook.com/events/757376197665390/</a></p>\n\n<p>The Meetup.com page is here: <a href=\"http://www.meetup.com/EffectiveAltruismLeeds/\">http://www.meetup.com/EffectiveAltruismLeeds/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/23\">Effective Altruism Leeds Pub Social</a></h2></body></html>", "user": {"username": "Jacob_Hilton"}}, {"_id": "a8uBjCsnNEhACWmp2", "title": "Request for proposals for Musk/FLI AI research grants", "postedAt": "2015-02-06T14:46:15.628Z", "htmlBody": "<html><body><p>Recently, <a href=\"http://futureoflife.org/misc/AI\">Elon Musk donated $10M</a>&#xA0;to fund research on making AI more robust and beneficial, motivated in part by Nick Bostrom&apos;s book <em>Superintelligence</em>&#xA0;and by AI&apos;s links to existential risk.</p>\n<p>Many EAs I know are interested in the relationship between artificial intelligence and existential risk, and there has been some discussion here of <a href=\"http://www.effective-altruism.com/ea/6m/strategic_considerations_about_different_speeds/\">long</a>-<a href=\"/ea/e2/comments_on_ernest_daviss_comments_on_bostroms/\">term</a> <a href=\"http://www.effective-altruism.com/ea/et/the_ai_revolution_link/\">AI</a> <a href=\"/meetups/k\">safety</a> as a topic for <a href=\"/ea/b5/why_longrun_focused_effective_altruism_is_more/\">long-run focused EA</a>. Given this,&#xA0;I thought it&apos;d make sense to post the request for proposals for research projects to be funded by Musk&apos;s donation. I&apos;d be very happy to see some applications come out of the broader EA community, so do think about it yourself and pass it along to friends!</p>\n<div>Here&apos;s <a href=\"http://futureoflife.org/grants/large/initial\">the full Request for Proposals</a>&#xA0;on the Future of Life Institute&apos;s website.</div>\n<div><br></div>\n<div>If you have questions, feel free to ask them in the comments or to contact me!</div>\n<div><br></div>\n<div>Here&apos;s the email FLI has been sending around:</div>\n<div><br></div>\n<blockquote>\n<div>Initial proposals (300&#x2013;1000 words) due <strong>March 1, 2015</strong></div>\n<div><br></div>\n<div>The Future of Life Institute, based in Cambridge, MA and headed by Max Tegmark (MIT), is seeking proposals for research projects aimed to maximize the future societal benefit of artificial intelligence while avoiding potential hazards. Projects may fall in the fields of computer science, AI, machine learning, public policy, law, ethics, economics, or education and outreach. This 2015 grants competition will award funds totaling $6M USD.</div>\n<div><br></div>\n<div>This funding call is limited to research that explicitly focuses not on the standard goal of making AI more capable, but on making AI more robust and/or beneficial; for example, research could focus on making machine learning systems more interpretable, on making high-confidence assertions about AI systems&apos; behavior, or on ensuring that autonomous systems fail gracefully. Funding priority will be given to research aimed at keeping AI robust and beneficial even if it comes to greatly supersede current capabilities, either by explicitly focusing on issues related to advanced future AI or by focusing on near-term problems, the solutions of which are likely to be important first steps toward long-term solutions.</div>\n<div><br></div>\n<div>Please do forward this email to any colleagues and mailing lists that you think would be appropriate.</div>\n<div><br></div>\n<div><strong><span>Proposals</span></strong></div>\n<div><br></div>\n<div>Before applying, please read the complete RFP and list of example topics, which can be found online along with the application form:</div>\n<div><br></div>\n<div>&#xA0; &#xA0; http://futureoflife.org/grants/large/initial</div>\n<div><br></div>\n<div>As explained there, most of the funding is for $100K&#x2013;$500K project grants, which will each support a small group of collaborators on a focused research project with up to three years duration. For a list of suggested topics, see the complete RFP [1] and the Research Priorities document [2]. Initial proposals, which are intended to require merely a modest amount of preparation time, must be received on our website [1] on or before March 1, 2015.</div>\n<div><br></div>\n<div>Initial proposals should include a brief project summary, a draft budget, the principal investigator&#x2019;s CV, and co-investigators&#x2019; brief biographies. After initial proposals are reviewed, some projects will advance to the next round, completing a Full Proposal by May 17, 2015. Public award recommendations will be made on or about July 1, 2015, and successful proposals will begin receiving funding in September 2015.</div>\n<div><br></div>\n<div><strong><span>References and further resources</span></strong></div>\n<div><br></div>\n<div>[1] Complete request for proposals and application form: <a href=\"http://futureoflife.org/grants/large/initial\">http://futureoflife.org/grants/large/initial</a></div>\n<div>[2] Research Priorities document: <a href=\"http://futureoflife.org/static/data/documents/research_priorities.pdf\">http://futureoflife.org/static/data/documents/research_priorities.pdf</a></div>\n<div>[3] An open letter from AI scientists on research priorities for robust and beneficial AI: <a href=\"http://futureoflife.org/misc/open_letter\">http://futureoflife.org/misc/open_letter</a></div>\n<div>[4] Initial funding announcement: <a href=\"http://futureoflife.org/misc/AI\">http://futureoflife.org/misc/AI</a></div>\n<div>Questions about Project Grants: dewey@futureoflife.org</div>\n<div>Media inquiries: tegmark@mit.edu</div>\n</blockquote></body></html>", "user": {"username": "Daniel_Dewey"}}, {"_id": "vfQdGnjgu94Ztnstm", "title": "$5 billion in moral trade surplus?", "postedAt": "2015-02-04T17:22:23.663Z", "htmlBody": "<html><body><p><span>Over $5 Billion was spent in the 2012 US presidential election. &#xA0;I think this zero-sum waste of money is a ripe target for moral trade. &#xA0;I also think that it would be a great opportunity for an EA venture!</span></p>\n<p><span><br></span></p>\n<p><span>The Premise:</span></p>\n<p>&#xA0;</p>\n<p><span>What if people had the option to &#x2018;cancel out&#x2019; the donations of an opposing political party by paying the same amount? &#xA0;What if these &#x2018;canceled out&#x2019; donations were subsequently given to an effective charity?</span></p>\n<p>&#xA0;</p>\n<p><span>Let&#x2019;s say that I&#x2019;m a Democrat, and my friend is a Republican. &#xA0;We both plan on donating $100 to our respective candidates. &#xA0;But after discussing it, we realise that this is a pretty pointless waste of money, and instead we agree to each put our $100 towards a charity recommended by Givewell.</span></p>\n<p>&#xA0;</p>\n<p><span>I think there might be strong demand for a mechanism that could lower the transaction costs between people in the above situation. &#xA0;Both so that they can cancel out donations of those outside their immediate circle, and simultaneously confirm that the other side is holding up their end of the bargain.</span></p>\n<p>&#xA0;</p>\n<p><span>The technical difficulties of such a mechanism might be fairly minimal, ironically due in part to the comic lack of regulation on super PACs (which don&apos;t have limits on donations or other onerous restrictions).&#xA0;One could simply have an escrow account that receives donations from each side and &#x2018;clears&#x2019; every so often. If $200,000 came from Democrats and $260,000 from Republicans, our organisation would donate $400,000 to an effective charity and $60,000 to a Republican super PAC.</span></p>\n<p>&#xA0;</p>\n<p><span>Would it really be that easy?</span></p>\n<p>&#xA0;</p>\n<p><span>Maybe? Probably not? &#xA0;It&#x2019;s still a half-baked idea, but one that I hope can be developed further. &#xA0;In addition to having a credible escrow account, one would need strong marketing and general operations. &#xA0;The idea would certainly get tons of media attention - basically nobody in the US enjoys the election process and this might be a breath of fresh air.</span></p>\n<p>&#xA0;</p>\n<p><span>Other problems might be if only one side tends to donate to the escrow account. &#xA0;That might be remedied by appealing to wealthy donors on the other side. &#xA0;Another problem might be a perceived lack of a 1-to-1 ratio in effectiveness. &#xA0;One might open a market (such that I could donate 1.1 dollars to cancel out 1 opponent&#x2019;s dollar) but honestly I think the simpler version is better from a marketing perspective.</span></p>\n<p>&#xA0;</p>\n<p><span>Might this be a candidate for incubation within EA ventures? Pun totally intended.</span></p></body></html>", "user": {"username": "Andrew_SB"}}, {"_id": "ggrjRA7RdARyKZZqA", "title": "The AI Revolution [Link]", "postedAt": "2015-02-03T19:39:58.616Z", "htmlBody": "<html><body><p>Here&apos;s a new two-part editorial on the future of artificial intelligence by Tim Urban, science blog <em>Wait But Why</em>.</p>\n<p>The <a href=\"http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html\">first part</a> has 22,000 shares on social media (and probably hundreds of thousands of views).</p>\n<p>The <a href=\"http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-2.html\">second and final part</a>&#xA0;was released today.</p>\n<p>In my personal opinion, although essays by <a href=\"/lesswrong.com/sequences\">Eliezer</a>, <a href=\"http://intelligenceexplosion.com/\">Luke</a>&#xA0;and <a href=\"http://www.amazon.co.uk/Smarter-Than-Us-Machine-Intelligence-ebook/dp/B00IB4N4KU\">Stuart (Armstrong)</a>&#xA0;have been extremely useful introductions to artificial intelligence, I think this is likely to be the go-to popular introduction to AI risk for the next few years. (with Bostrom&apos;s <a href=\"http://www.amazon.co.uk/Superintelligence-Dangers-Strategies-Nick-Bostrom-ebook/dp/B00LOOCGB2/ref=sr_1_1?s=digital-text&amp;ie=UTF8&amp;qid=1422992351&amp;sr=1-1&amp;keywords=bostrom\">Superintelligence</a>&#xA0;an ideal book-length counterpart).</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "w4zfPNtX4ythfZjBi", "title": "February Meetups Thread", "postedAt": "2015-02-03T17:57:04.323Z", "htmlBody": "<html><body><p><span>Here are some meetups coming up in the next month. Feel free to notify me of extra meetups using the comments below, and they&apos;ll be added to the list.</span></p>\n<p>&#xA0;</p>\n<li><a href=\"/meetups/1x\">#ph11, 77 Davisville Ave, Toronto, ON</a>&#xA0;<span>05 Feb 2015 19:00</span></li>\n<li><a href=\"/meetups/1w\">The Water Poet 9-11 Folgate St, E1 6BX</a>&#xA0;<span>09 Feb 2015 18:30</span></li>\n<li><a href=\"/meetups/1z\">Rijnkade 5, Utrecht</a>&#xA0;<span>15 Feb 2015 14:00</span></li>\n<li><span><a href=\"http://www.meetup.com/Frankfurt-Effective-Altruism-Doing-Good-Better/events/220271726/\">Frankfurt</a>&#xA0;19 Feb</span></li>\n<li><a href=\"/meetups/1y\">London</a><span>, third Tuesday each month</span></li>\n<li><a href=\"/meetups/20\">Rijnkade 5, Utrecht</a>&#xA0;<span>01 Mar 2015 14:00</span></li>\n<p>&#xA0;</p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "FrSaKohTYqkA4KZYs", "title": "Should your choice of charity change based on how much money you have?", "postedAt": "2015-02-03T04:55:58.136Z", "htmlBody": "<html><body><p><span><span> </span></span></p>\n<p><span>Earlier this year, Bernadette Young and Peter Hurford recommended that I make a post like this once I had enough karma:</span></p>\n<p>&#xA0;</p>\n<p><span>At an event hosted by the </span><a href=\"https://www.facebook.com/groups/dc.effective.altruism/\"><span>DC Effective Altruism</span></a><span> meet-up group, we discussed if any organizations with large amounts of money, such as USAID, the Bill and Melinda Gates Foundation, or the World Bank, are actually more effective in choosing causes to benefit than GiveWell.</span></p>\n<p>&#xA0;</p>\n<p><span>Many are skeptical of this, because it is easy to point to examples of failed projects, naivety, and bad funding priorities. </span><span>However, these organizations seem to be pursuing some very promising projects, and there may be levels of effectiveness that are only feasible with such scale.</span></p>\n<p>&#xA0;</p>\n<p><span>One argument was made that when you are a large organization, you have the ability to start a new initiative entirely and also guarantee that there is enough overall funding, which small individual donations can&apos;t. New organizations have a chance to be far more effective and aren&apos;t replaceable in many cases, so it might be the case that it is good for the rich to fund these instead of GiveWell charities.</span></p>\n<p>&#xA0;</p>\n<p><span>Another argument was that if these wealthy groups did fill all the room for funding of GiveWell&apos;s top charities (they easily could), the top charities would naturally become less effective and not do as well at attracting other funding (I don&apos;t think it matters who funds a charity except if it changes the net amount donated to effective causes). The part of this argument that seems to actually matter is whether or not effectiveness will be reduced to the point that other causes would become better to fund, before full funding is reached.</span></p>\n<p>&#xA0;</p>\n<p><span>An idea in common between these arguments seems to be that marginal contributions and large sum contributions will differ in cost effectiveness depending on the circumstances of a cause or charity. </span></p>\n<p>&#xA0;</p>\n<p><span>If a cause requires $1,000 for its intervention, and you donate $1, you don&#x2019;t have any effect unless $999 was or will be donated by others so your dollar bridges the gap to the next intervention. If others donate as much or more than is needed, your donation is replaceable. This is part of the problem of effectively coordinating small donors.</span></p>\n<p>&#xA0;</p>\n<p><span>If the same cause already has $999 and you donate $1,000 the intervention will happen, but $999 might not be able to be spent on an effective cause. This is the inefficiency of donating too much, and possibly giving an organization room to be less cost effective with its interventions. The room for funding has been surpassed.</span></p>\n<p>&#xA0;</p>\n<p><span>When there is high variance in the amount that may be donated, it pays to have a charity where each small contribution can make a difference. With each contribution making a difference, it becomes possible for many different levels of funding to be cost effective. The charities that GiveWell recommends seem to fit this pattern: they have very inexpensive interventions that are scaleable. Returns on investment are close to linear, even if there are diminishing returns.</span></p>\n<p>&#xA0;</p>\n<p><span>On the other hand, with things like research, there may be larger brackets for what amount of money can make a difference. Once higher levels of funding are reached there is likely to be better cost effectiveness. If the next most meaningful way for a group to do better is to hire a new employee, they may need a lot of money. Meeting and not exceeding the need of such organizations requires coordination that small donors are unlikely to achieve. This may be where the rich have a comparative advantage. Returns on investment may be more like a step function, at each new threshold there is a sudden jump in effectiveness.</span></p>\n<p><span>I don&apos;t have a strong opinion on these arguments, but I do think this is a good place to discuss them. Should what large aid groups focus on influence what </span><span>we </span><span>focus on? Should we work toward changing these organizations to be more effective if they aren&apos;t already? Should the amount of money you earn actually change where you donate?</span></p>\n<p><span> ______________________________________________________________________________________________ </span></p>\n<p><span>(I will post some examples of what the Bill and Melinda Gates Foundation has looked into in the comments below, as well as an earlier comment from Peter Hurford responding to an earlier version of this post. </span><span>If there is any mathematical naivety in the arguments presented above, please point it out. </span><span>Some of the reasoning about marginal versus large sum donations falls into a similar category as the </span><a href=\"http://en.wikipedia.org/wiki/Sorites_paradox\"><span>Sorites paradox</span></a><span>, and I imagine it might be the sort of confusion you can defeat with math.</span><span> For example, taking limits in math is a way to deal with </span><span><a href=\"http://en.wikipedia.org/wiki/Zeno%27s_paradoxes\">Zeno&#x2019;s paradoxes</a>)</span></p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Gentzel"}}, {"_id": "eZWT7CJKrcia82kqm", "title": "Meetup : Effective Altruism for the masses", "postedAt": "2015-02-02T18:53:42.679Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/22\">Effective Altruism for the masses</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>15 March 2015 02:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Rijnkade 5, Utrecht</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We have informal meetups biweekly, please see meetup.com: <a href=\"http://www.meetup.com/LWEANL/\">http://www.meetup.com/LWEANL/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/22\">Effective Altruism for the masses</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "oc67uNCygHuW22zNC", "title": "Meetup : Small concrete actions you could take", "postedAt": "2015-02-02T18:51:53.783Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/21\">Small concrete actions you could take</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>29 March 2015 01:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Rijnkade 5, Utrecht</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We have informal meetups biweekly, please see meetup.com: <a href=\"http://www.meetup.com/LWEANL/\">http://www.meetup.com/LWEANL/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/21\">Small concrete actions you could take</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "t8KdopLvryz5JseNJ", "title": "Meetup : Present the charity you'd like to give to", "postedAt": "2015-02-02T18:51:18.741Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/20\">Present the charity you&apos;d like to give to</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>01 March 2015 02:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Rijnkade 5, Utrecht</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We have informal meetups biweekly, please see meetup.com: <a href=\"http://www.meetup.com/LWEANL/\">http://www.meetup.com/LWEANL/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/20\">Present the charity you&apos;d like to give to</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "cxyuyrtHCkwqkDyKw", "title": "Meetup : Utrecht: Cancelled", "postedAt": "2015-02-02T18:22:37.768Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1z\">Utrecht: Cancelled</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>15 February 2015 02:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Rijnkade 5, Utrecht</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We have informal meetups nearly biweekly, please see meetup.com: <a href=\"http://www.meetup.com/LWEANL/events/220254191/\">http://www.meetup.com/LWEANL/events/220254191/</a></p>\n\n<p>Unfortunately, we have to cancel this one. We&apos;re very sorry for this.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1z\">Utrecht: Cancelled</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "ha3pnxoe3gt2H5kan", "title": "Announcing EffectiveAltruism.org", "postedAt": "2015-02-02T04:06:26.617Z", "htmlBody": "<html><body><p><span>After months of gestation, I&#x2019;m happy to announce that</span><a href=\"http://effectivealtruism.org/\"><span> </span><span>EffectiveAltruism.org</span></a><span> just went live. The aim of the site is to act as a central landing page for anyone interested in the movement, from philanthropists to university students.</span></p>\n<p><strong><br></strong></p>\n<p><span>Regard this version of the site as a minimal viable product that will continue to change as we encounter ideas for improvement. If you have one or more of these ideas,</span><a href=\"https://tyleralterman.typeform.com/to/FMmAr4\"><span> </span><span>please enter a note here</span></a><span>. I&#x2019;d love to read it!</span></p>\n<p><strong><br></strong></p>\n<p><span>Some future updates could include:</span></p>\n<ul>\n<li>\n<p><span>Short descriptions under each EA organization on the &#x201C;Organizations&#x201D; page</span></p>\n</li>\n<li>\n<p><span>An improved engagement funnel, with different ways to engage EA by different levels of commitment</span></p>\n</li>\n<li>\n<p><span>Updated &#x201C;About&#x201D; copy to better demonstrate that EA is an intellectual movement</span></p>\n</li>\n<li>\n<p><span>Profiles of individual EAs</span></p>\n</li>\n</ul>\n<p><strong><br></strong></p>\n<p><span>Lastly, I&#x2019;m currently a bit bottlenecked between the imminent launch of</span><a href=\"http://eaventures.org/\"><span> </span><span>EA Ventures</span></a><span> and planning for EA Global (the rebranded Summit). </span><span>So: if you&#x2019;re motivated to play a part in creating the site that will (hopefully) inspire thousands of future EAs, shoot me an email!</span><span> I&#x2019;m at <a href=\"mailto:tyleralterman@gmail.com\">tyleralterman@gmail.com</a>.</span></p></body></html>", "user": {"username": "tyleralterman"}}, {"_id": "RCrqC8JaQaTYxiAEk", "title": "Meetup : Super fun EA London Pub Social Meetup", "postedAt": "2015-02-01T23:34:10.912Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1y\">Super fun EA London Pub Social Meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>19 April 2016 06:00:00PM (+0000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>London (see details)</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><ul>\n<li>Effective Altruism and Giving What We Can London has an incredibly awesome regular social meetup on the third Tuesday of each month - themed around around a different EA topic most months. - We also have a host of other fantastic events (more socials / talks / volunteer-a-thons / etc) throughout the year. - For details of all our events join us on: Facebook: www.facebook.com/groups/EALondon Meetup: www.meetup.com/Effective-Altruism-London</li>\n</ul></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1y\">Super fun EA London Pub Social Meetup</a></h2></body></html>", "user": {"username": "weeatquince"}}, {"_id": "rb5YDEk3zej3HF5bg", "title": "EA Diversity: Unpacking Pandora's Box", "postedAt": "2015-02-01T00:40:05.862Z", "htmlBody": "<html><body><p><strong>Introduction</strong></p>\n<p>I hate talking about diversity. I hate watching other people talk about diversity more*. My first reaction to the (most) <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/812909868765372/\">recent</a>&#xA0;thread in the EA Facebook group about diversity was &apos;oh God, not this again&apos;**. So I have a lot of sympathy for the view, most commonly expressed by social conservatives, that as a society we should spend a whole lot less time thinking and talking about diversity and a whole lot more time deciding on merit. On a purely selfish level, I would enjoy life more that way.</p>\n<p>The reasons why I hate this topic are varied, and some of them are too petty or personal to be worth expressing here, but a few of the more intellectual reasons are relevant:</p>\n<ul>\n<li>This whole area is a communication minefield; words like &apos;diversity&apos;, &apos;political correctness&apos;, and &apos;social justice&apos; mean dramatically different things to different people. Without active efforts to avoid said mines, participants in such a debate are likely to end up <a href=\"http://lesswrong.com/lw/np/disputing_definitions/\">disputing definitions</a>.</li>\n<li>The <a href=\"http://en.wikipedia.org/wiki/Mind_projection_fallacy\">Mind Projection fallacy</a> is deadly on a topic where views tend to be both strongly entrenched and strongly based on (divergent) personal experiences. Large gaps in experience lead to large <a href=\"http://lesswrong.com/lw/kg/expecting_short_inferential_distances/\">inferential distances</a>, and large inferential distances make persuasion difficult. That is, it is difficult even when you know they exist, never mind when you don&apos;t.</li>\n<li>The above combine in a nasty way. Opaque or incomplete arguments can get uncritical support from those who agree with the conclusions, partly because their knowledge or experience allow them to unconsciously &apos;fill in the blanks&apos; and partly because of the <a href=\"http://lesswrong.com/lw/lj/the_halo_effect/\">halo effect</a>. And lots of arguments, in any debate, on any side, are <a href=\"http://lesswrong.com/lw/ke/illusion_of_transparency_why_no_one_understands/\">opaque or incomplete</a>. The danger is that you end up with two groups talking past each other, neither of them having the ability and willingness to bridge the gap, yet both increasingly confident in &apos;their&apos; position as they are reinforced by &apos;their&apos; group. Which in all probability they just&#xA0;<a href=\"http://lesswrong.com/lw/gz/policy_debates_should_not_appear_onesided/\">shouldn&apos;t be</a>.</li>\n</ul>\n<p>Reading the above, you could reasonably ask: why am I of all people writing a post about diversity? Because at some point I looked at the world and considered the evidence. Unfortunately for me, my best guess is that diversity is rather important. In particular, I think that it is too important to be left to the type of discussion I just described, and I want to make the case for why it deserves at least some of our attention.</p>\n<hr>\n<p><strong>Getting it clear</strong></p>\n<p>As noted, diversity can mean a variety of different things. The different things have different upsides. I&apos;m going to non-exhaustively focus on four types:</p>\n<ol>\n<li>Diversity of talent.</li>\n<li>Diversity of experience.</li>\n<li>Diversity of opinion.</li>\n<li>Diversity of appearance.</li>\n</ol>\n<p>I want to talk about:</p>\n<ul>\n<li>What does this mean? Why does it matter?</li>\n<li>How are we doing?</li>\n<li>What could we do better?</li>\n</ul>\n<p>I certainly do <em>not</em> think I have all the answers, especially to the last of those. My hope is that by approaching things in this way we will at least be asking the right (well-defined, relevant, interesting) questions.</p>\n<p>Finally, I want to pre-empt the obvious response that these are interlinked; in particular your experiences are linked to your talents, opinions, and appearance. My point is that different types of diversity have different upsides, and that while you can get multiple types at once, you often will not. So I still think they&apos;re worth considering separately.</p>\n<hr>\n<p><strong><em>Talent</em></strong></p>\n<p>If you want to get things done and done well, you need a variety of types of people to get there. You need the analytically-minded. You need organisers. You need leaders. You need communicators. And so on. People have widely differing skills and knowledge, and we achieve more by complementing each other, allowing each of us individually to focus on what we&apos;re really good at. This idea appears in economics at the country level, in the form of <a href=\"http://www.economicsonline.co.uk/Global_economics/Comparative_advantage.html\">comparative advantage</a>. On the level of small groups, the concept of varying skills meaning more productivity has a <a href=\"https://hbr.org/2007/04/the-leadership-team-complementary-strengths-or-conflicting-agendas\">long history, in business and out</a>.</p>\n<p>EA is heavy on mathematicians, programmers, economists and philosophers. Those groups can get a lot done, but they can&apos;t get everything done. If we want to grow, I think we could do with more PR types. Because we&apos;re largely web-based, people who understand how to make things visually appealing also seem valuable. My personal experience in London is that we would love more organisers, though I can imagine this varying by location.</p>\n<p>With that said, this is not an area I&apos;m too worried about in the medium term. We&apos;re doing pretty well at elite universities. Elite universities score poorly on the other types of diversity I mentioned, but they do turn out people who go into a variety of fields with a variety of strengths; they are diverse in this sense. Just expanding our recruitment there would fix this problem. On a more personal level, I haven&apos;t had any difficulty talking about EA to my non-quantitative, non-analytical friends...from elite universities. I think that&apos;s because communication barriers are more often to do with differing experiences than differing talents (see next section).</p>\n<hr>\n<p><strong><em>Experience</em></strong></p>\n<p>Different people have different past experiences. Those experiences are often critical in deciding what you find intuitive, who you can relate to, and how you approach the world. Trying to persuade someone of a new idea is hard anyway, and if you have highly divergent past experiences it is doubly hard. The things you believe immediately might be a big leap for them, and vice-versa; once again inferential distances loom large. If we want to expand, we need varying experiences so that we can communicate effectively with a variety of people. Even once people with differing experiences have reached very similar conclusions, those different routes provide ample opportunities for learning and deeper understanding. On the flip side, homogeneous experiences can easily lead to poor evaluation of the choices and opportunities available to those with different experiences.</p>\n<p>In my opinion, this is where EA is weakest. We&apos;re overwhelmingly young, overwhelmingly well-educated, and very well-off even by the standards of our&#xA0;<a href=\"http://www.slate.com/articles/health_and_science/science/2013/05/weird_psychology_social_science_researchers_rely_too_much_on_western_college.html\">WEIRD</a>&#xA0;base. We lack parents, we lack people with years of experience in business, public service or charity, and for the most part we lack people for whom money or education or both has been a real struggle. At the risk of stating the obvious, it would be very bad if we ended up unintentionally excluding all of these groups.</p>\n<p>Some of these issues (parents, age, experience) will plausibly fix themselves over time, because current EAs will enter those groups. Sometimes we might need to do a little work to ensure that people don&apos;t <a href=\"/ea/ee/on_making_spaces_friendlier_to_parents/\">drop out of EA</a> as they drop in to one of these categories. Other issues, like different backgrounds, require more thought, and I&apos;d welcome ideas others have on what can be done here. It might be as simple as re-framing our arguments depending on the audience, or it might be more fundamental.</p>\n<hr>\n<p><strong><em>Opinion</em></strong></p>\n<p>Different people believe different things. To an extent, we expect homogeneous views within a group of people who were brought together by their shared goals; this is true in spite of the fact that <a href=\"/ea/9s/effective_altruism_is_a_question_not_an_ideology/\">Effective Altruism is a question</a>. But it should still be possible to have a lot of thought diversity; most EAs are irreligious, but our popular 10% idea has its roots in tithes. Going further down that line, religious people are <a href=\"http://www.telegraph.co.uk/news/religion/10885180/Religion-makes-people-more-generous.html\">more likely</a> to give to charity (though the relevance of this is <a href=\"http://www.secularism.org.uk/blog/2014/06/bbc-poll-shows-that-religious-people-give-more-to-charity-than-non-religious-maybe\">disputed</a>) and could be considered a natural target for Singer&apos;s arguments. In a similar vein, most EAs are utilitarian, but there&apos;s nothing uniquely utilitarian about the idea of EA; you can get to much the same conclusion via the <a href=\"http://lesswrong.com/lw/3gj/efficient_charity_do_unto_others/\">Golden Rule</a>.&#xA0;In so far as it is possible, we should want thought diversity, because the evidence suggests that it allows groups to <a href=\"http://econlog.econlib.org/archives/2015/01/diversity_of_th.html\">find and correct errors more quickly</a>. Another way of framing the same thing is that high thought diversity makes it easier to distinguish between facts and ideology, because ideologies will have their counter-ideologies expressed within the group.</p>\n<p>I&apos;m more optimistic about this area. We have a good variety views on economics, a noticeable but not overwhelming bias against religion, and a lot of healthy debate within the community generated by differing opinions on many other questions. Perhaps more importantly, I think the broad community already recognises our ability to &apos;agree-to-disagree&apos; on these areas as a Good Thing. This should allow us to continue in this way and not fall victim to <a href=\"http://lesswrong.com/lw/lr/evaporative_cooling_of_group_beliefs/\">evaporative cooling</a>.</p>\n<p>Our biggest blind spots are probably that we&apos;re short on social conservatives and overwhelmingly <a href=\"/ea/6w/cosmopolitanism/\">cosmopolitan</a>. Perhaps these are just too core to allow compromise on (in which case we might want to reconsider that &apos;Effective Altruism is not an ideology&apos; claim). But I think that people who are not on board with these views could easily still be on board with EA. For instance, there&apos;s no necessary conflict between feeling more attached to those in one&apos;s own country, as a non-cosmopolitan might, and donating to charities in other countries, especially when the effectiveness gap appears to be at least an order of magnitude. Certainly my greater attachment to my near and dear doesn&apos;t stop me donating to effective charities. I sometimes think we give up a little too easily and say &apos;well, people with That Particular View are never going to be on board with EA&apos;. Personally, I have more confidence in our ideas than that.</p>\n<hr>\n<p><strong><em>Appearance</em></strong></p>\n<p>This is where most debates about diversity start, and sadly where many of them finish, which is why I&apos;ve left it to last. I am mostly talking about race and gender here, but the same argument could apply to any quickly identifiable characteristic. For example. it probably also applies to groups of highly-educated people, who are often identifiable by the way they speak rather than look. What I&apos;m not going to talk about is discrimination on an individual level. An understated point in this debate is that you don&apos;t particularly need racists or sexists to have virtual segregation on race or gender. This is in spite of the fact that <a href=\"https://www.youtube.com/watch?v=JjfihtGefxk\">Schelling&apos;s work on this</a> is almost 5 decades old. I&apos;ll let Tim Harford (see link) talk for me here:</p>\n<blockquote>\n<p>Now these brown eggs aren&apos;t extreme racists; they&apos;re happy to live in a mixed neighbourhood. But they don&apos;t want their white neighbours to outnumber their brown neighbours by more than two-to-one...even a mild preference for the colour of your neighbour can lead to extreme segregation...although we as individuals may be rational and we may be tolerant, the society that we produce together may be neither rational nor tolerant.</p>\n</blockquote>\n<p>How we are doing here seems incredibly variable by location, so I don&apos;t want to generalize too much. One sense in which I think we are arguably doing badly is that many people aren&apos;t aware of the Schelling&apos;s work and also don&apos;t intuitively think in those terms. If someone is a visible minority-of-one in a group, a Good Bayesian should expect that to be contributing to them feeling uncomfortable,&#xA0;<strong>even if nobody is actually <em>doing</em> anything to make them uncomfortable</strong>. That person also becomes more valuable in the group, because their very presence makes the next person &apos;like them&apos; feel more comfortable, and so on. Note how superficial this arguably is compared to other things I&apos;ve described; merely sharing a race should give you less in common with someone than sharing experiences. But the speed of being able to identify your unusualness matters; first impressions matter.</p>\n<hr>\n<p><strong>Further discussion</strong></p>\n<p>Are there other types of diversity I haven&apos;t mentioned, that you think are worthy of note?</p>\n<p>How would you tackle these issues?</p>\n<p>Are they even worth tackling?</p>\n<hr>\n<p>*Denise Melchin can surely vouch for this.</p>\n<p>**The thread isn&apos;t actually that bad. As I said, this was my first reaction, and it was before there were many comments.</p></body></html>", "user": {"username": "AGB"}}, {"_id": "4gKqaGdDLtxm6NKnZ", "title": "Figuring Good Out - January", "postedAt": "2015-01-31T16:23:40.890Z", "htmlBody": "<html><body><p>For this month&apos;s Figuring Good Out on &quot;origin stories&quot;, we received a solid 6 submissions again.</p>\n<p><br>I wrote about&#xA0;<span><a href=\"http://a-nice-place-to-live.blogspot.ca/2015/01/changing.html\">my transition</a></span>&#xA0;from atheism to pop philosophy &amp; science to LessWrong to EA.</p>\n<p>Tom Ash created a <a href=\"/ea/da/a_taxonomy_of_ea_origin_stories/\">taxonomy of EA origin stories</a> by using anecdotes and survey data.</p>\n<p>Michelle Hutchinson&#xA0;<span><a href=\"http://www.effective-altruism.com/ea/e7/why_i_give/\">wrote about</a></span>&#xA0;how her meeting with Will Macaskill in graduate school led to her joining Giving What We Can.</p>\n<p>Bernadette Young&#xA0;<span><a href=\"http://www.effective-altruism.com/ea/e8/dorothea_brooke_an_alternative_origin_story_for/\">argued</a></span>&#xA0;that the literary character Dorothea Brooke is an alternative example of an EA advocate.</p>\n<p>Tom Stocker&#xA0;<span><a href=\"http://www.effective-altruism.com/ea/ef/many_winding_roads_an_ea_origin_story/\">explained</a></span>&#xA0;the many different factors that guided him toward EA.</p>\n<p>Peter Hurford&#xA0;<span><a href=\"http://www.effective-altruism.com/ea/ei/ea_is_the_best_choice_ive_ever_made/\">covered</a></span>&#xA0;how the connections he made in the EA network influenced major life decisions of his.</p>\n<p>&#xA0;</p>\n<p>February&apos;s topic, as suggested by Ben Kuhn &amp; Ruthie, is &quot;<strong>writing&#xA0;<em>about&#xA0;</em>explaining effective altruism</strong>.&quot; This isn&apos;t a call for new definitions or explanations of EA - it&apos;s a call for thinking about how to explain EA, especially in person.</p>\n<p>As usual, feel free to suggest topics and provide feedback. Have these been useful so far?</p></body></html>", "user": {"username": "Bitton"}}, {"_id": "pmWfCBv7duaCAmkJt", "title": "EA is the best choice I've ever made", "postedAt": "2015-01-30T20:25:15.191Z", "htmlBody": "<html><body><p><em>This is my contribution to the January edition of &quot;Figuring Good Out&quot;, entitled &quot;Origin Stories&quot;.</em></p>\n<p>...</p>\n<p>Many people think of effective altruism as some sort of sacrifice -- you have to give up income and time in some sort of moral obligation to make the world a better place. &#xA0;I think this approach is misguided. &#xA0;Instead, I think being an EA is the best choice I&apos;ve ever made for myself, personally and selfishly.</p>\n<p>In the most upvoted post on this forum so far, Helen Toner wrote that <a href=\"/ea/9s/effective_altruism_is_a_question_not_an_ideology/\">effective altruism is a question, not an ideology</a>. &#xA0;This is true -- but EA is also a network of people unified by the desire to answer these questions and act upon those answers.</p>\n<p>I think being a part of that network of passionate people has been <em>awesome</em>.</p>\n<p>...</p>\n<p>It all really started back in 2009, when I was 17. &#xA0;That&apos;s when I first started writing, working on a blog I made called Greatplay.net. &#xA0;It was mostly whatever I found interesting, without much of a unifying purpose. &#xA0;But then things changed.</p>\n<p>No, it wasn&apos;t effective altruism. &#xA0;Not yet. &#xA0;Instead, at the time, it was atheism.</p>\n<p>In the fall of 2010, I read Richard Carrier&#x2019;s <a href=\"http://smile.amazon.com/dp/1420802933?tag=phurford-20\">Sense and Goodness Without God</a>&#xA0;and Nicholas Everitt&#x2019;s <a href=\"http://www.amazon.com/dp/0415301076/?tag=phurford-20\">The Nonexistence of God</a>. I can&#x2019;t say that I believed in God prior to reading these books, but I definitely didn&#x2019;t believe in God after reading these books, and I promptly shifted my blog to a large discussion of why that was the case.</p>\n<p>Philosophy of religion mattered a lot to me then, and I wrote about it frequently. Around this time, I got involved with the community website <a href=\"http://www.lesswrong.com\">Less Wrong</a>.</p>\n<p>...</p>\n<p>In the fall of 2011, things changed again. I read Peter Singer&#x2019;s <a href=\"http://www.amazon.com/dp/B001S59CP0/?tag=phurford-20\">The Life You Can Save</a>.&#xA0;For the second time in my life, reading books changed everything. I continued to see some harm in religion, but this was dwarfed dramatically by the harms that come from factory farming and global poverty. I almost immediately resolved to stop eating meat and donate some of my income to effective non-profits in the third world.</p>\n<p>When I was first going through the phase where I was excited about atheism, one of the topics most frequently on my mind was how to find purpose without a god to look up to. &#xA0;I found humanism as a temporary answer to this question, but I wasn&apos;t satisfied until I found effective altruism. &#xA0;I finally had a chance to make a meaningful impact in the world, which is what I always wanted.</p>\n<p>Over the summer of 2012, I got involved in <a href=\"http://www.felicifia.org\">Felicifia</a>, a utilitarian forum, and spoke to many of the people there. &#xA0;Around the same time, I joined <a href=\"http://www.givingwhatwecan.org\">Giving What We Can</a> a little later, and pledged to donate 10% of my income.</p>\n<p>I continued to blog, but shifted my topics immediately to that of effective altruism.</p>\n<p>...</p>\n<p>Eventually, in the winter of 2012, I summoned the courage to post some of my EA writing to LessWrong. &#xA0;There, it was noticed by Michelle Hutchinson, who graciously invited me to write for the Giving What We Can blog. &#xA0;I enjoyed this, and built a relationship with the people there.</p>\n<p>Eventually, I heard that Giving What We Can was offering internships. &#xA0;I already had an internship lined up at the time, but I immediately (and politely) dashed it for the chance to spend a summer in Oxford working for Giving What We Can full-time for Summer 2013.</p>\n<p>I met many amazing people there and had many amazing discussions. &#xA0;While working there, I also met Joey, Xio, and Tom, who became some of my best friends and I&apos;ve enjoyed being able to collaborate with them on Charity Science.</p>\n<p>...</p>\n<p>After Giving What We Can, I went back to college to finish my last year, sad that I couldn&apos;t stay longer in Oxford.</p>\n<p>Throughout college, I had been studying political science. &#xA0;Prior to being exposed to EA, I was really excited about becoming a political science professor someday. &#xA0;After being exposed to EA, I thought about ways through which being a professor could make the world a better place.</p>\n<p>Sometime in Spring 2013, I had a Skype with Will Macaskill. &#xA0;I told him about my plan to make the world a better place through political science. &#xA0;He was very polite, but skeptical. &#xA0;I suddenly realized that my plan had to change.</p>\n<p>While working for Giving What We Can, I undertook a personal career search and had a few career advising sessions with 80,000 Hours. &#xA0;I finally narrowed things down to five potential careers. &#xA0;I posted about this <a href=\"http://lesswrong.com/lw/hr4/initial_thoughts_on_personally_finding_a/\">on LessWrong</a>.</p>\n<p>...</p>\n<p>A few days into posting about my careers on LessWrong, a user there -- who was a total stranger to me at the time -- reached out and offered to talk to me about one of the jobs I indicated, which was computer programming. &#xA0;His name was Rob. &#xA0;That initial reach out then solidified into dedicated programming tutoring, for free.</p>\n<p>Eventually, I learned that the company Rob worked for was looking for interns. &#xA0;Rob encouraged me to apply and offered to submit my resume internally. &#xA0;Three interviews over the next three weeks and I had the internship. &#xA0;The internal referral came from an EA and the skills I needed to get through the interview were due to coaching by an EA. &#xA0;In fact, my entire inspiration for looking for a career in computer programming was due to the EAs I already knew in the field telling me it was promising.</p>\n<p>I enjoy my job. &#xA0;I&apos;m working now as a data scientist, and the work environment is fun, the problems are challenging, and I like my co-workers. &#xA0;If I didn&apos;t know any EAs, I&apos;d probably be in graduate school right now, and I think that would be a lot less fun.</p>\n<p>...</p>\n<p>Thanks to the EA network, I&apos;ve had an incredible opportunity to do good in ways I never thought were possible. &#xA0;But I&apos;ve had more than that. &#xA0;I&apos;ve made great friendships. &#xA0;I got my first career, and a network to help me find dozens more jobs if I ever need them. &#xA0;I have a support network for guidance.</p>\n<p>I&apos;ve lost count of the number of times I&apos;ve asked for help on something and received it because that person was an EA and I was an EA too. &#xA0;It&apos;s been phenomenal to be a part of a network where we truly have the same goals, and helping out other people in the network is just as good as helping myself.</p>\n<p>I&apos;m excited for the chance to be in the EA network. &#xA0;I think it&apos;s been great for me, and I can&apos;t wait to see what comes next.</p></body></html>", "user": {"username": "Peter_Hurford"}}, {"_id": "5fYz6tnJaAZM9yhJF", "title": "TLYCS Pamphleting Pilot Plan", "postedAt": "2015-01-30T18:02:42.341Z", "htmlBody": "<html><body><p>I&apos;ve been iterating back and forth with Jon Behar at TLYCS, and we&apos;ve finally honed in on a plan for the pamphleting pilot. The document was rendered with TeX and won&apos;t cut and paste nicely (sorry about that), but you can view and download the PDF <a href=\"https://drive.google.com/file/d/0ByFxvhXPmbsiMVQtUk83Zjd5LWs/view?usp=sharing\">here</a>. I would love to get some feedback on our approach and (especially) our planned metrics. Thanks!</p></body></html>", "user": {"username": "jonathonsmith"}}, {"_id": "gaoBE2d9JwYH9jST2", "title": "Effective Altruism and Utilitarianism", "postedAt": "2015-01-30T11:18:15.943Z", "htmlBody": "<html><body><p><span>I think it&#x2019;d be interesting to discuss the relationship between effective altruism and utilitarianism (or <a href=\"http://plato.stanford.edu/entries/consequentialism/\">consequentialism</a> more broadly). These are my initial reflections on the topic, intended as a launching point for discussion rather than a comprehensive survey. (Despite the five years I spent studying philosophy - before deciding that this didn&#x2019;t actually help anyone! - </span><span>this post is</span><span>&#xA0;focused on practicalities rather than precise analysis, though I&#x2019;d enjoy hearing that too.)</span></p>\n<h2><span>A classification of EA views</span></h2>\n<p><span>EAs often say that their views don&#x2019;t presuppose </span><span>consequentialism</span><span>&#xA0;(in its classic form, the view that an act is right if and only if it results in at least as much expected good as any other available act). And this is true for a wide range of characteristically EA views, such as that giving </span><span><a href=\"http://effectivealtruismhub.com/donations\">large sums</a></span><span>&#xA0;(say </span><span>10% of your income</span><span>) to </span><span><a href=\"http://effectivealtruismhub.com/actions/donating\">charities ranked as highly cost-effective</a></span><span>&#xA0;is a good thing. </span><span>However it is not true for other views which some regard as part of EA, such as that small chances of astronomical effects on the sorts of lives that are brought about in the future can overwhelm any effects your actions have on people who exist now.</span><span>&#xA0;</span><span>This may not logically presuppose consequentialism, but it is generally based on it. On many moral views people who don&#x2019;t exist - and especially people who wouldn&#x2019;t exist but for your actions - don&#x2019;t matter morally in the same way as people who do. So it is helpful to divide EA beliefs into these three categories:</span></p>\n<ol>\n<li><span>Those that are probably true even if consequentialism is false</span></li>\n<li><span>Those that are probably false - sometimes even repugnant! - on non-consequentialist views</span></li>\n<li><span>Those that fall into neither of the above categories (it will be a toss-up whether these beliefs are true </span><span>even if </span><span>consequentialism is false).</span></li>\n</ol>\n<p><span>Which category a belief</span><span>&#xA0;</span><span>falls into is important. One uncontroversial reason for this is that many people are not consequentialists and that we want to convince them. Beliefs in category 1 will be the easiest sell, followed by those in category 3; beliefs in category 2 will be a tough sell.</span></p>\n<p><span>Another reason is that consequentialism may be false. The importance of this possibility depends upon the probability we assign to it, but it must carry </span><span>some</span><span>&#xA0;weight unless it can be rejected absolutely, </span><span>which is only plausible on the most extreme forms of </span><span><a href=\"http://en.wikipedia.org/wiki/Ethical_subjectivism\">moral subjectivism</a></span><span>. I do not find these views credible, but going into this would be a digression, so I&#x2019;ll simply flag that moral subjectivists will have a different perspective on this.</span><span>&#xA0;I&#x2019;ve also found that some other </span><span><a href=\"http://plato.stanford.edu/entries/moral-anti-realism/\">anti-realists</a></span><span>&#xA0;are extremely confident (though not certain) that consequentialism is true, though it&#x2019;s an open question how often this is reasonable.</span></p>\n<p><span>When we&#x2019;re concerned with convincing non-consequentialists, we will focus on the particular non-consequentialist positions that they hold, which will generally be those that are most popular. When we&#x2019;re concerned with the possibility that consequentialism is false, by contrast, we should really care about whether the EA views at issue are true or false on the non-consequentialist theories that we find most </span><span>plausible</span><span>&#xA0;rather than on the theories that are most </span><span>popular</span><span>. For instance, if you think that you might owe special duties to family members then this is relevant regardless of how popular that position is. </span><span>(That said, its very popularity may make you find it more plausible, as you may wish to avoid overconfidently rejecting moral claims that many thoughtful people </span><span>accept</span><span>.)</span></p>\n<h2><span>Which categories do EA views fall into?</span></h2>\n<p><span>The answer to this question depends on what non-consequentialist positions we are talking about. I&#x2019;ll consider a few in turn.</span></p>\n<p><span>First, take the position that people who don&#x2019;t exist have less moral weight. </span><span>There are several versions of this position, each with different implications. On one version, only people who exist matter at all; this would make far future oriented charities less promising. On another, people who don&#x2019;t yet exist matter less; the implications of this depend on how much less, but in some cases effects on non-existent people won&#x2019;t alter which charities are most effective. On yet another, certain </span><span>sorts</span><span>&#xA0;of people matter less - for example, those who won&#x2019;t exist because you acted a certain way. This example would affect our evaluation of existential risk charities.</span></p>\n<p><span>Second, there are a wide variety of positions which directly or indirectly reduce the relative moral weight of animals, or of people who don&#x2019;t currently exist. Consequentialism (and in particular <a href=\"http://plato.stanford.edu/entries/consequentialism/#ClaUti\">classical utilitarianism</a>, or some aspects thereof) is plausibly the moral theory that is friendliest to them. </span><span>For example, when it focuses on pleasure and pain it puts concern for animals on the strongest possible ground, since it is in their capacity to feel pain that animals are closest to us</span><span>. </span><span>So we should expect animals&#x2019; moral weight to decrease if we give some credence to these positions. </span></p>\n<p><span>A third sort of non-consequentialist position is that we should not act wrongly in certain ways even if the results of doing so appear positive in a purely consequentialist calculus. On this position we should not treat our ends as justifying absolutely any means. Examples of prohibited means could be any of the adjectives or nouns commonly associated with wrongdoing: dishonesty, unfairness, cruelty, theft, et cetera. This view has strong intuitive force. And even if we don&#x2019;t straightforwardly accept it, it&#x2019;s hard not to think that a sensitivity to the badness of this sort of behaviour is a good thing, </span><span>as is a rule of thumb prohibiting them</span><span>&#xA0;- something that many consequentialists accept.</span></p>\n<p><span>It would be naive to suppose that effective altruists are immune to acting in these wrong ways - after all, they&#x2019;re not always motivated by being unusually nice or moral people. Indeed, effective altruism </span><span>makes</span><span>&#xA0;some people more likely to act like this by providing </span><span>ready-made rationalisations which treat them as working towards overwhelming important ends, and indeed as vastly important figures whose productivity must be bolstered at all costs</span><span>. </span><span>I&#x2019;ve seen prominent EAs use these justifications for actions that would shock people in more normal circles. I shouldn&#x2019;t give specific examples that are not already in the public domain. But some of you will remember a Facebook controversy about something (allegedly and contestedly) said at the 2013 EA Summit, though I think it&#x2019;d be fairest not to describe it in the comments. And there are also attitudes that are sufficiently common to not be personally identifiable, such as that one&#x2019;s life as an important EA is worth that of at least 20 &#x201C;normal&#x201D; people.</span></p>\n<p><span>A fourth and final non-consequentialist position to consider is that you owe special duties to family members or others who are close to you, and perhaps also to those with whom you have looser relations, such as your fellow citizens. This may limit the resources that you should devote to effective altruism, depending on how these duties are to be weighed. It may give you </span><span>permission to favour your near and dear. </span><span>However, it seems implausible that it generally makes it </span><span>wrong</span><span>&#xA0;to donate 10% of your income, though a non-consequentialist friend did once argue this to me</span><span>&#xA0;(saying that taking aunts out for fancy meals should take priority)</span><span>. </span></p>\n<p><span>An important question about this position is how the special duties it refers to are to be weighed against EA actions. It may be that the case for these actions is so overwhelming - because of contingent facts about the way the world happens to be, with severe poverty that can be alleviated astonishingly cheaply - that they significantly reduce the call of these duties. The sheer scale of the good that we can do does seem to provide unusually strong reasons for action. However to assume that this scale is decisive would be to fail to take the possibility that consequentialism is false seriously, because non-consequentialists are not concerned only with scale.</span></p>\n<p><span>Taking a step back, it&#x2019;s worth noting that in the above I&#x2019;ve focused on the ways in which </span><span>some</span><span>&#xA0;effective altruists could go wrong if consequentialism is false. The outlook for effective altruism in general is still quite positive in this case. On most non-consequentialist views, effective altruist actions generally range from being supererogatory (good, but beyond the call of duty) to being morally neutral. These views generally consider giving to charity good and would consider taking this to EA lengths at worst misplaced, not seriously morally wrong (unless you seriously neglect those for whom you are responsible). They would hardly consider concern for animals&#x2019; wellbeing morally wrong either, even if animals have a significantly lower moral status than humans.</span></p>\n<p><span>Ironically, the worst these views would generally say about effective altruism is that it suffers from high opportunity costs. Having mistaken what matters, an effective altruist would not pursue it effectively. But these views generally consider that supererogatory, so again the picture is not so bad. (I owe these points to Gregory Lewis.)</span></p>\n<h2><span>What&#x2019;s your take?</span></h2>\n<p><span>I&#x2019;d love to hear people&#x2019;s take on these issues, and on the relationship between effective altruism and consequentialism more broadly, which I certainly haven&#x2019;t covered comprehensively. Which of the non-consequentialist positions above do you find most plausible, and what are the implications of this? And are there other non-consequentialist positions that would have implications for effective altruists?</span></p>\n<p><span><em>(I would like to thank Theron Pummer, Gregory Lewis and Jonas M&#xFC;ller for helpful comments.)</em></span></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "rmHGEZB286wRYj7Ct", "title": "Many winding roads: an EA origin story", "postedAt": "2015-01-29T14:50:29.266Z", "htmlBody": "<html><body><p><span>Thank you Peter for suggesting this. This is my first post, and I&apos;ve not blogged successfully. Feedback in the forms of evaluation/appreciation/coaching are all very welcome, either to <a href=\"mailto:tomjwstocker@gmail.com\">tomjwstocker@gmail.com</a> or on the comments section (e.g. am I doing too much / is it too long etc).</span></p>\n<p>I have wanted to hear people&apos;s &apos;testimonies&apos; for a long time (what I&apos;ve heard this kind of thing called in evangelical religious movements - activist and political movements I&apos;ve been around have called it something like &apos;getting involved&apos;). I think these are important as you&apos;re able to see why people are here, and you&apos;re able to see how other people you&apos;re talking might be better encouraged to join in.</p>\n<p>It is however, a bit strange to give a testimony to an audience of x&gt;1, as &quot;EA&quot; feels like such an all encompassing thing to come to and usually I&apos;d be selective depending on who&apos;s in front of me. I&apos;ve tried to do this post by communicating all the possible stories that could have contributed to my journey from a little altruistic and ineffective, to quite altruistic and a little effective. My hope in writing this is that readers get insight into how to help people move themselves further along the altruism scale. I see the desire to be effective as a function of genuine altruism - as opposed to thinking of yourself as altruistically motivated - and knowledge, and the knowledge is already here in abundance, so that&apos;s the focus.</p>\n<h1><span>Section 1: The threads</span></h1>\n<p>These are the stories I tell myself about why I care / how I learnt about how to approach altruism etc.</p>\n<h2>Depression</h2>\n<p>Depression in teenage years, surrounded by posh and rich while being posh and poor, while having a few very good friends that were extremely disadvantaged seemed to create an anti-authoritarian or anti-cultural sentiment against the rich. This lead to questioning of power structures, cultural norms, who appropriated wealth, whether things could change and what I could do about it. This questioning lead me to leftists, democracy and human rights activists, the environmental movement around climate camp, economics, and eventually, GWWC. As soon as I befriended other people that seemed to care, I became happy. It was a non-trivial depression that I think came from false-guilt and a deep sense of isolation. It could also just have been random biology.</p>\n<h2>Medicine</h2>\n<h2>\n<p>Not knowing really what to do with my life in school, as I was an intellectual jack of all trades, I sought advice. People said I would make a great doctor, and I couldn&apos;t think of anything better. Through the application process I was socialised to convince myself that I wanted to help society (although I did before hand, this process brought out this desire into a place of greater prominence).</p>\n</h2>\n<h2>Complex Regional Pain Syndrome</h2>\n<p>Severe pain in early 20s: after fairly routine knee surgeries for what was thought to be juvenile arthritis, I developed Complex Regional Pain Syndrome, and deteriorated over 6 months without a diagnosis to the point where I was in big, incessant pain and relied on a wheelchair. This made me reflect on:</p>\n<p>a). how society, people I thought were friends etc. just couldn&apos;t handle the thought of someone young being in a wheelchair, and couldn&apos;t be bothered to empathise or think through their failure to acknowledge the importance pain has on a life. This revealed very starkly a collective blind spot to suffering. I&apos;ve thought about this. It appears like cowardice, but I think its a moral cheating mechanism - hear no evil/see no evil then I don&apos;t have to act, so my subconscious which is to some extent directed by conscious choices and feelings relating to how much you think others matter, is going to block out the evil where possible. I thought from this that people would also have similar responses to others in pain or other societal problems.</p>\n<p>b). if I&apos;m suffering to this extent, and there are 6.x bn people on the planet, there must be a very large category of people suffering to a much worse extent. This generated deep wells of compassion and motivation.</p>\n<h2>&quot;Spiritual journey&quot;</h2>\n<p>I formed atheist/agnostic views at a young age through poor role models and logic. However, while in big pain, became interested in meditation. I meditated regularly for 18 months and developed a strange and wonderful set of subjective experiences. These included intense feelings about the value and sanctity of life, and periods of feeling overwhelmed by compassion and overwhelmed by the suffering of the world, and by the large scale neglect of the global poor. This helped with motivation. The meditation also facilitated a calm, inquiring approach, and reduced my horrendous ego. Unfortunately, I got freaked out by some other experiences, and gave up practicing, and the horrendous ego is back with vengeance - I&apos;m only now starting to develop a practice again after 4-5 years because the ego has become a limiting factor in my attempts to improve the condition of humanity.</p>\n<h2>Meeting fantastic people</h2>\n<p>With a fair amount of free time studying medicine at a low-intensity university (Manchester), I went out to try and learn about the problems in the world. One way of doing this was documentary night. The person running it was a book-seller activist involved in many causes in effective ways that moved groups along without putting him in the limelight. This person gave me an activist mentoring and he ended up as my best man. There were other fantastic people that coached and pointed me in the right direction along the way, but Adie and my wife Abbie stand out among them.</p>\n<p>After becoming an &apos;EA&apos;, discovering the EA community was just fantastic, and the living examples of Toby etc. boosted the altruism component of my life no end through social proofing / inspiration (even though I haven&apos;t interacted with other EAs that much yet).</p>\n<h2>Trial and error</h2>\n<p>Since 2006 I&apos;ve thrown my all into a very wide range of projects. I started off doing things like working with an autistic child, mentoring asylum seeker children in maths and English, and going to talks to challenge powerful people. Then community work, then non-violent direct action, then gallivanting around the world volunteering for interesting organisations like:&#xA0;</p>\n<p><a href=\"http://clp-bangladesh.org/\">Multi-faceted poverty alleviation for the extreme poor</a> (Bangladesh)</p>\n<p><a href=\"http://www.icahd.org/uk\">Challenging house demolitions as a means to advocate for peace</a> (Israel)</p>\n<p><a href=\"http://www.holylandtrust.org/\">Advocacy for an end to the occupation and reconciliation of fractured palestinian communities</a> (Palestine - this one involved an arrest and beating in response to a reasonable question)</p>\n<p><a href=\"http://wozazimbabwe.org/\">Encouraging women to stand up in the face of violence for a better government</a> (Zimbabwe)</p>\n<p>Then trying out different things in professional life: public health analyst in Ghana, Comms guy at WaterAid, NHS manager, healthcare productivity consultant, and now upstart at a medical regulator.</p>\n<h2>Economics</h2>\n<p>I did a back of the envelope calculation of being a doctor in terms of years of healthy life. I was disappointed. I thought it would be worth the gamble of doing PPE at Oxford, with the view of changing the hearts and minds of the elite and learning about how to do management/policy/politics as a gamble that there would be a much better way of spending my life on others. Economics helped me think about effectiveness, and slowly won me round to accepting the market as a pretty powerful and necessary thing, which stopped me thinking about poverty in terms of community or state eradication of markets, and opened up a whole new way of thinking about effectiveness (it was there before, but only partial rather than a central thing).</p>\n<h2>Empowerment through small victories</h2>\n<p>One notable example was a fantastic opportunity to save lives after a cyclone in Bangladesh destroyed the water and waste systems and cholera had just started to pick up pace, which I took with both hands. This was very empowering as I organised the whole thing myself - procurement, partnership, negotiation, leveraging local government finances, raising finances from friends etc. and it was made very easy for me because there were great local people that responded quickly to my requests for help in defining the problems and delivering the solutions.</p>\n<h2><strong>Other potential but less&#xA0;prominent&#xA0;sources of inspiration to make effective action for others a priority</strong></h2>\n<p>Books like<a href=\"http://www.amazon.co.uk/The-Life-You-Can-Save/dp/0330454587\"> Peter Singer</a>&apos;s <a href=\"http://www.amazon.co.uk/Bad-Pharma-companies-mislead-patients/dp/0007350740\">Ben Goldacre</a>&apos;s etc. etc.</p>\n<p>Historical movements like Anarchism, Communism, Civil Women&apos;s and Human rights, Utilitarianism, Christianity, anti-colonial struggles, (international) public health.&#xA0;</p>\n<p>Big name examples like Tutu, Ghandi, Gates, Mandela, John Templeton, Buddha, Dalai Lama, Amilcar Cabral...</p>\n<p>Cultural things like <a href=\"https://www.youtube.com/watch?v=4CI3lhyNKfo\">WW2 liberation songs</a>.</p>\n<h1>Section 2: Current things I&apos;m working on (probably too much in here)</h1>\n<p>Here are my current projects. There up here for suggestions and challenge, and so that the introduction is complete enough that people can help signpost/get in touch.</p>\n<p><strong>Current priorities:</strong></p>\n<p>Reforming my organistation, as a first step to reforming regulation or the control of social harms (the first part of this feels increasingly like a bad strategy)</p>\n<p>Supporting my family</p>\n<p><strong>Currently allocating time to:</strong></p>\n<p>The medical improvement project: understanding how to improve the performance of clinical practice, including the speeding up of evidence generation and translation to practice (might write a book related to this)</p>\n<p>The suffering identification project: how to find which individuals are experiencing the most intense suffering (might write a book related to this)</p>\n<p>The commissioning project: how to move commissioning towards optimal for NHS services in the UK</p>\n<p>Supporting others making a difference or to start doing so</p>\n<p>The character improvement project: how to be a better person, especially to those immediately around me</p>\n<p>Productivity improvements: doing the things on the list better, and challenging the time allocated to each</p>\n<p>Doing up our house</p>\n<p>Starting the adoption process and growing our family</p>\n<p><strong>Backburner:</strong></p>\n<p>Earning and giving project: how to make more money and give it away to help people</p>\n<p>Policy and governance project: how to improve the way policy is done and how public services are governed</p>\n<p>Keeping an eye out for surprising opportunities to serve</p></body></html>", "user": {"username": "tomstocker"}}, {"_id": "cPihAcJ8z5BZQ8hDB", "title": "On making spaces friendlier to parents", "postedAt": "2015-01-27T22:06:13.728Z", "htmlBody": "<html><body><p><em>Julia and her husband run an effective altruism meetup series in Boston. They have a 10-month-old daughter. This post is adapted from Julia&apos;s <a href=\"https://thewholesky.wordpress.com/2015/01/27/why-i-take-my-kid-almost-everywhere/\">blog</a>.</em></p>\n<p>.....</p>\n<p>I&apos;ve been thinking about how a social scene becomes more or less friendly to parents and children, and why it might be in the interest of the Effective Altruism movement to be more friendly.</p>\n<p>Jeff&apos;s and my social life has mostly been composed of three circles, two well-established and one newer.</p>\n<p>The folk dance scene is well-established. Lots of people got into it during the folk revival of the 1970s, and now there are lots of second-generation dancers my age. Both baby boomers and 20-somethings are&#xA0;excited about a new generation coming into the traditions. The activities themselves are fairly child-friendly&#x2014;you can wear a baby or toddler while contra dancing, and children can start dancing themselves once they&apos;re about 5. The women&apos;s Morris team I dance with are 30 of Lily&apos;s biggest fans, and we&apos;re never short of helping hands when we tour with them. I&apos;ve heard older women say that the reason our team has never lacked for members is that it was supportive of young mothers in the 1980s, and those women came back, bringing their daughters and their daughters&apos; friends. Some other teams lost a wave of women at the point that nobody would help them hold the baby at a gig.&#xA0;</p>\n<p>(Relatedly, I understand this is why Google gives more generous parental and especially <a href=\"http://www.today.com/money/googles-formula-retain-women-longer-maternity-leave-962541\">maternity leave</a>&#xA0;than most American companies. They wanted to reduce the high attrition rate of female engineers, who were especially likely to quit after having children. The longer maternity leave has indeed reduced attrition.)</p>\n<p>We&apos;re not really active in Quaker circles anymore, but our meeting was very child-friendly, in part because it was founded 30 years ago to be more child-friendly than the other local meeting. As with Morris, a few decades ago there was a shift from seeing childcare as something that the child&apos;s own mother was expected to provide at all times to something that was more supported by the community.&#xA0;</p>\n<p>Then there&apos;s our third social circle, the effective altruist/rationalist scene (I realize these are separate scenes in most places, but in Boston they&apos;re pretty intertwined.) It&apos;s made almost entirely of young childless people. There are more child-free-by-choice people and more antinatalist ideology, both of which are fine with me. The activities themselves are less child-friendly, in that intellectual discussion is harder to do while someone is making silly squealing noises in the corner. As Lily comes into the awkward age of being too old to play quietly on the floor and too young to follow the conversation, I expect it will be harder to keep her quietly amused. So there&apos;s a question of how much Lily will tolerate adult activities, and how much our friends will tolerate Lily being a child.</p>\n<p>.....</p>\n<p>So why wouldn&apos;t parents just use a babysitter?</p>\n<p>Imagine we went to an afternoon discussion group - we&apos;d need to spend time finding and screening sitters, then arrange with one who was available at that time. If we&apos;re gone 3 hours (plus 30 minutes to show the sitter around and let the child get acquainted), at the $12/hour going rate in our city, that&apos;s a total of $42. For us, that&apos;s an expensive afternoon out.</p>\n<p>Also, maybe this is just me being a first-time parent and believing my child is more of a fragile flower than she is, but our one experience with a sitter did not go all that well, even with someone I thought was going to be totally capable. And my kid doesn&apos;t reliably eat for other people, so we don&apos;t want to come home to find her crying with hunger (it&apos;s happened). I<span>f using sitters works for your family, great! It just hasn&apos;t worked for us.</span></p>\n<p>For breastfeeding mothers, being away from the baby for a significant amount of time means needing to pump milk. Bringing Lily with me and feeding her at a gathering is easier and more fun than washing the pump parts, packing it all up, excusing myself to the bathroom during the event to pump alone, and keeping the milk cold until we get home. To be away from her for something as long as a weekend would mean way more pumping and stockpiling of milk than I am willing to do. At this point she won&apos;t drink formula, so we can&apos;t just switch her main food at whim.</p>\n<p>I think it&apos;s good for Lily to see more than the same few rooms and toys every day. She&apos;s interested in seeing different places and faces.&#xA0;</p>\n<p>Also, I love&#xA0;Lily and I like having her near me. It&apos;s not surprising that parents would evolve this way.</p>\n<p>.....</p>\n<p>The only really negative comment I got when I was pregnant was &quot;I guess that&apos;s okay, as long as I never have to see the kid or hear it.&quot; This was from an organizer of a meetup (not an EA meetup) we had attended for years, and I nearly interpreted it as a command not to come back once I had a child in tow. Jeff assures me the person must have meant it as a joke. I didn&apos;t think it was a good joke.</p>\n<p>I don&apos;t like dogs, and I&apos;ve encountered service dogs that were about as badly-behaved as my baby (making noise, trying to eat other people&apos;s belongings). But I would never tell somebody I didn&apos;t want to see them if they were going to bring their dog.&#xA0;</p>\n<p>I&apos;m fine with some spaces being kept quiet and tidy&#x2014;performances, parties that have been announced as adult-only, etc. But there are a lot of borderline cases. Can I bring my baby to an academic conference? To a panel where I&apos;m a panelist? (I&apos;ve been assuming the answer is &quot;yes&quot; for those two, and nobody has stopped me.) Is a baby babbling or a toddler whispering more distracting than an adult coughing? Or an adult&#xA0;with a hissing oxygen machine? If we would be okay with those adults present, I&apos;d say we should also be okay with a reasonably quiet child. Jeff and I do remove Lily if we think she&apos;s too distracting or loud, but I think minor child noises should be considered acceptable.&#xA0;</p>\n<p>I recognize the element of choice here&#x2014;I chose to have a baby, and people who need service animals or oxygen machines did not choose to need those things. But I think supporting the continuation of humanity and the socialization of the next generation can be considered a pretty basic part of human life. I understand that you may really dislike children. But understand that if you don&apos;t want children in your presence or at your event, it&apos;s not only the child you exclude. It&apos;s me.</p>\n<p>.....</p>\n<p>It&apos;s not just when children are brought to events that these issues come up.</p>\n<p>Years ago I went out with a friend a few months after the birth of her son. It was her first time out without him. We went to the swing dance at MIT, and a young man there (probably an MIT student) asked her what she did for a living.</p>\n<p>&quot;I&apos;m a stay-at-home mom,&quot; she answered.</p>\n<p>&quot;Oh, that&apos;s weird,&quot; he said.</p>\n<p>She was too jangled to ask what he meant by that, so we&apos;ll never know. In his life in a mostly-male top-notch academic enclave (sound like anyone you know?), he probably didn&apos;t know any stay-at-home parents. So maybe he meant &quot;I don&apos;t know anyone with that occupation.&quot; Maybe he meant, &quot;You seem too smart for that.&quot; (In fact, I think parenting was more rewarding than the PhD program she had quit.) Maybe it was just his default response when he was surprised.</p>\n<p>If your life does not include any stay-at-home mothers (or any construction workers, or any other group you don&apos;t have much contact with), take a moment now and reflect that this is not actually a weird occupation. If this is your default thing to say when you are surprised, please think of a different thing to say.</p>\n<p>.....</p>\n<p>I&apos;ve heard discussion about whether having children is a good way to increase the number of people in the EA community. I don&apos;t think it is per se, because it&apos;s much faster to talk to other adults than to raise people from infancy. Hosting an EA discussion group is probably a much better way to spread these ideas than having children. I was an antinatalist myself for a long time, and though I no longer agree with those ideas, I can understand why other people hold them.</p>\n<p>But this is not about whether you like children, or whether you agree with having children in principle. It&apos;s about who you welcome in. A large proportion of adults are parents, and to exclude parents is to keep this a movement with an unnecessarily narrow demographic.</p>\n<p>.....</p>\n<p>What can you do to make spaces more welcoming to parents and children? (These suggestions are mostly based on my experience with babies. Parents of older children can chime in with their suggestions.)</p>\n<ul>\n<li>Say, &quot;It&apos;s good to see you. I&apos;m glad you could come!&quot;&#xA0;</li>\n<li>Converse with the parent like they are a normal person. It&apos;s fine to talk about the baby or not. But consider that they probably came to an effective altruism discussion to talk about effective altruism, and allow time for that.</li>\n<li>Don&apos;t give a young child food or objects without asking. You&apos;d be surprised at what kids can tear up and choke on.</li>\n<li>If the parent is having a hard time juggling coat, shoes, baby, and bags, ask if you can hold anything.</li>\n<li>If there&apos;s a quiet space (like a bedroom or a sofa in another room) that you&apos;re okay with them using, offer to let the parent use it for feeding or hanging out with a fussy child. Bonus: now you don&apos;t have to be in the same room with said fussy child. It&apos;s probably a good idea to mention this as a general offer&#xA0;<em>before</em>&#xA0;the child gets fussy, so&#xA0;it doesn&apos;t come across as&#xA0;a veiled &quot;Your child is annoying me; please remove it.&quot;</li>\n<li>Offer to hold or supervise the child while the parent goes to the bathroom or gets something to eat.</li>\n<li>Spend some time talking with an older child&#x2014;do they have questions about the discussion? What is their favorite book? Do they like animals? Did they do anything fun this week?</li>\n<li>If the child really is disrupting the event, an organizer can take the parent aside&#xA0;and figure out a plan (&quot;I&apos;m worried that people can&apos;t hear the discussion well. Is there anything I can do to help? Would you be able to take your child to another room while she calms down?&quot;)</li>\n</ul>\n<p>You don&apos;t have to do all these things if you&apos;re not comfortable with them, but the first one would be a really good start.</p>\n<p>Lots of people in this movement have been very nice to my family. Thank you! Keep up the good work!</p></body></html>", "user": {"username": "Julia_Wise"}}, {"_id": "6LruduxDH92d8vJKs", "title": "Does It Make Sense to Make Multi-Year Donation Commitments to One Organization?", "postedAt": "2015-01-27T19:37:30.175Z", "htmlBody": "<html><body><p><span>The following is my answer to a question posted in the January open thread:</span><span><br></span><span><br></span><span>Do you think it is better to decide each year where to donate, or to give organizations multi-year commitments of what you expect to donate?</span><span> </span><span><br></span><span><br></span><span>Short Answer</span></p>\n<p><span>It&apos;s better to decide each year where to donate if you&apos;re donating less than several thousand dollars per year, and you don&apos;t have very high confidence where to donate. If you donate several thousand dollars per year, or in excess of that, and you don&apos;t believe your donation preferences will change much, it may make sense to let organizations know you expect to donate to them for several years.</span></p>\n<p><span>Long Answer</span></p>\n<p><span>The following answer is based on my experience as having previously worked for a charity fundraising company, been a regular monthly donor to World Animal Protection, and the experiences of myself and other supporters of effective altruism as donors.</span></p>\n<p><span>Donations In General</span></p>\n<p><span><span> </span>Based on work and personal experience, it seems most charities, and non-profits, are much more concerned with their short- and medium-term operation and goals. That&apos;s because the continuance of the organization is based on meeting these goals, and achieving long-term goals is based upon the organization still existing, e.g., several years from now. Thus, my impression is that most charities and non-profits are relieved enough that their base of donors lets them know they&apos;ll continue to donate on a monthly basis, never mind an annual one.</span></p>\n<p><span><span> </span>Of course, organizations want this information because it gives them a confidence interval for much funding they&apos;ll receive, which in turn dictates their budget for operations and projects. The biggest donors to an organization will have the greatest impact on an organization&apos;s budget, and its expectations of future funding. These donors are the ones organizations will focus on getting information on donation plans from on a year-to-year basis. Ask yourself: are you among the biggest donors to an organization?</span></p>\n<p><span><span> </span>As an example, the <a href=\"https://intelligence.org/\">Machine Intelligence Research Institute</a> publishes a <a href=\"https://intelligence.org/topdonors/\">list of its top donors</a> over its history. A &apos;top donor&apos; is someone who has donated </span><span><em>=&gt;$5000 USD</em></span><span> to the MIRI. <a href=\"http://www.animalcharityevaluators.org/\">Animal Charity Evaluators</a> also publishes a <a href=\"http://www.animalcharityevaluators.org/donate/top-donors/\">list of its own top donors</a>, one of their &apos;top donors&apos; being someone who has donated </span><span><em>=&gt;$1000</em></span><span>. The MIRI has existed longer than ACE has, and also has a greater operating budget. So, what would qualify you as a &apos;top donor&apos; varies by organization. If you believe you fall into the category of &apos;top donor&apos; to an organization, and will do so in the future, making a multi-year commitment may make sense. If you don&apos;t know the answer to the question, you can always ask the organization.</span></p>\n<p><span><span> </span>Just ask them, out of curiosity, what percentage your donation makes up of their total operating budget, and how much your regular donations impact their medium-term budget planning. At this point, you have no obligation to disclose you&apos;re considering a multi-year commitment to donating to the organization in question.</span></p>\n<p><span>Donations and Effective Altruism</span></p>\n<p><span><span> </span>I believe the concerns of donors influenced by effective altruism make it so making a multi-year commitment to an organization that you expect to donate to them is not as good an idea.</span></p>\n<p><span><span> </span>First of all, effective organizations, such as Givewell-recommended charities, may run into <a href=\"http://en.wikipedia.org/wiki/Room_for_more_funding\">room for more funding issues</a></span><span>. This means organizations may hit a point at which the marginal donation to that organization will do less good than the same amount donated to a different organization. For example, at the end of 2013, Givewell believed its normally top-recommended charity, the Against Malaria Foundation, hadn&apos;t distributed enough malaria bed nets, or had the capacity to effectively allocate funds, such that Givewell recommended GiveDirectly as its top charity over Against Malaria Foundation for most of 2014. This was controversial within effective altruism, as several individuals, and also Giving What We Can, disagreed with Givewell&apos;s analysis and conclusion on regarding the AMF.</span></p>\n<p><span><span> </span>Anyway, similar issues may be raised in the future. Now, in a way, most of us don&apos;t believe ourselves as capable or experienced as Givewell or Giving What We Can to evaluate charities. So, we trust them to do so on behalf of the movement. If, as an individual, you make a multi-year commitment to organization, it may be awkward in future years when a charity evaluator you trust no longer recommends that organization as the &apos;best place to donate&apos;. Given that effective altruism focuses on supporting the most effective organizations for any present time, what&apos;s considered &apos;the best place to donate&apos; may change relatively quickly. This would render a multi-year donation commitment sub-optimal, and may make a relationship with an organization more awkward.</span></p>\n<p><span><span> </span>Of course, some of us donated lots of money to the Against Malaria Foundation in 2013, then switched to GiveDirectly in 2014, and will resume donating to the AMF in 2015, now that it&apos;s Givewell&apos;s top recommendation again. Still, the opportunity for such flexibility is still a point against a multi-year commitment.</span></p>\n<p><span><span> </span>Some causes areas are popular within effective altruism because to some they seem very neglected, or hold lots of value, even though they&apos;re not as tractable as global poverty. Such cause areas include animal advocacy, or existential risk reduction. By &apos;tractable&apos;, I mean to what extent we&apos;re confident what we do in the present will lead to desired goods in the future. Sometimes figuring if a cause area is tractable is difficult because the evidence to reach a conclusion hasn&apos;t been collected or evaluated yet, or because building an evidence base just seems too difficult.</span></p>\n<p><span><span> </span>Now, the MIRI, and ACE, are organizations working within cause areas for which it&apos;s much more difficult to discern how effective and positive financial and other support in the present will be. However, I believe that the novel introduction of greater effectiveness to cause areas may change them such that evaluating their tractability will be more possible. At such a point, you as an individual, or the effective altruism community at large, may conclude organizations within your selected cause area are more or less effective than you once though. So, this could shift your donation priorities within a couple of years. Thus, I believe accounting for this level of uncertainty about the effectiveness of a given organization over time is another mark against making multi-year commitments.</span></p>\n<p><span><span> </span>As someone who isn&apos;t very confident in which cause area, let alone which charity, may be the most effective target for donations, I wouldn&apos;t be making a multi-year commitment for donation even if I currently had the funds to justify such a thing. If you&apos;re extremely confident a single organization is the best, or confident in a single organization within the best cause area, a multi-year commitment could still make sense. However, keep in mind you may be biased if you&apos;re (one of) the only supporters of effective altruism with such high confidence in this organization. <strong> </strong></span>\n</p><h1><span><strong>Conclusion</strong></span></h1>\n<p></p>\n<p><span><span>In conclusion, I believe from the perspective of effective altruism, making a multi-year commitment to organizations is usually not the best plan of action. However, I wrote this post as an example of going through different considerations, not an ultimate guide. I believe considerations will vary with each individual, who should use their own discretion, and seek input from their peers and mentors. If you&apos;re reading this, and have had a hand in managing a non-profit organization, or were a donor to one organization for multiple years on end, please come forward with your own perspective in the comments.</span></span></p></body></html>", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "RPJhCLWEizLYXzyGd", "title": "Donate to keep Charity Science running", "postedAt": "2015-01-26T17:54:23.274Z", "htmlBody": "<html><body><p>Charity Science is looking for $35,000 to fund our 2015 operations. We fundraise for GiveWell-recommended charities, and over 2014 we moved over $150,000 to them that wouldn&#x2019;t have been given otherwise: that&#x2019;s $9 for every $1 we spent. We can&#x2019;t do this work without your support, so please consider making a donation to us - however small, it will be appreciated. Donate now and you&#x2019;ll also be matched by Matt Wage.</p>\n<p>The donations pages below list other reasons to donate to us, which include that:</p>\n<ul>\n<li>Our costs are extremely low: the $35,000 (Canadian) pays for three to four full-time staff.</li>\n<li>We experiment with many different forms of fundraising and record detailed information on how these experiments go, so funding us lets the whole EA community learn about their prospects.</li>\n<li>We carefully track how much money each experiment raises, subtract money which would have been given anyway, and shut down experiments that don&#x2019;t work.</li>\n<li>Our fundraising still has many opportunities to continue to scale as we try new ideas we haven&#x2019;t tested yet.</li>\n</ul>\n<p>There&#x2019;s much more information, including our full budget and what we&#x2019;d do if we raised over $35,000, in the linked document, and we&#x2019;d be happy to answer any questions. Thank you in advance for your consideration.</p>\n<p><a href=\"http://bit.ly/15CmrSv\">Donate in American dollars</a>&#xA0;</p>\n<p><a href=\"http://bit.ly/1z2h7SU\">Donate in British pounds</a>&#xA0;</p>\n<p><a href=\"http://bit.ly/18kDmuS\">Donate in Canadian dollars</a></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "WT6CvHJLYozrMe9pF", "title": "Meetup : The most good you can do in 5 minutes", "postedAt": "2015-01-25T22:53:57.568Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1x\">The most good you can do in 5 minutes</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>05 February 2015 07:00:00PM (-0500)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>#ph11, 77 Davisville Ave, Toronto, ON</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Bring your laptop! There&apos;s a web app under development which farms out quick, high-value tasks. We&apos;re going to have a play with it and see how much good we can accomplish in a short length of time! Plus discuss what tasks can be added and how to improve the app.</p>\n\n<p>May also of interest to people not involved in EA - there are some &quot;personal development&quot; tasks mixed in there which should be of interest to any life hackers.</p>\n\n<p>As you may have guessed, I&apos;m playtesting it right now and one of the tasks was to schedule an effective altruism meetup!</p>\n\n<p>Near Davisville station. Buzzer 3781 (Alex Ausch)</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1x\">The most good you can do in 5 minutes</a></h2></body></html>", "user": {"username": "Giles"}}, {"_id": "FzbdRr3uGEnHkyypi", "title": "Initial research into corporate fundraising", "postedAt": "2015-01-25T21:37:25.430Z", "htmlBody": "<html><body><p><span>Charity Science is exploring all possible ways of fundraising for GiveWell-recommended charities that seem as though they might be promising. It&#x2019;s valuable to conduct at least a quick exploration of these to see if they merit further investigation. As part of our </span><span><a href=\"http://rationality.org/2014/01/13/an-impressive-failure/\">commitment to transparency</a></span><span>, we publish detailed notes on what we find so that the whole effective altruist community can learn from it.</span><span>&#xA0;I&#x2019;ve done some initial research into corporate fundraising, and here is a write-up of this.</span></p>\n<h2><span>Avenues pursued</span></h2>\n<p><span>I aimed to spend relatively little time on this unless it proved promising. I did only a couple of hours of initial research, followed by a few hours Skyping and corresponding with the most promising opportunity that I identified. So there is scope for more research, and this appears worth doing once we&#x2019;ve exhausting more promising avenues; we plan to do this if we receive sufficient funding to keep Charity Science running or to expand it.</span></p>\n<p><span>I searched for general writings on corporate fundraising, focusing on those which spoke to how promising it was overall. I used Google and particularly good websites on fundraising that we&#x2019;d previously identified; I did not look at books in this brief research. My colleagues Joey and Xio and I have Skyped with several fundraising professionals and asked them about corporate fundraising among other things. Joey and Xio put considerable effort into identifying the best fundraising experts - they received paid consultancy from the best they could find, and have read his book, which covers corporate sponsorship of events. This is not covered in these notes as we class it under events fundraising, which we plan to scale up this year after a successful experiment with it.</span></p>\n<p><span>I Skyped with Luchang Wang about a project that some members of </span><span><a href=\"http://effectivealtruismhub.com/groups/yale-effective-altruists\">Yale Effective Altruists</a></span><span>&#xA0;have done in which they spoke to people at specific companies, for instance those involved in corporate social responsibility at major US pharmacy CVS, which notably removed tobacco products from its stores. They initially hoped to influence where companies donated, but their conversations cast some doubt on the prospects for this. </span></p>\n<p><span>I conducted a very shallow search for websites offering help with corporate fundraising. I identified one which appeared worth pursuing: </span><span><a href=\"http://charity.org/\">Global Impact/charity.org</a></span><span>. I had an email exchange with them, then decided it was worth Skyping, and then had a further email exchange. I describe this below.</span></p>\n<p><span>There are a few avenues that I found that I plan to investigate further, though as a relatively low priority. I identified </span><span><a href=\"https://www.google.com/url?q=https://www.ashoka.org/about\">Ashoka</a></span><span>&#xA0;(a network of social entrepreneurs) as worth investigating further given that we have a contact there, and will describe what we find later. We also have someone who writes and edits books on corporate fundraising in our network, and I am waiting to talk to them.</span></p>\n<h2><span>General findings</span></h2>\n<p><span>I found consistent advice that the typical forms of corporate fundraising require the charity to have something worth offering to the company, such as an ability to reach a valuable audience through (for example) prominently sponsoring a charity event. This was echoed in what the Yale group heard in their conversations. I do not yet have solid evidence for it however.</span></p>\n<p><span>Some of what I read indirectly suggested that corporate fundraising was best suited charities serving people in the developed world (where many corporations major customer bases are). But in my call with Global Impact I asked them whether international development charities could expect success, and they said that they could. They gave the example of extractive corporations (such as Exxon Mobil) which focus on malaria, which affects their workforces.</span></p>\n<p><span>I talked to an EA who works as a management consultant and got GiveWell recommendations included in the list of charities donated to at his company. He suggested that it would be helpful to have glossy, persuasive materials on the charities from Charity Science, and we plan to create those. It seems possible that EAs working within companies could influence corporate or workforce giving, and we plan to gather more evidence on this, likely including encouraging people to try it out and helping them.</span></p>\n<h2><span>The most promising opportunity that we found</span></h2>\n<p><span>Global Impact provides paid services to both charities and companies interested in corporate social responsibility. For companies, these include (but are not limited to) running a workplace giving scheme and advising on choosing charities in a favoured area. For charities, these include (but are not limited to) offering participating in their workplace giving scheme, helping with corporate fundraising (including identifying promising corporations to approach), designing and implementing fundraising strategies (including foundation identification and research), and secretarial services.</span></p>\n<p><span>We identified several of these services as worth investigating. The most promising was the workplace giving scheme, as this moves a great deal of money and reaches an enormous number of employees at </span><span><a href=\"http://charity.org/public-sector\">major state and federal agencies</a></span><span>&#xA0;and </span><span><a href=\"http://charity.org/corporations\">corporations</a></span><span>&#xA0;(such as American Express, Amazon, Intel JP Morgan, McDonalds, Microsoft and Shell). It is worth looking at these lists to get a sense of its scale. As is normal, it was difficult to pin Global Impact down on how much we could expect to raise. However, after some discussion they said: &#x201C;Just to give you an estimate, charities in our federation that have gross revenues of between $3-5 million and are with us for both public and private sector campaigns, average approximately $20,000 in pledges per year.&#x201D; This was in response to my asking them to give an estimate for AMF, given that spends around &#xA3;2,000,000 ($3.1m) a year. They were very familiar with AMF, knowing the people involved.</span></p>\n<p><span>This appears promising, and it is possible that it could raise significant amounts of money for some of the world&#x2019;s most effective charities. However participation costs $2,500 a year (as well as a 5% commission on donations). We feel that we do not have sufficient evidence to justify this expenditure. Among other things, Charity Science is not in a financial position to take punts which have a good chance of not paying off, even if in expectation they will have a large positive impact.</span></p>\n<p><span>The other services that we identified as worth exploring were identification of promising corporate donors to approach, and designing and implementing a fundraising diversification strategy. The most promising element of the latter was foundation identification and research; however we identified and applied to promising corporate foundations during our unsuccessful early (six month) experiment with grant-writing, and this has lead to our seeing them as not particularly promising. We were quoted $10,000 to $15,000 for the first service and $5,000 to $25,000 for the second. We do not regard this as worth paying; I am more confident of this than I am for the workplace giving scheme opportunity.</span></p>\n<p><span>An important caveat to the above is that it is quite hard to judge how promising these opportunities are. We tend towards an unusually pessimistic view, and I am not at all confident that this is correct. I would welcome others&#x2019; comments and suggestions, as well as promising avenues to explore or contacts we could get in touch with.</span></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "TsbLgD4HHpT5vrFQC", "title": "Dorothea Brooke: an alternative origin story for Effective Altruism", "postedAt": "2015-01-25T20:26:44.825Z", "htmlBody": "<html><body><p><strong>Summary:</strong> A potential criticism or weakness of effective altruism is that it appeals only to a narrow spectrum of society, and exhibits a &#x2018;monoculture&#x2019; of ideas. I introduce Dorothea Brooke, a literary character who I argue was an advocate for the principles of effective altruism -- as early as 1871 -- in a Christian ethical tradition. Rather than being of mere historic interest, I hope this will inform ideas for a wider and more inclusive conception of the philosophy of effective altruism. This is a contribution to the January blogging carnival theme &#x2018;Origin Stories&#x2019;</p>\n<p>&#xA0;</p>\n<p><strong>Background: the key elements of effective altruism </strong></p>\n<p>Many prominent figures in the movement are utilitarian philosophers, and the key principles of the movement are often placed in a tradition of utilitarian thought. The first key principle of this movement -- to do great good in the world, regardless of our personal ties to those who benefit -- does follow from utilitarian ethics but it is not unique to utilitarianism. Many major religions declare it a duty to help others, particularly those most in need: tithing, or giving a proportion of one&apos;s income, is a Sikh principle as well as is a tradition in the Abrahamic religions. The writings of St Thomas Aquinas and St Basil of Caesarea argue the radical alleviation of poverty is a key duty in Christianity.</p>\n<p>The second key element of effective altruism -- using evidence and knowledge to inform our efforts -- is a newer concept. For effective altruists it is not enough simply to aim to do good: we acknowledge a duty to do as much good as our resources allow, and to support our choices with evidence. The history of &apos;Evidence Based Medicine&apos; is an interesting analogy here: for though physicians have clearly sought to improve health for millennia, it was only the latter part of the 20th century that the clear and conscientious application of evidence to clinical practice became widespread. The very idea now seems self-evident, so it is worth remembering that what is now standard practice has been contested -- sometimes bitterly -- over the last 50 years. The fear of doctors that &#x2018;cook-book medicine&#x2019; would undermine their ability to exercise clinical judgment, and &apos;result in reducing the autonomy of the doctor/patient relationship&apos;[1] resembles the argument of those who believe the wide application of metrics to philanthropy threatens the altruistic urge behind the act of giving, leaving the giver &apos;coolly looking across humanity as a detached god&apos;[2] [a]. Effective altruism argues that reason is a product of rather than a threat to our altruism: it arises from our recognition of breadth and depth of suffering that exists, and the great variability we observe between the actions we may take to relieve or prevent that suffering. The seriousness with which we treat that potential good our actions can create is what motivates us to seek good evidence for our decisions.</p>\n<p><strong>A new idea?</strong></p>\n<p>Many of us -- myself included -- would have said that this practice of conscientiously applying scientific rigour to altruistic acts is what makes the effective altruism movement new and different This is why I was so surprised to find an advocate, albeit fictional, of both key principles of effective altruism dating back over a century, but such a figure exists in Dorothea Brooke, of George Eliot&apos;s novel &apos;Middlemarch&apos;.</p>\n<p>Published in 1871, but set in 1830-2, Eliot&apos;s novel explores the life of a manufacturing town and surrounding countryside in the years leading up to the Great Reform Bill in Britain. At the heart of the novel is Dorothea. An orphan, recently returned from school to live with her uncle, she has some independent wealth and will inherit more if she has a son. Seeing that she has been narratively gifted with wealth, beauty and good parentage, to any reader of nineteenth century fiction it should be clear that Dorothea&apos;s plot arc will concern romance and end in matrimony. Confounding expectation and confusing her relations, Dorothea defies convention by devoting her time to improving the lot of others, in the most effective way she can.</p>\n<p><strong>Dorothea&#x2019;s evidence based altruism</strong></p>\n<p>Altruism is at the core of Dorothea&apos;s life, both her words and her deeds. &#x2018;What do we live for, if it is not to make life less difficult to each other?&#x2019; From our first introduction to her we see her actively pursuing opportunities to do so, with a sense of obligation and of moral urgency: &#x2018;I think we deserve to be beaten out of our beautiful houses with a scourge of small cords -- all of us who let tenants live in such sties as we see round us.&#x2019; Her altruism is not a luxury, or a hobby to fill her time. It is so central that it remains with and sustains her when her circumstances have become unhappy:</p>\n<p><em></em></p>\n<p><em>&#x2018;If we had lost our own chief good, other people&apos;s good would remain, and that is worth trying for. Some can be happy. I seemed <span> </span>to see that more clearly than ever, when I was the most wretched. I can hardly think how I could have borne the trouble, if that <span> </span>feeling had not come to me to make strength </em> &#x2019;</p>\n<p>Thus she explains the benefits of altruism to an individual: the good of others matters just as much as our own, and increasing the well-being of others gives us a consciousness of having improved total welfare, even if we do not share in it directly.</p>\n<p>Dorothea&apos;s sense of duty is rooted firmly in her Christianity. Religion is a very serious matter to Dorothea: her sense of the importance of her God and the preeminence of the spiritual such that she refuses to wear a necklace of her mother&apos;s, an heirloom, because she feels that to decorate a cross with jewels is to trivialise it. Her religion does not simply require ascetic self denial or self perfection, but rather looks outward:</p>\n<p><em></em></p>\n<p><em><span> </span>&#x2018;I have always been thinking of the different ways in which Christianity is taught, and whenever I find one way that makes it a <span> </span>wider blessing than any other, I cling to that as the truest -- I mean that which takes in the most good of all kinds, and brings in <span> </span>the most people as sharers in it.&#x2019; </em></p>\n<p>This expression resonates with Peter Singer&apos;s concept of &apos;The Expanding Circle&apos; of moral concern (an idea that he attributes to WH Lecky in the late nineteenth century).[3]</p>\n<p>What sets Dorothea apart is the zeal with which she pursues education and evidence with the explicit goal of informing her actions and maximising their impact. Dorothea seeks knowledge because she believes there is an answer about what it is best to do: &#x2018;I am often unable to decide. But that is from ignorance. The right conclusion is there all he same, though I am unable to see it. &#x2018; We find her at her desk pursuing what appears to be an early version of the Giving What We Can research team!</p>\n<p><em></em></p>\n<p><em><span> </span>&apos;She sat down in the library before her particular little heap of books on political economy and kindred matters, out of which she <span> </span>was trying to get light as to the best way of spending money so as not to injure one&apos;s neighbours, or--what comes to the same <span> </span>thing--so as to do them the most good.&apos; </em></p>\n<p>This sentence has an astounding resonance with the effective altruism project: the use of resources to help others is necessarily informed by politics and economy, and there is no demarcation in her impact between doing &apos;the most good&apos; and avoiding harm. Moreover she also considers the benefits of experimentation to increase knowledge in the sphere of philanthropy. She exhorts her uncle to support his tenants by experimentation with farming methods. He decries the cost of this &apos;hobby&apos; -- &#x2018;the most expensive sort of whistle you can buy&#x2019;, and she rebukes him -- &#x2018;It is not a sin to make yourself poor in performing experiments for the good of all.&#x2019;</p>\n<p><strong>An unsuccessful project</strong></p>\n<p>Simply having these goals does not ensure Dorothea achieves the kind of impact she hopes to have. She faces a number of challenges. Firstly her own uncertainty: &#x2018;I don&apos;t feel sure about doing good in any way now: everything seems like going on a mission to a people whose language I don&apos;t know.&#x2019; Secondly, her family find her ideas alien and even unseemly. Her uncle (and guardian) copes with his oddity of a niece by ignoring her suggestions for how he could improve the lives and homes of his tenants, while her sister admonishes her for her &apos;notions&apos;. This sister even considers encouraging her to channel her oddity into a more conventional course by marrying the local squire who would &apos;let her manage everything and carry out all her notions.&apos; (This might be considered an early version of earning to give for a nineteenth century gentlewoman!)</p>\n<p>She is frequently stymied by the power structures of the era. As a woman she is excluded from higher education despite her zeal for learning. She marries a scholar, thinking that by helping him she will be advancing the light of knowledge in the world and become more learned herself, but later discovers his studies are a failure, pursuing answers to questions long deemed irrelevant in his field. (He is unable to admit this, but instead attempts to extract a vow from her to pursue his fruitless enquiry after his death.) She is thwarted by her status, firstly an unmarried woman, and later a married one. Dorothea&apos;s altruistic plans for direct philanthropy depend upon having resources, but her ability to own and dispose of property is curtailed. She will only inherit her uncle&apos;s property if she has a son. When her husband dies, she finds his property willed to her but constrained by an injunction against remarriage. In the end Dorothea&apos;s impact is limited to a sort of political influence, when she marries a writer with political ambition: &#x2018;Dorothea could have liked nothing better, since wrongs existed, than that her husband should be in the thick of a struggle against them, and that she should give him wifely help.&#x2019;</p>\n<p><strong>Doomed or unlucky?</strong></p>\n<p>Her altruistic project has clearly failed her early ambition: our author declares it &apos;a pity that so substantive and rare a creature should have been absorbed into the life of another, and be only known in a certain circle as a wife and mother.&apos; As modern readers, we might dismiss the importance of authorial intent, but I think the framing of this narrative is key in whether we interpret Dorothea as a flawed character set forth to fail or as victim of circumstances. I would argue there is strong suggestion in the novel to the second of these.</p>\n<p>In the prologue and conclusion which frame this sweeping novel, Dorothea&apos;s story is contrasted with Saint Theresa, another woman whose &apos;passionate, ideal nature demanded an epic life&#x2026;the rapturous consciousness of life beyond self&apos;. While Theresa founded a religious order, Dorothea finds no &apos;epic life&apos; and is eulogised as a &apos;foundress of nothing&apos; whose efforts &apos;are dispersed among hindrances, instead of centring in some long-recognisable deed.&apos; In particular it is the lack of opportunity for a woman in the age to act that is presented as her chief &#x2018;hindrance&#x2019;: our impartial narrator states &#x2018;no one stated exactly what else that was in her power she ought rather to have done&#x2019;. But it is the obstacles, not her nature which are found to be at fault by this narrator, for her society has provided &apos;no coherent social faith and order which could perform the function of knowledge for the ardently willing soul.&apos;</p>\n<p><strong>Why is she important?</strong></p>\n<p>Dorothea is a remarkable proponent of effective altruism for many reasons.</p>\n<p>Firstly I am particularly pleased to be able to draw attention to her as the female creation of a female writer, who makes as strong an argument for our ideas as I&apos;ve seen in the nineteenth century. Women currently constitute much less than half of the numbers in effective altruism organisations and discussions, which may be surprising when women just as (or even more) likely as men to think giving is important and to donate to charity[5,6]. In discussing this skew, some people have argued that the relatively small number of women in EA arise from women being innately or culturally less likely to hold these views. Consider instead that women are less likely to be found in the places where the movement has had much of its momentum, in philosophy departments and rationalist internet communities. Rather than restricting efforts to these spheres, I would argue there is low hanging fruit to be found in seeking other communities who will engage enthusiastically with our endeavours.</p>\n<p>This doesn&apos;t just mean engaging women, but engaging a plurality of moral theories. It would be a great mistake to believe that effective altruism belongs only or mostly to utilitarianism. I&apos;ve tried to make a case here for why EA may arise naturally out of Christian morality, a phenomenon that has been observed elsewhere [6,7]. While many influential people within effective altruism stress that it needn&#x2019;t rest on utilitarian foundations, this is still a very common misconception and more could be done to show how it can have a much wider appeal, including encouraging more voices that come to effective altruism from these other foundations</p>\n<p>Finally, through Dorothea&apos;s story Eliot is able to explore a number of barriers to the success of these ideas: a lack of education or evidence to put them into action; a lack of shared community to explore ideas; the opposition of friends and family. We can learn from the failure of Dorothea&apos;s projects, and fortify ourselves against these pitfalls, to avoid her &apos;tragic failure, which found no sacred poet and sank unwept into oblivion.&apos;</p>\n<p><em>Thanks to Larissa MacFarquhar, Toby Ord and Michelle Hutchinson for comments on an earlier draft</em></p>\n<p><strong>References and footnotes:</strong></p>\n<p>[Unless otherwise specified, quotations are from George Eliot <em>Middlemarch</em> 1871-2]</p>\n<p>[1] Aaron Michael Cohen, P. Zo&#xEB; Stavri, William R. Hersh A categorization and analysis of the criticisms of Evidence-Based Medicine International Journal of Medical Informatics (2004) 73, 35&#x2014;43</p>\n<p>[2] William Schambra The coming showdown between philanthrolocalism and effective altruism, Philanthropy Daily 22/5/2014 retrieved from http://www.philanthropydaily.com/the-coming-showdown-between-philanthrolocalism-and-effective-altruism/</p>\n<p>[a] I&apos;m not aware of this analogy having been made before, but I think it&apos;s a fruitful one. The critics of Evidence Based Medicine could provide us with some of the &apos;outside criticism&apos; Ryan Carey has written about recently.</p>\n<p>[3] Peter Singer &#x2018;The Drowning Child and the Expanding Circle&#x2019; New Internationalist, April, 1997</p>\n<p>[4] &apos;What are the main trends in charitable giving?&apos; UK Civil Society Almanac 2012 Retrieved from http://data.ncvo.org.uk/a/almanac12/what-are-the-main-trends-in-charitable-giving/</p>\n<p>[5]&apos;Women Give 2012&apos; Women&apos;s Philanthopy Institute, Indiana University, August 2012</p>\n<p>[6] Charles Camosy <em>Peter Singer and Christian Ethics: Beyond Polarization</em>, (Cambridge: CUP), 2012</p>\n<p>[7] Toby Ord Global poverty and the demands of morality. In J Perry (ed.) <em>God, The Good, and Utilitarianism: Perspectives on Peter Singer</em>, (Cambridge: CUP), 177&#x2013;91, 2014.</p></body></html>", "user": {"username": "Bernadette_Young"}}, {"_id": "aRAK6ct8AvXg3gicA", "title": "Why I Give", "postedAt": "2015-01-25T13:51:48.885Z", "htmlBody": "<html><body><p><span>This is my contribution for this month&#x2019;s blogging carnival &#x2013; &#x2018;origin stories&#x2019;. Thanks Peter for suggesting that theme, which is a lovely way to get to know each other, and Michael for instituting the blogging themes.</span></p>\n<p><span>My origin story is very much centred around people. I first started taking effective giving really seriously because of the people I met who were doing so and I&#x2019;ve stayed involved in the community because of the people. I&#x2019;m so grateful to the kind, interesting people I&#x2019;ve met (whether in person or online!) who are all working so hard to help others. They&#x2019;ve inspired me to live up to my values, made me realise that I really can make a difference, and supported me to do so. Thanks guys!</span></p>\n<p><span>I&#x2019;ve been vaguely involved in charity since school &#x2013; organising penny races, hassling the other kids to bake cakes for bake sales, volunteering at Oxfam. But I didn&#x2019;t feel particularly motivated, because it was all a little ad hoc. We didn&#x2019;t really know what causes to support, and mostly we were setting up things events we enjoyed (like selling goes with a toy gun trying to shoot down tin cans in a classroom!). I actually studied Peter Singer&#x2019;s arguments in Philosophy class, and found it really compelling that when I had an income I ought to donate a significant proportion of it, given how much more benefit others could get from it. But no-one else seemed to believe that, or act on it, so I just figured I wouldn&#x2019;t end up caring either.</span></p>\n<p><span>At Oxford, similar factors still let me rationalise inaction. In particular, I didn&#x2019;t really know where to donate &#x2013; there are so many charities, and I didn&#x2019;t feel I had any way to justify giving to one rather than another. I think the first time that really changed was during my Masters, when I chatted to other people in my year, particularly Will MacAskill, about where to donate. He suggested that the best way to choose among charities was to try to find out which charities helped others the most with a certain donation, and donate there. I remember wondering at the time why I had never Googled &#x2018;which charity is the most effective&#x2019;. I was pretty interested not just in which charities were the most cost-effective, but also how to find that out, so spent a lot of time chatting to Will and Toby Ord. It turned out they were planning to set up an organisation called Giving What We Can. GWWC ended up launching during our exams. I thought it was an amazing project, but what actually ended up dragging me out of my exam work was wanting to support the dedication of my classmate who was able to do all of this during his exams (still so impressed Will pulled that off and still got a 1<sup>st</sup>!).</span></p>\n<p><span>It seems funny to look back at the amazement and wonder I felt at finding people who cared enough to be donating so much of their income. I wasn&#x2019;t convinced I&#x2019;d ever actually end up donating 10% of my income, let alone any more than that. But the people I met seemed so inspiring and knowledgeable I thought getting involved would definitely be my best shot at living up to my ideals. So I did! I volunteered doing research, then managing volunteers, then running the Operations team. At some point, it started feeling surprisingly standard to donate at least 10% of one&#x2019;s income to the most effective charities, so taking the <a href=\"https://www.givingwhatwecan.org/get-involved/become-member\">Pledge to Give</a>&#xA0;ended up not being as scary as I thought.</span></p>\n<p><span>By the summer of 2011, Giving What We Can was growing steadily and Will and Ben Todd had set up 80,000 Hours. We started to realise that if we wanted them to grow faster, we would need to professionalise. We decided to register them as one organisation for flexibility and efficiency, and after what felt like a very long naming process - which ended up being very much worth it -&#xA0;the Centre for Effective Altruism was born. I got to be the one working out how you register with Company&#x2019;s House, how you become a charity, and how you employ staff. All of which, surprisingly, turned out to be fascinating.</span></p>\n<p><span><span>In the summer of 2012 CEA first took paid staff and I took over from Will as the Executive Director of Giving What We Can. I feel really fortunate that I now get to be the one introducing people to others who can inspire them to live up to their values, and help people find the information they need to work out where to donate. I love that I get to live my life alongside people who continue to inspire me daily with how much they care about others and how hard they work to help them. I&#x2019;d very much like to give as many other people that opportunity as I can! So if you&#x2019;re at all interested in effective giving, please don&#x2019;t hesitate to get in touch with&#xA0;<a href=\"mailto:michelle.hutchinson@givingwhatwecan.org\">me</a>&#xA0;or anyone else on the&#xA0;<a href=\"https://www.givingwhatwecan.org/about-us/people\">Giving What We Can team</a></span><span>.</span>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;</span></p></body></html>", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "MLuKNAsYjh3JE6Xw8", "title": "Comments on Ernest Davis's comments on Bostrom's Superintelligence", "postedAt": "2015-01-24T04:40:52.595Z", "htmlBody": "<html><body><p>Link: <a href=\"http://www.cs.nyu.edu/faculty/davise/papers/Bostrom.pdf\">Ethical Guidelines for a Superintelligence</a> by Ernest Davis, NYU. October 2014.</p>\n<p>Thanks to <a href=\"/ea/e0/january_open_thread/2dr\">davidc</a> for pointing this one out. Nick Bostrom represents one side of EA - xrisk with a focus on artificial intelligence - that deserves more intelligent criticism. So it&apos;s certainly refreshing to see these comments by Davis.</p>\n<p>I&apos;ll add my thoughts here (I figured they&apos;d be long enough for a top-level post). Note: I have very little connection with FHI or MIRI - I certainly don&apos;t represent them in any way. This will make a lot more sense if you&apos;ve read at least part way through the book, or are otherwise familiar with Bostrom&apos;s position on machine intelligence. Otherwise, <a href=\"http://astore.amazon.co.uk/ea-astore-embed-21/detail/B00LOOCGB2\">read the book :D</a></p>\n<p><strong>Summary</strong>:</p>\n<ul>\n<li>Davis doesn&apos;t significantly misrepresent Bostrom&apos;s point of view as far as I can tell</li>\n<li>Davis correctly points out that Bostrom doesn&apos;t go into multi-dimensional models of intelligence (and intelligence explosions) enough</li>\n<li>Davis points out that Bostrom may have a bit too much of an affection for transhumanist morality and the anthropic principle</li>\n<li>Extrapolating the moral taboos of some well-respected people isn&apos;t a <em>terrible</em> way to construct an AI morality, and I hope it gets added in to the conversation, but it&apos;s not enough to render the rest of the conversation moot</li>\n<li>I think Davis needs to work on steelmanning some of his other arguments</li>\n</ul>\n<p><a></a>Davis&apos;s review starts with an overview of the key message in Bostrom&apos;s book:</p>\n<blockquote>\n<p>Nick Bostrom, in his new book <em>SuperIntelligence</em>, argues that, sooner or later, one way or another, it is very likely that an artificial intelligence (AI) will achieve intelligence comparable to a human. Soon after this has happened &#x2014; probably within a few years, quite possibly within hours or minutes &#x2014; the AI will attain a level of intelligence immensely greater than human. There is then a serious danger that the AI will achieve total dominance of earthly society, and bring about nightmarish, apocalyptic changes in human life. Bostrom describes various horrible scenarios and the paths that would lead to them in grisly detail. He expects that the AI might well then turn to large scale interstellar travel and colonize the galaxy and beyond. He argues, therefore, that ensuring that this does not happen must be a top priority for mankind.</p>\n</blockquote>\n<p>This seems like a good summary of Bostrom&apos;s viewpoint. I&apos;d only disagree with the word &quot;grisly&quot; - I find Bostrom&apos;s tone to be pretty gentle. And maybe he&apos;s overstating the probabilities a touch.</p>\n<p>Davis likes the &quot;Paths&quot; section of the book, which explains how a superintelligence could come about. But he has some reservations about the &quot;Dangers&quot; and &quot;Strategies&quot;. I&apos;ll go through his complaints here and add my own thoughts.</p>\n<h2>The assumption that intelligence is a potentially infinite quantity with a well-defined, one-dimensional value</h2>\n<p>It&apos;s pretty clear that Bostrom doesn&apos;t actually believe this. The point Davis is trying to make is more sophisticated than this - and I&apos;ll get to that next - but first I just want to make clear that Bostrom doesn&apos;t think intelligence is something like mass or height with a &quot;well-defined, one-dimensional value&quot;. Here&apos;s Bostrom:</p>\n<blockquote>\n<p>It would be convenient if we could quantify the cognitive caliber of an arbitrary cognitive system using some familiar metric, such as IQ scores or some version of the Elo ratings that measure the relative abilities of players in two-player games such as chess. But these metrics are not useful in the context of superhuman artificial general intelligence. <strong>[snip]</strong> suppose we could somehow establish that a certain future AI will have an IQ of 6,455: then what? We would have no idea of what such an AI could actually do. We would not even know that such an AI had as much general intelligence as a normal human adult - perhaps the AI would instead have a bundle of special-purpose algorithms enabling it to solve typical intelligence test questions with superhuman efficiency but not much else.</p>\n<p>Some recent efforts have been made to develop measurements of cognitive capacity that could be applied to a wider range of information-processing systems, including artificial intelligences. Work in this direction, if it can overcome various technical difficulties, may turn out to be quite useful for some scientific purposes including AI development. For purposes of the present investigation, however, its usefulness would be limited since we would remain unenlightened about what a given superhuman performance score entails for actual ability to achieve practically important outcomes in the world.</p>\n</blockquote>\n<p>Bostrom argues for various different flavours of AI:</p>\n<ul>\n<li>Different outputs (or &quot;superpowers&quot;) that an AI might command: strategizing, social manipulation, hacking etc.</li>\n<li>Different structures (or &quot;forms&quot;) of superintelligence: speed superintelligence, collective superintelligence, and quality superintelligence.</li>\n</ul>\n<p>However, might Bostrom be paying lip-service to non-one-dimensionalness while still relying on it for his central models and arguments? Davis claims:</p>\n<blockquote>\n<p>if you loosen the idealization, important parts of the argument become significantly weaker, such as Bostrom&#x2019;s expectation that the progress from human intelligence to superhuman intelligence will occur quickly</p>\n</blockquote>\n<p>Let&apos;s have a look at chapter 4: the kinetics of an intelligence explosion. Bostrom&apos;s equation is:</p>\n<blockquote>\n<p>Rate of change in intelligence = Optimization power / Recalcitrance</p>\n</blockquote>\n<p>It&apos;s important to note that optimization power isn&apos;t the same as intelligence. In this equation you can think of optimization power as something more like money - it&apos;s something you can throw at a problem and maybe make some progress, as long as the recalcitrance isn&apos;t too high. It&apos;s a one-dimensional quantity.</p>\n<p>Intelligence is a vector.</p>\n<p>Recalcitrance, however, could be a vector too. Depending on how the project is going, and what the theoretical hurdles turn out to be, different aspects of intelligence might advance at different rates. The equation is still valid, if you interpret it as a vector equation (and you take some liberties in notation by dividing by a vector).</p>\n<p>I&apos;m not sure this is what Bostrom intended though, and he certainly didn&apos;t say it. I think that chapter 4 would have been stronger if it had considered non-one dimensional models.</p>\n<p>But we can still take the spirit chapter 4. Suppose intelligence is a multi-faceted thing, with the different factors having different recalcitrances and feeding into optimization power differently. I think you&apos;d still expect a fast takeoff, unless there was some kind of bottleneck: all the factors of intelligence relevant to optimization power hit a roadblock (or each hit a separate roadblock).</p>\n<p>I think there&apos;s a fruitful discussion to be had here in any case. Bring out the multi-dimensional models!</p>\n<blockquote>\n<p>However, all that running faster does is to save you time. If you have two machines A and B and B runs ten times as fast as A, then A can do anything that B can do if you&#x2019;re willing to wait ten times as long.</p>\n</blockquote>\n<blockquote></blockquote>\n<p>Imagine you own a company, and you came into possession of a potion that would make employees do the same work ten times faster. What do you think would happen? Because I think that company would take over the world, <em>unless</em> the potion got leaked or sold to a rival company - this is essentially the difference between Eliezer Yudkowsky&apos;s and Robin Hanson&apos;s view of machine intelligence dynamics, at least as I understand it. (An intelligence explosion vs. lots of fast competing agents).</p>\n<h2>The assumption that a large gain in intelligence would necessarily entail a correspondingly large increase in power</h2>\n<p>Davis here appears to confuse intelligence with brain size, and is also still assuming that Bostrom is imagining a one-dimensional, clear-cut definition of intelligence.</p>\n<p>It&apos;s really hard to argue that a large gain in intelligence would entail <em>anything</em>, because everyone disagrees on what that word means. But there&apos;s an interesting discussion to be had here if we dissolve the concept of intelligence.</p>\n<p>Intelligence can be broken down into resources and abilities. Resources include:</p>\n<ul>\n<li>Hardware\n<ul>\n<li>Speed at which that hardware runs</li>\n</ul>\n<ul>\n<li>Whether the hardware allows its software to be copied (no for brains, yes for ems)</li>\n</ul>\n</li>\n<li>Money</li>\n<li>Physical manipulators</li>\n<li>Knowledge</li>\n<li>Algorithms</li>\n</ul>\n<p>Abilities include (roughly borrowed from Bostrom&apos;s &quot;superpowers&quot; list, though they may not necessarily be exhibited at the &quot;super&quot; level):</p>\n<ul>\n<li>Strategizing</li>\n<li>Social manipulation</li>\n<li>Hacking</li>\n<li>Technology research, including software</li>\n<li>Economic productivity</li>\n</ul>\n<p>The discussion would be:</p>\n<ul>\n<li>Which important resources and abilities are missing from those lists?&#xA0;</li>\n<li>Which resources imply which abilities?</li>\n<li>Which abilities allow further gains in which resources, in the sort of future world we&apos;d expect to find the system in</li>\n<li>Which combination of abilities would suggest a lot of &quot;power&quot;</li>\n</ul>\n<p>I think that thinking about these would yield some statements of the form &quot;a large gain in [something] would lead to a large gain in [other thing]&quot;, some of which would be nontrivial. This basically brings us back to multidimensional models being cool.</p>\n<h2>The assumption that large intelligence entails virtual omnipotence</h2>\n<p>As Bostrom and Davis both point out, this one swings both ways - it can lead to existential doom or &quot;messianic benefits&quot; (Davis&apos;s words) depending on whether the intelligence has friendly or unfriendly (or bizarre) motivations.</p>\n<p>Davis doesn&apos;t explain why Bostrom is wrong on this point. But using the model I hinted at above, we might imagine some upper limit on the resources and abilities that can be acquired by a system - witness the fact that no system (such as a government or corporation) has managed to take over the entire world yet. Bostrom argues:</p>\n<blockquote>\n<p>In human-run organizations, economies of scale are counteracted by bureaucratic inefficiencies and agency problems, including difficulties in keeping trade secrets. [snip] An AI system, however, might avoid some of these scale diseconomies, since the AI&apos;s modules (in contrast to human workers) need not have individual preferences that diverge from those of the system as a whole.</p>\n</blockquote>\n<p>There&apos;s also a reference to the economic literature dealing with the theory of the firm.</p>\n<h2>The unwarranted belief that, though achieving intelligence is more or less easy, giving a computer an ethical point of view is really hard</h2>\n<p>Making a system behave ethically is trivially easy. &quot;Hello world&quot; does that. Your pocket calculator, and existing narrow AI systems, do that while still exhibiting interesting behaviour. Bear this in mind.</p>\n<blockquote>\n<p>But if an AI is to be a master manipulator, it will need a good understanding of what people consider moral; if it comes across as completely amoral, it will be at a very great disadvantage in manipulating people</p>\n</blockquote>\n<p>I can see the following problem. An AI is programmed not to do anything it considers immoral. It formulates the plan to construct another AI with slightly weaker morality safeguards. Would people consider this immoral? If they&apos;re consequentialist then probably yes. If they&apos;re not, and most people aren&apos;t, then probably no, although depending how much they know about AI they might consider it &quot;foolish&quot; <em>which is a different thing from immoral</em>.</p>\n<p>But we&apos;re attacking a strawman here, as Davis proposes something more interesting:</p>\n<blockquote>\n<p>You specify a collection of admirable people, now dead. [snip] You then instruct the AI, &#x201C;Don&#x2019;t do anything that these people would have mostly seriously disapproved of.&#x201D;</p>\n</blockquote>\n<p>Note that being dead is irrelevant here. You can equally well specify &quot;what a living person as of 2015 would have seriously disapproved of&quot;.</p>\n<p>I&apos;m guessing the spirit of this moral code is:</p>\n<ul>\n<li>to forbid taking over and establishing a singleton</li>\n<li>to allow passive behaviour, such as allowing a rival AI project to take over and establish a singleton</li>\n</ul>\n<p>If I&apos;m right, this runs into the problem of &quot;if your AI doesn&apos;t take over the world then someone else&apos;s soon will&quot;.</p>\n<p>This aside, we can consider how the AI might behave. Following Bostrom&apos;s classification:</p>\n<ul>\n<li>Oracles give their operators a lot of power. But if the oracle is programmed not to do anything the wise people would disapprove of then it would stop answering questions once it realises it would give its operators too much power. Clever, huh?</li>\n<li>Genies similarly</li>\n<li>Sovereigns are ruled out if the wise people are forbidding establishing a singleton</li>\n<li>Tools probably aren&apos;t agenty enough to follow the proscription accurately</li>\n</ul>\n<p>So it sounds pretty good. It&apos;s basically &quot;take the coherent extrapolated volition of some dead people&quot;, and it potentially suffers the problem of being too weedy. I think it suffers from the similar philosophical and implementation problems to anything CEV-like though - who knows what the wise dead people would have thought about low-fidelity ems, or nanobots distributing morphine to prevent wild animal suffering, or any of the other puzzles that may confront future society. You need to extrapolate and you need to aggregate opinions. And you need to choose the right people to start with.</p>\n<p>This reminds me a little of Holden Karnofsky&apos;s Tool AI. It&apos;s relatively easy to come to the conclusion that MIRI and FHI haven&apos;t done their homework, by proposing a candidate solution that they haven&apos;t explicitly mentioned yet. If they are to take their critics seriously, and I think they should, then such proposals will enter the conversation, and maybe even future editions of this book or its successors.</p>\n<p>But it doesn&apos;t mean the problem has gone away. It may be that extrapolating the volition of dead people is a really hard task for AI, and that other things such as initiating an economic takeover, are actually more straightforward. In that case we&apos;d have the technology for a doomsday device before we had the suggested safeguard. And even if this isn&apos;t the case, while we&apos;re carefully building in all our safeguards, some foreign power will be hacking together any old rubbish, and as consequentialists we&apos;re responsible for the consequences of that.</p>\n<blockquote>\n<p>This may not seem adequate to Bostrom, because he is not content with human morality in its current state; he thinks it is important for the AI to use its superintelligence to find a more ultimate morality. That seems to me both unnecessary and very dangerous.</p>\n</blockquote>\n<p>Yeah, Bostrom can be a bit iffy when it comes to transhumanist topics. Moving on.</p>\n<blockquote>\n<p>Bostrom considers at length solving the problem of the out-of-control computer by suggesting to the computer that it might actually be living in a simulated universe, and if so, the true powers that be might punish it for making too much mischief</p>\n</blockquote>\n<p>Yeah, on the anthropic principle too. On the other hand, everyone else is iffy when it comes to the anthropic principle too, and I think Bostrom was just trying to be thorough here.</p>\n<blockquote>\n<p>Any machine should have an accessible &#x201C;off&#x201D; switch; and in the case of a computer or robot that might have any tendency toward self-preservation, it should have an off switch that it cannot block. However, in the case of computers and robots, this is very easily done, since we are building them. All you need is to place in the internals of the robot, inaccessible to it, a device that, when it receives a specified signal, cuts off the power or, if you want something more dramatic, triggers a small grenade. This can be done in a way that the computer probably cannot find out the details<br>of how the grenade is placed or triggered, and certainly cannot prevent it.</p>\n</blockquote>\n<p>Goodness, Bostrom didn&apos;t consider the possibility that you could build a machine with an &quot;off&quot; switch?</p>\n<p>All the AI needs to do is:</p>\n<ul>\n<li>Play nice until it&apos;s figured out a way to kill everyone before they can get their hand to the off switch, <em>or</em></li>\n<li>Play nice until it&apos;s so entwined with the rest of the world&apos;s infrastructure that switching it off would be unthinkable, <em>or</em></li>\n<li>Play nice until its superintelligence has figured out where the off switch is, <em>or</em></li>\n<li>Accomplish its goal (e.g. building a million paperclips), then kill everyone to make sure the paperclips remain forever. The off switch gets triggered on somebody&apos;s death but the AI doesn&apos;t care, <em>or</em></li>\n<li>Play nice until it&apos;s built another AI somewhere which has the same goals but doesn&apos;t have an off switch, <em>or</em></li>\n<li>Play nice until it&apos;s wireheaded everyone so they don&apos;t care</li>\n</ul>\n<p>You get the idea. Manual off switches don&apos;t work when you&apos;re dealing with a master manipulator. Bostrom does discuss a number of safeguards (in particular &quot;tripwires&quot;) that are a bit like off switches but smarter, but he discusses potential flaws in these too.</p>\n<blockquote>\n<p>Something can always go wrong, or some foolish or malicious person might create a superintelligence with no moral sense and with control of its own off switch. I certainly have no objection to imposing restrictions...</p>\n</blockquote>\n<p>That&apos;s great! Davis is saying &quot;if your AI doesn&apos;t take over the world or at least do something really bad, then someone else&apos;s soon will unless there are restrictions&quot;. This is pretty close to one of my own memes, and the differences are important, but I&apos;m glad we could find some common ground.</p>\n<p>Thanks for reading!</p></body></html>", "user": {"username": "Giles"}}, {"_id": "HTwg2DMWCz3xRzNYS", "title": "The map of EAs and local groups", "postedAt": "2015-01-22T15:43:57.345Z", "htmlBody": "<html><body><p><a href=\"http://effectivealtruismhub.com/map\"><img src=\"http://tog.philosofiles.com/uploads/linked-elsewhere/ea/map-central-area-screenshot.png\" alt=\"\"></a><span>A bunch of people have linked to the </span><span>map of EAs</span><span>&#xA0;and it&#x2019;s become fairly widely known, but it occurs to me that I never properly introduced it. So, </span><span><a href=\"http://effectivealtruismhub.com/map\">here it is!</a></span><span>&#xA0;</span><span><a href=\"http://effectivealtruismhub.com/map/add\">You should join it!</a></span></p>\n<h2><span>What it is</span></h2>\n<p><span>It&#x2019;s a map. It features effective altruists around the world, and also local EA meetup groups. When you click on people you see their </span><span><a href=\"http://effectivealtruismhub.com/user/profiles\">EA Profiles</a></span><span>, which tell you more about them including their donation plans from the </span><span><a href=\"http://effectivealtruismhub.com/donations\">EA Donation Registry</a></span><span>. Everyone has a contact form, so you can get in touch with people nearby. Ryan&#x2019;s suggested using it to meet local EAs, and some people say they&#x2019;re happy to host visitors. There&#x2019;s also a </span><span><a href=\"http://effectivealtruismhub.com/map/people/all\">searchable list</a></span><span>&#xA0;of people on the map. When you click on a local group you see a </span><span><a href=\"http://effectivealtruismhub.com/groups\">profile for it</a></span><span>, including where to find its next meeting and who to contact about it.</span></p>\n<h2><span>Why it&#x2019;s a great idea to meet EAs where you live - and where you travel</span></h2>\n<p><span>There are so many reasons why! It&#x2019;s a lot of fun and you can form long-lasting social bonds - indeed, many people have found that fellow effective altruists are very much on their wavelength. It also strengthens the community and makes people feel more involved and more connected. And it&#x2019;s plausible that the more EAs someone knows, the more likely they are to continue to identify as an EA and &#x2018;stay on the wagon&#x2019;. Some evidence from this comes from the fact that having several friends in the movement seems to have induced many people to sign up; we might worry that they will drop out as this peer group drops away. It&#x2019;s been gratifying to hear from several people who&#x2019;ve used the map to find others near them, or local groups, or accommodation.</span></p>\n<h2><span>Why you should join it now</span></h2>\n<p><span>In addition to the reasons above, adding yourself to the map is an extremely easy way to show the size and spread of the movement, providing valuable social proof. And you can strengthen this yet further by adding information on your past or planned donations via the </span><span><a href=\"http://effectivealtruismhub.com/donations\">EA Donation Registry</a></span><span>. To sign up, </span><span><a href=\"http://effectivealtruismhub.com/map/add\">just give your city and country in this quick form</a></span><span>. Why not?</span></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "cinrg2DXXKcn8bybM", "title": "Telofy’s Introduction to Effective Altruism", "postedAt": "2015-01-21T16:46:18.527Z", "htmlBody": "<html><body><p><em>This is an introduction that I first published <a href=\"http://claviger.net/introduction-effective-altruism.html\">on my own blog</a> but was asked to publish here as well for archival purposes. Many thanks to everyone who has contributed to it!<br></em></p>\n<h2>Overview</h2>\n<p>Effective altruism is about doing the <em>most</em> good in the world. This includes figuring out what exactly that means, how it can be achieved, and implementing these&#xA0;insights.</p>\n<p>Central to the movement are the following&#xA0;ideas:</p>\n<ol>\n<li>Top charities are thousands of times more cost-effective than others<sup><a href=\"#fn:dcp2\">1</a></sup><sup><a href=\"#fn:to-imp\">2</a></sup> and make it easy to have a huge positive&#xA0;impact.</li>\n<li>Hence, it is typically more important <em>where</em> you give than <em>what</em> you give, and empirical, scientific research needs to guide these giving decisions, not personal bias or geographic&#xA0;proximity.</li>\n<li>Failing to give or failing to give effectively incurs tremendous avoidable&#xA0;suffering.</li>\n</ol>\n<p>The following sections will explain these points in more detail, and the final one will give an overview of the&#xA0;movement.</p>\n<h2>Altruism</h2>\n<p>Few people would be content to note on their deathbed that they have wasted their life on egoistic pursuits, so that after their death the world will be as if they had never&#xA0;lived.</p>\n<p>Enter consequentialist philosophers. Many people find it intuitive that we&#x2014;the average readers of this article who live in <a href=\"https://www.givingwhatwecan.org/get-involved/how-rich-am-i\">relative affluence</a>&#x2014;have a moral obligation to help, but for those that still have reservations, Peter Singer, Toby Ord, Thomas Pogge, Peter Unger, Shelly Kagan, and others have analogies similar to the following classic by Peter Singer<sup><a href=\"#fn:pond\">3</a></sup>:</p>\n<blockquote>\n<p>Imagine that you&#x2019;re walking across a park past a shallow ornamental pond and you notice that a small child has fallen in, and seems to be in danger of drowning. &#x2026; Of course, you think &#x201C;I must rush in and save the child.&#x201D; Then you remember that you&#x2019;re wearing your favorite, quite expensive, pair of shoes and they&#x2019;ll get ruined if you rush into the&#xA0;pond.</p>\n<p>Is that a reason for not saving the child? I&#x2019;m sure you&#x2019;ll say no it isn&#x2019;t, you just can&#x2019;t compare the life of a child to the cost of a pair of shoes, no matter how expensive.&#xA0;&#x2026;</p>\n<p>But think about how that relates to your situation in the world today. There are children whose lives you can save. &#x2026; Nearly 10 million children die every year from avoidable, poverty related causes. That&#x2019;s almost 27,000 every day. And it wouldn&#x2019;t take a lot to save the lives of these children. We can do&#xA0;it.</p>\n</blockquote>\n<p>The estimated cost<sup><a href=\"#fn:gw-ce\">4</a></sup> of saving a child&#x2019;s life is likely greater than even rather expensive shoes, but compared to the the value of a child&#x2019;s life&#x2014;an often fulfilling, happy life seventy-odd years&#x2014;the difference is&#xA0;negligible.</p>\n<p>However, effective altruism is not about rushing in and putting all our resources into saving one child&#x2019;s life. With ten thousands of people dying of preventable or treatable diseases every day,<sup><a href=\"#fn:unicef\">5</a></sup> we need to pay the utmost attention to maximize the impact of our donations. Effective altruism is not about doing <em>some</em> good, it is about doing <em>the most</em> good with the limited resources that we&#xA0;have.</p>\n<h2>Cost-Effectiveness</h2>\n<p>One&#x2019;s choice whether or not to donate is a matter of life or death for another person. But so is the decision as to where to donate. When we choose one charity over another, both of which run life-saving programs, we consign some people to death so others can&#xA0;live.</p>\n<p>Even just comparing medical interventions, some are 1,000 times more effective in the suffering they can avert per dollar donated.<sup><a href=\"#fn:dcp2\">1</a></sup> A large donation to an ineffective charity that uses it to save one life would then mean that 999 more people die unnecessary deaths. Few of us have a choice between donating $100 and $100,000, but we all have the option to donate to the most effective charities rather than waste almost our whole&#xA0;donation.</p>\n<h2>Cause&#xA0;Neutrality</h2>\n<p>These considerations apply to nonhuman animals as much as to humans. There is no agreed-upon method for comparing the suffering of different species, but Animal Charity Evaluators estimates that the cost for saving the lives of farmed animals<sup><a href=\"#fn:ace-topcharities\">6</a></sup> might be four orders of magnitude less than that for saving human lives,<sup><a href=\"#fn:gw-ce\">4</a></sup> a consideration that might outweigh whatever lower value one might assign to the life of an animal. On the other hand, animals are much less likely to benefit from long-term flow-through effects.<sup><a href=\"#fn:ocb-animals\">7</a></sup></p>\n<p>Similarly, effective altruists are investigating whether there are highly effective giving opportunities in areas that are usually deemed political. For example, opportunities within the <span>US</span> policy areas of labor mobility and criminal justice are being investigated by the <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy Project</a>. It also investigates types of global catastrophic risk (also known as <em>existential risk</em>)&#x2014;such as biosecurity and geoengineering&#x2014;and what can be done to avert them. Investigations into giving opportunities in the area of scientific research funding are also on the&#xA0;agenda.</p>\n<h2>Charity&#xA0;Prioritization</h2>\n<p>Some charities address life-threatening issues; others address less severe problems but do so at lower costs; still others combine both advantages, but are already well funded. Most charities, however, improve lives in less significant ways and at high costs, for example due to using ineffective or poorly researched interventions. With all these factors to bear in mind, and additional complications such as differences in the quality of the evidence, it is a challenging task to prioritize&#xA0;charities.</p>\n<p>Two organizations have put years of work into doing just that. <a href=\"http://givewell.org/\">GiveWell</a> and <a href=\"http://animalcharityevaluators.org/\">Animal Charity Evaluators</a> have been determining empirically which charities excel in all these categories. These charities are thus the best giving opportunities for donors. The reliability of their evidence is paramount to them, and they go to great lengths to subject their reasoning to public scrutiny, so that they can continually&#xA0;improve.</p>\n<h3>As of December 2014, <a href=\"http://www.givewell.org/charities/top-charities\">GiveWell</a>&#xA0;recommends:</h3>\n<ol>\n<li>The <a href=\"http://againstmalaria.com/\">Against Malaria Foundation</a>, which funds mosquito nets for malaria&#xA0;prevention</li>\n<li><a href=\"http://givedirectly.org/\">GiveDirectly</a>, which distributes cash to people in extreme&#xA0;poverty</li>\n<li>The <a href=\"http://www3.imperial.ac.uk/schisto\">Schistosomiasis Control Initiative</a>, which treats people for parasite&#xA0;infections</li>\n<li>The <a href=\"http://www.evidenceaction.org/dewormtheworld\">Deworm the World Initiative</a> of Evidence Action, which provides advocacy and technical assistance to governments to conduct&#xA0;deworming.</li>\n</ol>\n<h3>As of December 2014, <a href=\"http://www.animalcharityevaluators.org/recommendations/top-charities/\">Animal Charity Evaluators</a>&#xA0;recommends:</h3>\n<ol>\n<li><a href=\"http://www.animalequality.net/\">Animal Equality</a>, which advocates for farmed animals through media outlets, grassroots outreach, undercover investigations, and legal and corporate&#xA0;outreach</li>\n<li><a href=\"http://www.mercyforanimals.org/\">Mercy For Animals</a>, which advocates for farmed animals through undercover investigations, corporate and legal outreach, online vegetarian ads, and grassroots&#xA0;outreach</li>\n<li><a href=\"http://thehumaneleague.com/\">The Humane League</a>, which advocates for farmed animals through online advertising, grassroots outreach, public campaigns, presentations, and corporate&#xA0;outreach.</li>\n</ol>\n<h2>Resources</h2>\n<ol>\n<li><a href=\"http://www.givewell.org/\">GiveWell</a> and <a href=\"http://www.animalcharityevaluators.org/\">Animal Charity Evaluators</a> find the best charities in existence and publish each step of their&#xA0;processes.</li>\n<li>The <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy Project</a> investigates promising giving opportunities including those that lie outside the focus of&#xA0;GiveWell.</li>\n<li><a href=\"http://www.givingwhatwecan.org/\">Giving What We Can</a> accepts pledges from effective altruists who plan to donate at least 10% of their&#xA0;income.</li>\n<li><a href=\"http://80000hours.org/\">80,000 Hours</a> provides career coaching for everyone who wants their life to have the greatest possible positive&#xA0;impact.</li>\n<li><a href=\"http://charityscience.com/\">Charity Science</a> experiments with different ways to conduct outreach and&#xA0;fund-raising.</li>\n<li>The <a href=\"http://www.effective-altruism.com/\">Effective Altruism Forum</a> can help you find answers to your&#xA0;questions.</li>\n<li>The <a href=\"https://www.facebook.com/groups/effective.altruists/\">Effective Altruists Facebook group</a> provides you with another forum for effective altruism&#xA0;discussions.</li>\n<li><a href=\"http://effectivealtruismhub.com/\">Effective Altruism Hub</a> encourages you to be public about your donations to inspire&#xA0;others.</li>\n</ol>\n<div>\n<hr>\n<ol>\n<li>\n<p><span>D.T.</span> Jamison et al., <a href=\"http://www.dcp-3.org/dcp2\"><em>Disease Control Priorities in Developing Countries</em></a>, 2nd ed., <span>NCBI</span> bookshelf (World Bank Publications, 2006), 52, <span>ISBN</span>: 9780821361801.&#xA0;<a title=\"Jump back to footnote 1 in the text\" href=\"#fnref:dcp2\">&#x21A9;</a></p>\n</li>\n<li>\n<p>Toby Ord, &#x201C;<a href=\"/ea/70/the_moral_imperative_towards_costeffectiveness/\">The Moral Imperative Towards Cost-Effectiveness</a>,&#x201D; 2012.&#xA0;<a title=\"Jump back to footnote 2 in the text\" href=\"#fnref:to-imp\">&#x21A9;</a></p>\n</li>\n<li>\n<p>The Life You Can Save, &#x201C;<a href=\"https://www.youtube.com/watch?v=sagg2C30RMk\">Peter Singer</a>,&#x201D; 2009.&#xA0;<a title=\"Jump back to footnote 3 in the text\" href=\"#fnref:pond\">&#x21A9;</a></p>\n</li>\n<li>\n<p>GiveWell, &#x201C;<a href=\"http://www.givewell.org/international/technical/criteria/cost-effectiveness/cost-effectiveness-models\">GiveWell&#x2019;s Cost-Effectiveness Analyses</a>,&#x201D; 2014.&#xA0;<a title=\"Jump back to footnote 4 in the text\" href=\"#fnref:gw-ce\">&#x21A9;</a></p>\n</li>\n<li>\n<p><span>UNICEF</span>, &#x201C;<a href=\"http://www.unicef.org/mdg/childmortality.html\">Reduce Child Mortality</a>,&#x201D; 2005.&#xA0;<a title=\"Jump back to footnote 5 in the text\" href=\"#fnref:unicef\">&#x21A9;</a></p>\n</li>\n<li>\n<p>Animal Charity Evaluators, &#x201C;<a href=\"http://www.animalcharityevaluators.org/recommendations/top-charities/\">Top Charities</a>,&#x201D; 2014.&#xA0;<a title=\"Jump back to footnote 6 in the text\" href=\"#fnref:ace-topcharities\">&#x21A9;</a></p>\n</li>\n<li>\n<p>Owen Cotton-Barratt, &#x201C;<a href=\"http://www.effective-altruism.com/ea/6c/human_and_animal_interventions_the_longterm_view/\">Human and Animal Interventions: The Long-Term View</a>,&#x201D; 2014.&#xA0;<a title=\"Jump back to footnote 7 in the text\" href=\"#fnref:ocb-animals\">&#x21A9;</a></p>\n</li>\n</ol></div></body></html>", "user": {"username": "Telofy"}}, {"_id": "2XJzkXAGEcjCh2vJ5", "title": "EA housemates: a good idea? Plus how to find them", "postedAt": "2015-01-20T22:17:46.291Z", "htmlBody": "<html><body><p><a href=\"http://effectivealtruismhub.com/user/alex-flint\">Alex Flint</a> recently wrote:</p>\n<blockquote>\n<p>Is there any way for EAs who are looking for housemates to find each other?</p>\n<p>Living with other EAs is a really powerful way to strengthen the community, and finding like-minded housemates can also have a financial impact for many of us.</p>\n<p>If there&apos;s nothing already out there then I&apos;m going to make something.</p>\n</blockquote>\n<p>I answered that there is: the <a href=\"http://skillshare.im/?category=lodging\">&apos;lodging&apos;</a> category on <a href=\"http://skillshare.im/\">SkillShare</a>, the website for sharing among effective altruists. If anyone is interested in finding EA housemates I&apos;d encourage them to say so there, creating an &apos;Offer&apos; if they already have a house and a &apos;Request&apos; if they&apos;re looking for one. (To do so, you click &apos;Sign in or sign up&apos; at the top right, then click the resultant &apos;+&apos; icon at the top right.) If multiple people are looking for shared housing in the same area, they can find each other and arrange it. I thought it was worth creating this post to alert people to this possibility.</p>\n<p>Shared EA houses are quite widespread. There are several in Basel, the Bay Area, London, Oxford, and Vancouver - and that&apos;s just the ones I know of. I&apos;d be interested to hear of any elsewhere! I&apos;d also be curious what people think of the phenomenon. Most considerate housemates ever? Or a bit &apos;cultish&apos;, or insular, or bad PR?</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "i7AEZDqh6Jfuz5mcy", "title": "Meetup : How to live on a low budget", "postedAt": "2015-01-19T19:07:01.673Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1v\">How to live on a low budget</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>01 February 2015 02:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Utrecht, La Place, Rijnkade 5</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We meet every two weeks for an informal meetup about effective altruism. For more information, see meetup.com (<a href=\"http://www.meetup.com/LWEANL/events/219938710/\">http://www.meetup.com/LWEANL/events/219938710/</a>), which is supposed to be up-to-date.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1v\">How to live on a low budget</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "YLwHcFFrc4brRCKNz", "title": "January Open Thread", "postedAt": "2015-01-19T18:12:55.433Z", "htmlBody": "<html><body><p><span>Welcome  to January&apos;s open thread on the Effective Altruism Forum. This is our  place to discuss relevant topics that have not appeared in recent  posts.</span></p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "pBBePCYkr24JhwJtu", "title": "Meetup : THINK OTTAWA", "postedAt": "2015-01-18T02:48:52.845Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1u\">THINK OTTAWA</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>22 January 2015 07:30:00PM (-0500)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Ottawa, Ontario</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p><a href=\"http://www.meetup.com/THINK-The-High-Impact-Network-Ottawa/events/219246758/\">http://www.meetup.com/THINK-The-High-Impact-Network-Ottawa/events/219246758/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1u\">THINK OTTAWA</a></h2></body></html>", "user": {"username": "chrishart44"}}, {"_id": "CkikpvdkkLLJHhLXL", "title": "Supportive scepticism in practice", "postedAt": "2015-01-15T16:35:57.403Z", "htmlBody": "<p><i>This post is co-authored by Jess Whittlestone and Michelle Hutchinson</i></p><p>In <a href=\"https://forum.effectivealtruism.org/posts/qBbyx8KyGhFe3Dy3C/supportive-scepticism\">a previous post</a>, Jess talked about how our scepticism as a community might be threatening our ability to be supportive of one another. In this post, Jess and I would like to explore some concrete ways in which we can all be more supportively sceptical.</p><h1>Supportive scepticism requires a conscious effort</h1><p>First, let’s just highlight that for most of us, it’s incredibly difficult to take criticism well - and that’s natural. In his best-selling book “How to Win Friends and Influence People”, Dale Carnegie goes so far as to advise that you should never criticise anyone. Criticism puts people on the defensive, he claims, so they’ll rarely take it on board or learn from it - most likely, it will just lower their opinion of you. But most of us care about more than simply winning friends and influencing people - we want to try and figure out true answers to difficult questions.</p><p>This suggests that we face a tough challenge if we want to both give critical feedback and remain motivated and caring towards each other. Although we’re a community of people who value feedback and scepticism more than average, it’s important to acknowledge that we’re all human, and all likely to find critical feedback difficult. It’s not just a matter of “not being mean” - we’re all going to need to make a conscious and deliberate effort to think about how the things we say might come across and affect others. This isn’t just a problem we can brush off - it needs a lot of thought and effort if everyone is going to feel positive and supported.</p><h1>Why are you giving feedback?</h1><p>Before giving someone a piece of feedback, you might want to think about a couple of questions: How are you feeling? Why are you giving this feedback, and why now? What is the best possible outcome?</p><p><a href=\"http://zenhabits.net/how-to-give-kind-criticism-and-avoid-being-critical/\">This post</a> has a nice breakdown of the various different reasons we might give critical feedback:</p><ul><li>To help someone improve</li><li>To see a change we would like</li><li>To further the discussion</li><li>To hurt someone</li><li>To vent frustrations</li><li>To boost our ego</li></ul><p>Hopefully the latter three don’t occur too much in this community, but it’s worth being aware that sometimes we might say something critical for bad reasons. So it may be helpful to check whether the reason you’re commenting is one of the first three. If it isn’t, it’s probably best to refrain from saying anything.</p><p>One way to check that you’re not motivated by the latter reasons could be to consider how you’re feeling as you comment - whether you feel angry or hurt, for example. As well as knowing that you’re motivated by one of the first three reasons, it’s often useful to know which, because it means you can focus on framing your criticism in the best way to achieve that goal.</p><h1>Consider context</h1><p>Some situations are more appropriate for critical feedback than others. It’s important to consider the content of the post, who the poster is, who they are addressing and where they are posting it, for example.</p><p>Suppose someone posts a ‘feel good’ article about some way in which the world is getting better on their own facebook wall. They may well find it demotivating to have the article criticised, and the benefit of criticism in this situation is also probably quite minimal. This seems quite different to a case in which someone posts an idea they had in a group, asking people what they think of it - where critical feedback is much more appropriate.</p><p>Timing can also be important: is the feedback about a project which the person is about to embark on, such that they can take your feedback into account? This seems an ideal time to provide feedback. On the other hand, giving someone feedback when they’ve already completed a project and can’t act on it risks just making them feel bad.</p><p>If you’re in an ongoing conversation, it might be useful to take note of how the person is responding to your comments. If they appear to be at all upset or defensive, it is likely to be better to step back from criticising them. Another piece of advice Carnegie has is taking care to avoid arguments. He points out that they often simply cement each side’s views, and leave both parties feeling worse about each other. If a discussion seems to be taking that turn, it might be better simply to listen to the other side, and be grateful for their input, rather than continuing to put forward your view. If you find that too difficult, then the best move is probably to bow out entirely.</p><h1>The importance of positive feedback</h1><p>Whether you’re giving feedback on an idea, a blog post or a whole project, the person you’re talking to has likely put in effort and good work towards a valuable goal. Highlighting what you think they’ve done well, what is valuable and what you admire in what they have done is likely to make them feel more motivated and more likely to take improvements you suggest on board. Likewise, people tend to feel motivated by acknowledgement of and gratitude for their hard work. We’re so lucky to be part of a community where there are so many nice people working so hard to help others, which thankfully makes it easy to find positive things to say under most circumstances (though unfortunately it’s also really easy to forget to look for them!).</p><p>The popular management handbook ‘The One Minute Manager’ highlights the importance of using praise to encourage people, not just highlighting flaws in people’s work. It contains a favourite sentiment of Michelle’s: “Here we put the accent on the positive. We catch people doing something right.” It’s so much easier to produce work and to share your thoughts when you feel they’ll be appreciated and useful than if you expect only negative reactions to them.</p><p>It might be particularly good to start and end your comment by telling the person what you like and admire about their post. This is particularly the case if you think the overall idea is a good one, though you think there are particular refinements that could be made. That way the person has an overall positive feeling toward your comment, which will hopefully leave them feeling enthused to carry out the specific suggestion you had.</p><p>An underlying theme here is to cultivate an attitude of appreciation for others. Being grateful for the hard work people put in and respectful of the good work they are doing, whether that’s in writing a blog post or carrying out a project, allows us to discuss with them ways in which they might be able to do even better without putting them on the defensive. Since it’s <a href=\"http://www.health.harvard.edu/healthbeat/giving-thanks-can-make-you-happier\">well established that being grateful makes you happier</a>, this should benefit you, too!</p><h1>Highlighting areas of agreement</h1><p>Highlighting areas of agreement between you and the person you’re addressing could also work well to improve a discussion. Adam Grant writes in Give and Take about the fact that ‘rare commonalities’ can bring people together: you naturally feel close to someone who has something in common with you, and the more so the more rare the thing you have in common is.</p><p>Highlighting the assumptions you share with someone you’re talking to could make you feel more like you’re engaging in a collaborative search for truth rather than arguing. Similarly, if you’re suggesting some improvement, frankly acknowledging that it’s something you could also be doing better can help you connect, and also prevent you from coming across as patronising - thereby again cultivating a feeling of shared pursuit for knowledge.</p><h1>Focusing on actions rather than people</h1><p>Feedback about character traits, or general tendencies that people have, can often feel like personal attacks. For that reason, it can be better when suggesting improvements to focus on particular actions, rather than on people’s dispositions. For example, it might be more constructive to say ‘claim X in this argument seems overconfident’ rather than ‘you seem overconfident’. While the latter feels like a criticism of you as a person, the former is more like a suggestion that you rephrase a particular claim you made.</p><p>One complication of this might be when criticising projects people feel extremely invested in. When we invest a lot of time and energy in a project, we often end up investing a large part of ourselves in them too. This means an attack on that project can end up feeling like an attack on your identity. It’s worth bearing this in mind when we give feedback on a specific project we know someone is somewhat invested in. In this cases, we probably need to make even more effort to give positive encouragement as well as constructive feedback, and to be extra conscious of the language and tone we use.</p><h1>Being specific and constructive</h1><p>The more specific and constructive a piece of advice is, the easier it is to act on, and the easier it is to feel positive about. In an ideal world, we would each have the time and motivation to look into every piece of feedback we got, and work out how we could act on it. In practice, frequently we don’t. Making a comment actionable could ensure it gets acted on rather than forgotten about.</p><p>Framing is also important - framing a comment as a way of making something even better than it already is, is likely to empower the person to want to improve their post. On the other hand, saying that a particular feature is bad runs the risk of creating an <a href=\"http://lesswrong.com/lw/21b/ugh_fields/\">ugh field</a> for that person around that area.</p><p>It might also be helpful to think about what the other person’s goals are, in order that you can frame your comments to align with those goals. That can help prevent you from talking past each other, and is extra helpful to them because it makes clear to them how they might be able to better achieve their goals.</p><h1>Hedging and warmth</h1><p>Using language that conveys warmth, support and humility may be easier said than done, but can make a huge difference. It’s difficult to know how other people will take what you write. A few things that might help:</p><p>Using ‘adding strength words’ (like ‘definitely’, ‘absolutely’, ‘extremely’) when agreeing with someone or giving positive comments, but not when criticising. People often take criticism strongly to heart. For that reason, you might, for example, want to say something like ‘this doesn’t seem quite true’ rather than ‘this is totally untrue’, since the former conveys your message while dealing less of an emotional punch.</p><p>Using exclamation marks. I was once with someone who texted two people to say he was going to be late to see them. One replied ‘Fine’ and the other ‘Fine!’. The sense we both got was that the former of these might be rather irritated by the lateness, but the latter wasn’t - which even at the time seemed pretty ridiculous!</p><p>Hedge: make clear that what you are saying is simply your opinion on the matter. Err on the side of saying ‘it might be that...’, ‘my intuition is that...’ rather than ‘this is wrong’. Online, simply stating something can seem aggressive when that was in no way the intent.</p><p>Being vulnerable: If a commenter takes a dominant tone, the person receiving the feedback is likely to feel put-down and defensive. They might react better to a tone which made clear that you have similar difficulties to theirs. For example, you might want to frame your suggestion as something that has worked for you, when you faced similar difficulties. Or, you might want to frame it as something the person may have already thought about: rather than saying ‘you should have done x rather than y’, you might ask ‘I was wondering why you decided on x rather than y?’.</p><h1>Remember, it’s a person you’re talking to</h1><p>When commenting on blog posts or having conversations with online strangers, it seems rather easy to forget that there’s a real person sat at a computer receiving your feedback. That person, like the rest of us, struggles to stay motivated and happy. Like the rest of us, they don’t have the time or skill to do everything perfectly. Remembering that could help us to remain friendly, constructive and positive in our feedback, even when we are short on time and irritated by the imperfections in a post.</p><h1>Example</h1><p>We thought it might be helpful to provide what seems to us like a great example of supportive scepticism. The following is a quoted email:</p><blockquote><p>Some feedback attached. It sounds like things are going very well, apart from [feature eggplant]. Congratulations! One thing I'd encourage you to do with these reports is, in the very first section, list something like:</p><p>A. Top 3 achievements over last 6 months (this is for qualitative stuff beyond members increases) (I'm thinking just like 3 bullet points with a sentence or two)</p><p>B. Biggest problem you have right now</p><p>This would give us an opportunity to zero in on things you might need advice on. Anyway, glad it's going well! Thanks for your hard work.</p></blockquote><p>This acknowledges and is grateful for the work put in. The person makes clear that they are happy with the overall progress, and that they are enthusiastic about that (exclamation marks!). This made it really motivating to work on the changes suggested. Acknowledging that [feature eggplant] was less than ideal indicates that the overall view was genuine rather being fakely positive. The suggestion in the body of this email (as with the attached feedback) is very specific and actionable, making it easy to implement, and it explains the benefit of the suggestion. The whole inspires a spirit optimism and collaboration.</p><h1>Where to go from here?</h1><p>It might be useful, going forward, for us to communicate to each other a bit about how we experience feedback. Someone might find it useful to hear that you found a particular piece of feedback they gave you upsetting or stressful. Even better might be to convey to someone when a piece of feedback they gave you was really helpful to you. You might also like to follow up on feedback you’ve given others, by asking them whether they found it helpful, and how it could have been more so. Hopefully we can work together to be a really supportive (as well as sceptical!) community.</p><h2>Further reading:</h2><ul><li>How to Win Friends and Influence People</li><li>The One Minute Manager</li><li>Give and Take</li></ul>", "user": {"username": "Michelle_Hutchinson"}}]